{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xotbbsqyxdo6ia76vxfnbyrlt46bj23aktx4hjaho6qebgnesk2d2zpe3f3jch2wop5uvibbvy7ik5gd2cnf2upq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11027064",
              "author": {
                "username": {
                  "text": "watcher_ikh"
                },
                "userId": "ur199030958"
              },
              "summary": {
                "originalText": "The new age film-making at its finest"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "At first glance, it may look like a story of a larger-than-life spy (their typical presentation), but it&#39;s the storytelling by Aditya Dhar that sets it apart from anything we have witnessed in not just Bollywood but the whole of Indian cinema.<br/><br/>Ranveer&#39;s character may have held back his punches, but the story and presentation, NEVER!!<br/><br/>It was because of this 214-minute length and chapter-wise divisions of the plot that I got invested.<br/><br/>As for performances, Akshaye Khanna and Ranveer were the absolute highlights of the film. Arjun Rampal was menacing as hell, and Madhavan was brilliant with his restrained act. Finally, someone presented Sanjay Dutt as a character who actually had some presence and not some idiotic villain.<br/><br/>You can literally feel the efforts Aditya Dhar has put into this film in every frame.<br/><br/>Part 2 will be even bigger and better!"
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027064/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001654",
              "author": {
                "username": {
                  "text": "AjeetK-582"
                },
                "userId": "ur211516158"
              },
              "summary": {
                "originalText": "A superb spy film with great plotting and characters, but the hero's connection feels like it's missing."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is one of those spy movies that get made only once in a long while. Excellent story. And real events have been woven into the narrative. There&#39;s no shortage of scenes that give you a thrilling experience.<br/><br/>From the timeline settings to the scenes, everything feels almost perfect. It&#39;s hard not to be captivated by Arjun Rampal&#39;s scenes, and your eyes want to know more about his character his thinking and his capabilities which the director has probably saved for the next part.<br/><br/>Akshaye Khanna has once again shown how valuable expressive eyes are in acting. Every expression accurately reveals the character&#39;s inner emotions to the viewer.<br/><br/>Because the movie doesn&#39;t show what&#39;s going on inside the main character at times, the viewers aren&#39;t able to connect with his motives.<br/><br/>I don&#39;t know why, but the romance feels forced. It could have been portrayed better. The connection between the two needed to be shown in more depth. And I didn&#39;t understand why, because of an illegal night party, the police would make so much effort to catch a person the way it&#39;s shown? That scene felt illogical to me.<br/><br/>Even though the movie is 3 hours and 40+ minutes long, the first part feels satisfying only by a small margin. Like other two-part films, this one also needed a properly structured first part.<br/><br/>Still, this movie is worth watching in the theater, and I&#39;ll probably go to the theater for the second part as well."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 10,
                "downVotes": 28
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001654/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11054058",
              "author": {
                "username": {
                  "text": "vivekhegde-21965"
                },
                "userId": "ur132664219"
              },
              "summary": {
                "originalText": "One of best screenplay and worth to watch it in cinemas"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "While the film&#39;s extreme runtime and graphic violence might be challenging for some, it is a triumph for those who appreciate &quot;substance over style.&quot; It is a rare blockbuster that respects the audience&#39;s intelligence, trading cheap jokes for sharp dialogue and formulaic plots for complex character arcs.<br/><br/>Dhurandhar is the most polished, immersive cinematic experience of the year-a &quot;must-watch&quot; for anyone tired of the template-driven action genre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-25",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11054058/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013946",
              "author": {
                "username": {
                  "text": "sudeepsharma24"
                },
                "userId": "ur54962995"
              },
              "summary": {
                "originalText": "*EXCELLENT*"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "EXCELLENT DIRECTION\nEXCELLENT SCREEN PLAY\nEXCELLENT CAST\nEXCELLENT MUSIC\nAKSHAY KHANNA IS A *GEM*\nMovie simply goes with its name dhurandhar ,\nAlso shows the reality of Pakistan inner politics and its hatred towards India ,\nIndian cinema should work on this kind of movie project.....\nThank you Aditya Dhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013946/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008587",
              "author": {
                "username": {
                  "text": "AayushS-447"
                },
                "userId": "ur211556610"
              },
              "summary": {
                "originalText": "Raw and Real"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Remember Indian directors if you made &#39;them&#39; shed tears then you must&#39;ve done some great work..\nAfter Baby and Special Ops this is the kind of Spy movie you wanna watch not some random RAW-ISI collab in Bikini BullSh**t. The action scenes felt real unlike those CGI fights on moving Boat and Plane u known what im talking abt. And honourable mentions to Akshaye Khanna his role was truly portraying what a Radical looks like.. Great piece of Art."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008587/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011594",
              "author": {
                "username": {
                  "text": "patel-guruprasad1"
                },
                "userId": "ur25015391"
              },
              "summary": {
                "originalText": "The reality of our history and defence forces!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If you want an unbiased, true look at the real threats our nation faces and the tireless sacrifices of our defence forces, Dhurandar is a must-watch. Powerful storytelling, gripping scenes, and deep respect for our soldiers make it truly impactful. It educates, moves, and reminds us of real courage."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011594/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017950",
              "author": {
                "username": {
                  "text": "RahulM-1690"
                },
                "userId": "ur211621996"
              },
              "summary": {
                "originalText": "Absolute Cinema !!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "You got hooked in the storyline since the beginning of movie with the perfectly timed and oriented introductions of all the characters and nail bitting scenes. The story doesn&#39;t allow to feel bore at any instant of movie and especially the presence and appearances of Akshay khanna nailed it completely. Like it was the best movie of the year after chaava and thanks to Aditya dhar that he shifted bollywood and spy cinema to an interesting aspect other than that cringe romance and comedy of bollywood."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017950/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031407",
              "author": {
                "username": {
                  "text": "imdbfan-048930"
                },
                "userId": "ur203169886"
              },
              "summary": {
                "originalText": "Unbelievable! 😲 and HOW?"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Wow!! Kya dekh liya yaar. Akshay Khanna acting is at par with Leonardo di Caprio in The Revenant.<br/><br/>What a Movie! I still can&#39;t believe. 😲👏🏻👌🏻👏🏻\nThe Director is magician, and Actors did they part so well. Ranbir fully justified his acting for this particular role, and it suits him so so well. So well preperd he seems for this role. Akshay Khanna don&#39;t have much dialogues, but still he speaks and louder with clarity through his expressions and acting. Amazing. OMG, he acted better than Nawaz, Ifran, Manoj, KK Menon, OM puri etc. The weekdays have around 50% + occupancy in theater. Must watch in Theater! It&#39;s an experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031407/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027973",
              "author": {
                "username": {
                  "text": "RR8"
                },
                "userId": "ur149031672"
              },
              "summary": {
                "originalText": "Amazing direction and an all star cast to match"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "While the movie is 3.5hrs long, it&#39;s so fast paced with amazing direction, you can&#39;t tell. The cast choice is on point and while graphically violent (and some questionable cgi in places), its gripping and fits with the story. The interlacing of real life footage and audio from historical events brings the events to life and adds an extra depth to the movie.<br/><br/>A must watch in the cinema if possible."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027973/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11088699",
              "author": {
                "username": {
                  "text": "lakshmishaks88"
                },
                "userId": "ur54619649"
              },
              "summary": {
                "originalText": "Durandhar: A Once-in-a-Generation Triumph (11 out of 10 stars)"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I&#39;ll admit, I was apprehensive about the length of Durandhar. Too many films mistake runtime for depth. But once it began, time simply dissolved. By the time the credits rolled, I wasn&#39;t relieved it was over - I was wishing for more. That&#39;s the mark of cinema that grips you completely.<br/><br/>The music deserves special mention. In most films, it&#39;s treated like wallpaper - stock tracks pasted in to fill silence. Here, the score is as vital as the narrative itself. It breathes with the story, heightens emotion, and becomes inseparable from the film&#39;s identity.<br/><br/>What truly astonishes is how you feel for every character. Even someone like Donga, who could have been a throwaway presence, leaves a lasting impression. That&#39;s not just good writing - that&#39;s direction and casting working in harmony to give dimension to every role.<br/><br/>The sets are jaw-dropping. The attention to detail is obsessive in the best way, creating a world so textured and authentic that you forget you&#39;re watching fiction. This level of craft is rare in Indian cinema, where production design often settles for broad strokes. Here, it&#39;s meticulous, immersive, and unforgettable.<br/><br/>Technically, the film is a clinic: cinematography that frames emotion without vanity, editing that respects rhythm, and sound design that knows silence can be louder than noise. Performances are lived-in, not performed - actors chosen for their ability to inhabit roles, not for their surnames.<br/><br/>Durandhar isn&#39;t just another release. It&#39;s once-in-a-generation cinema - the kind of film that redefines what the medium can achieve.<br/><br/>Verdict: 11/10. Not because it&#39;s flawless, but because it makes you believe again in the power of storytelling."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-02",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11088699/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016853",
              "author": {
                "username": {
                  "text": "ValleDk"
                },
                "userId": "ur84585083"
              },
              "summary": {
                "originalText": "A good watch."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Bollywood doesn&#39;t really make good movies these days.<br/><br/>But then comes something like this. It feels like a little to much on the propaganda side. But still a good watch, the cast did so well. But the made up spy part and etc was a little to much, because none of that really happened so it gives a wrong impression.<br/><br/>I did my fair share of research after watching the movie. And a lot of it, is just claims from one country to another. The same way Pakistan blames India for several attacks on their soil coordinated with the afghans, India blames Pakistan. So it&#39;s words against words. Without having any real proof. So I think these 2 countries should stop the propaganda and maybe start getting along. But a good movie nevertheless.<br/><br/>Akshay Khanna stood out and made this long movie worth the while."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016853/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11066969",
              "author": {
                "username": {
                  "text": "WorldMovie99"
                },
                "userId": "ur71194760"
              },
              "summary": {
                "originalText": "Long but Average.."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar delivers brutal action sequences and Ranveer Singh&#39;s committed performance as the undercover agent keeps things engaging. The Karachi underworld feels vivid, with tense cinematography plunging viewers into gritty alleys. However, the 3+ hour runtime drags in the middle, testing patience despite the high-stakes plot. Solid spy fare, but not groundbreaking.<br/><br/>Aditya Dhar&#39;s direction shines in technical craft-score and editing build real suspense amid moral dilemmas. Akshaye Khanna and supporting cast add depth to the criminal ecosystem. Pacing falters with indulgent subplots and overt jingoism that dilute the core tension. Entertaining in bursts, but feels bloated. The film&#39;s immersive world-building and disturbing scenes, like the 26/11 nod, evoke strong emotions. Action is raw and immediate, setting a genre benchmark without fluff. Yet, the lengthy runtime and unnecessary elements make it exhausting rather than exhilarating. Worth a watch for visuals alone. Ranveer Singh anchors the chaos with layered intensity, while brutal gore justifies the adult rating. Background score pulses effectively through high-tension ops. Script overloads on politics, losing focus and emotional resonance by the end. Decent thriller, needs trimming. Strong atmosphere in Lyari&#39;s dangers and clever strategic planning hook early. Dhar&#39;s control over spectacle rewards patient viewers. Prolonged exposition and propaganda vibes undermine the grit, turning potential masterpiece into a slog. Midway appeal only. A 5/10."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11066969/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033469",
              "author": {
                "username": {
                  "text": "snehalpatel-07062"
                },
                "userId": "ur99784355"
              },
              "summary": {
                "originalText": "Awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar surprised me completely. I watched it and loved every minute of its raw energy, gripping storytelling, and powerful performances. It&#39;s the first Bollywood film this year during which I didn&#39;t fall asleep. The ending left me excited and eagerly waiting for part two. Truly memorable cinema!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033469/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033823",
              "author": {
                "username": {
                  "text": "zorrothefox"
                },
                "userId": "ur5333912"
              },
              "summary": {
                "originalText": "A hard-hitting, uncomfortable watch that needed to be made"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not an easy film to sit through, and that is precisely its strength.<br/><br/>The acting is outstanding across the board. Performances feel restrained, realistic, and emotionally grounded rather than theatrical. The direction is tight and confident, refusing to dilute the subject matter for mass comfort. This is a serious film with intent, not a crowd-pleasing spectacle.<br/><br/>What Dhurandhar does exceptionally well is its unflinching portrayal of systemic corruption, political cowardice, and the repeated institutional failure of the Indian state when dealing with Pakistan-sponsored terrorism. The film makes it painfully clear how early intelligence warnings were ignored or buried, how responsibility was diffused, and how decisive action was avoided at crucial moments. The portrayal of an impotent government response feels disturbingly close to reality.<br/><br/>The tone is grim and relentless. The violence is graphic and often disturbing. This is not stylized violence. It is raw, brutal, and meant to unsettle. Because of this, it is absolutely not suitable for children below 18. Parents should not underestimate how intense some sequences are.<br/><br/>Dhurandhar does not offer easy catharsis or neat resolutions. It forces the viewer to confront uncomfortable truths and sit with anger, grief, and frustration. That alone makes it stand apart from most mainstream political thrillers.<br/><br/>By the time the film ends, it is clear that this is only part of a larger story. The setup for Part 2 is compelling, and expectations are understandably high.<br/><br/>Overall, Dhurandhar is a bold, hard-hitting film with great acting and direction, unapologetic in its political stance and emotional impact. It is disturbing, thought-provoking, and necessary. Now waiting to see if Part 2 delivers the accountability and closure that Part 1 deliberately withholds."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033823/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008666",
              "author": {
                "username": {
                  "text": "jhadiwakar-10680"
                },
                "userId": "ur100176899"
              },
              "summary": {
                "originalText": "Dhurandar is dhurandar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is a movie for every nationalist. Dhurandar will give you one more reason to love your nation. Its long, yes, but there are hardly 5-7 minutes that feels unnecessary. If movies like these don&#39;t get our attention it would be very disappointing for good nationalist filmmakers. Show this movie to those who are unaware of our recent political history, although if you know of it already you will enjoy or understand this movie morr."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008666/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027870",
              "author": {
                "username": {
                  "text": "TreeFiddy53"
                },
                "userId": "ur118562022"
              },
              "summary": {
                "originalText": "Hindi movie of the year!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "When Bollywood gives you the names and resources to make a spy-thriller film, make a Dhurandhar and not anything that belongs to the YRF-Spyverse. This film was a crazy ride, driven primarily by writing that was miles ahead of War 2 and other commercial goop you&#39;ve seen this year. (Loki, take notes.)\nPerformances - amazing across the board. As earth-shattering as the media and fans claim? No. Music and sound design - amazing throughout (Ani-bro, take notes) Fasla - catchy, refreshing. One for the ages? No. Cinematography - top notch. Those sweeping shots of the landscape - oof.<br/><br/>You feel the length of the film though. What would I cut out of the film? I don&#39;t know. There&#39;s a 20-min segment that one would make a case for but without that, the natural progression of the plot falls flat. Commercial? You bet. This will have almost all the mirch-masala you&#39;d expect but it doesn&#39;t feel deliberate. I&#39;m glad they didn&#39;t overdo you-know-what.<br/><br/>In my books, strictly as a film, this was better than Uri, and easily Bollywood&#39;s film of the year (Sorry, Homebound)\nEager to see what P2 has to offer in March 2026."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027870/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027493",
              "author": {
                "username": {
                  "text": "RushabhP-8"
                },
                "userId": "ur211699248"
              },
              "summary": {
                "originalText": "Amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "True story of India from aspect of terrorism from Pakistan from last 40 years. There are so many reality scenes of terror attacks of 2011 Mumbai attack, kandhar Hijack, or parliament attack. Actors are amazing. Shame on gulf countries for banning of movie. Movie scene like 2011 Mumbai attack instructions are same as reality."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027493/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011256",
              "author": {
                "username": {
                  "text": "AJITS-745"
                },
                "userId": "ur211573280"
              },
              "summary": {
                "originalText": "Midblowing!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great movie by Mr. Dhar. Storyline, visuals, acting, BGM and the experience is overall worderful. Akshay Khanna, Ranveer are superb in their roles. Madhavan is incredibly good, and completely justifies the role. The dialogue delivery, expressions are exceptionally well. Moreover, the casting of different roles are superb too."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011256/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031568",
              "author": {
                "username": {
                  "text": "bc_raghavendra-604-485763"
                },
                "userId": "ur40792041"
              },
              "summary": {
                "originalText": "Watchable"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film Dhurandhar (2025) has few positive and negative points.<br/><br/>Positive points are:\n1. Both Ranveer Singh and Akshaye Khanna have performed well.<br/><br/>2. Director Adithya Dhar has shown some courage to show the real color of Pakistan.<br/><br/>Negative Points are:\n1. The film has failed to show what was going on in Jaskirat Singh&#39;s (Ranveer Singh&#39;s) mind when he was crossing Pakistan&#39;s border. Because, this becomes a one way ticket for most spy agents. They may feel that their life in India ends there.<br/><br/>2. During the climax, Ranveer Singh turns the car towards a forest where SP Chaudhary Aslam (Sanjay Dutt) keeps waiting to kill Rahman Baloch. This deviation was the plan. But was everybody (except Ranveer) sleeping in the car a part of the plan? Well, there is no answer for this in the movie.<br/><br/>3. The movie should have shown at least some plots on how the terrorists travelled from Karachi to Mumbai on ship. How easy/difficult it was for them to reach Mumbai and how did they cross Indian Navy surveillance are not shown the movie.<br/><br/>4. The film has failed to show what was going on in India concurrently during the terror plans at Lyari. There was only one scene that came and went, which showed that the intelligent offices received message from various places, that&#39;s it. Indian audience would expect more about what was happening in India at that time.<br/><br/>5. The acting of Sanjay Dutt as a police officer was very poor. He couldn&#39;t even run properly during the climax chase.<br/><br/>6. Foul language is used more than necessity.<br/><br/>Still the movie is watchable because the reality of Pakistan is shown."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031568/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008599",
              "author": {
                "username": {
                  "text": "sumitk-6015"
                },
                "userId": "ur211557141"
              },
              "summary": {
                "originalText": "A gripping masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping espionage film that fires on all cylinders. From high-stakes intelligence missions to intense undercover sequences, the movie keeps you edge-seated throughout. The twists are clever, action scenes are top-class, and the performances - especially Ranveer Singh and Akshaye Khanna - are powerful and memorable. The story builds tension perfectly, blending espionage, crime, and emotion with rich world-building and a gripping payoff in the climax.<br/><br/>A must-watch for anyone who loves smart spy thrillers with depth, intensity, and cinematic scale! Highly recommended."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008599/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11035163",
              "author": {
                "username": {
                  "text": "prolead"
                },
                "userId": "ur110831225"
              },
              "summary": {
                "originalText": "Good but lacking in a few areas"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Overall a good movie from\nBollywood. Ranveer singh and Akshaye Khana stole the show. Sunjay Dutt failed to impress and looked very forced. The pacing of the movie was good and everything from set and setting was also good. It was refreshing to see the hero playing a subdued role as a henchman and staying tha way yet dominating with his acting. The only part I found strange was the fact that he climax of the movie depended on a coincidence and not a planned move. I am referring to the fact that Ranveer drove the car into the forested area only because all the passengers feel asleep together at the right time and at the right moment. That was too much of a coincidence to accept. If even one of the pass where had stayed awake he could not have driven the car into that area and the climax would never have materialised. Other than that it was a good watchable movie."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 3
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11035163/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020872",
              "author": {
                "username": {
                  "text": "SangramsinhK"
                },
                "userId": "ur211648533"
              },
              "summary": {
                "originalText": "Typical spy drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Yet another spy drama, I&#39;m tired of these movies. Action is pretty good but story is lacking genuineness.<br/><br/>One with bit of knowledge of indian political scenario could conclude this as a propaganda film for current govt.<br/><br/>Also it is just weird that lead female character&#39;s age in movie is 19 while lead male is much older than her. Wtf is going on?"
                }
              },
              "authorRating": 4,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 22
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020872/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031445",
              "author": {
                "username": {
                  "text": "amitsree-15008"
                },
                "userId": "ur175784061"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Finally i found a movie without any faltu scenes 😍😍😋 after a very long time. Kamaal ki casting it can be said perfect casting. Can&#39;t wait for Dhurrandar 2 😟\nWhen the movie ended it felt like avi to strt hua tha 😲 . Nice to see that zyada lamba wait nhi krna pdega 😋 eagerly waiting for 2nd part. Blockbuster movie 🍿"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031445/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031717",
              "author": {
                "username": {
                  "text": "Jazzy-Jazzy"
                },
                "userId": "ur186062886"
              },
              "summary": {
                "originalText": "Return of Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After a very long time, finally a high quality movie coming out of Bollywood. No unnecessary bikini songs, no overdramatic story plot, no cheesy dialogue, no over the top computer generated graphics. Dhurandhar is a pure cinematic experience from the acting to the background music to the sets to the directing and editing. While I was looking forward to seeing Akshaye Khanna&#39;s performance due to hype on social media, it was Ranveer Singh&#39;s performance that was the most surprising, in a good way. Akshaye Khanna no doubt is a seasoned actor and carried off his role with such authenticity and conviction. The whole cast actually did a fantastic job and complemented each other well. All the awards in every category should go to this movie, they all totally deserve it!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031717/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022970",
              "author": {
                "username": {
                  "text": "ShubhS-75"
                },
                "userId": "ur211664309"
              },
              "summary": {
                "originalText": "Dhurandhar doesn't entertain - it dominates."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A cold, calculated story where every move matters and every frame carries weight. Sharp writing, commanding performances, and zero wasted moments. The film thrives on silence as much as dialogue, letting tension build naturally instead of forcing drama. Power, ambition, and manipulation are explored with maturity, making the story feel grounded yet gripping. There are no wasted scenes, no easy shortcuts - only precision and purpose.<br/><br/>This isn&#39;t a film you casually watch. It&#39;s a film you experience, absorb, and remember long after the credits roll."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022970/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}