{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4s6hdrsqyxdo6ia7otx7mbrqpt46brt3ukdv67ealo6qebgnesk2d23ouyvljchl2rvh4akvrvvetfzzb6l4fq2lu",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11016509",
              "author": {
                "username": {
                  "text": "Kartik-837"
                },
                "userId": "ur209274614"
              },
              "summary": {
                "originalText": "fantastic and just mindblowing bang on movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It was a good movie with fantastic direction especially its way to show truth and facts very different from other spy movie it shows reality without any compromise and that 26/11 attack real rec was a masterstroke by Aditya Dhar and the cast especially Ranveer Kapoor, Akshay Khanna and Sanjay Dutt were too good and the background score of the movie will cook everything happen on the screen great remix with old songs a great decision by director and the action also plays a major role for this movie.<br/><br/>This movie is a bang on and deserve a strong 10/10.<br/><br/>NOTE: Dont focus on others just watch the movie it will not make you to feel you turn off."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016509/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11056566",
              "author": {
                "username": {
                  "text": "prateekdubey7"
                },
                "userId": "ur24602410"
              },
              "summary": {
                "originalText": "Dhurandhar: A Gripping Masterpiece That Demands Multiple Viewings"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I&#39;ve watched Dhurandhar five times already since its release, and honestly, I&#39;m still itching to book another ticket for the sixth. This isn&#39;t just a movie-it&#39;s an experience that pulls you into the gritty underworld of Karachi and doesn&#39;t let go, even after the credits roll. Directed by Aditya Dhar, this spy-action thriller is a game-changer for Bollywood, blending raw intensity, stellar performances, and edge-of-your-seat tension like nothing I&#39;ve seen in years.<br/><br/>Ranveer Singh delivers a career-defining performance as the undercover agent Hamza/Jasikirat. His transformation is mesmerizing-subtle yet explosive, with that piercing stare and restrained power that keeps you hooked. But the real scene-stealer is Akshaye Khanna as Rehman Dakait; his chilling swagger and dialogue delivery are pure fire. The supporting cast-Sanjay Dutt, R. Madhavan, Arjun Rampal, and others-elevate every scene, making the ensemble feel like a perfectly oiled machine.<br/><br/>What makes Dhurandhar so rewatchable? The storytelling is tight and immersive, despite the 3.5-hour runtime (which flies by, trust me). The action is gritty and realistic-no over-the-top heroism, just brutal, visceral sequences that hit hard. Shashwat Sachdev&#39;s background score pulses through the film, blending seamlessly with clever nods to classic tracks, amplifying the tension and emotion. The world-building in Lyari&#39;s underbelly feels authentic and dangerous, drawing you deeper with each viewing as you catch new layers in the betrayals, espionage, and character arcs.<br/><br/>Sure, it&#39;s violent and intense (A-certified for a reason), but that&#39;s what makes it stand out-it&#39;s bold, unapologetic, and refuses to spoon-feed the audience. Every repeat watch reveals more nuances in the script, performances, and technical brilliance (cinematography and editing are top-notch).<br/><br/>If you&#39;re a fan of intelligent thrillers with heart-pounding action and powerhouse acting, Dhurandhar is a must-watch on the big screen. It&#39;s not just entertaining; it&#39;s addictive. Can&#39;t wait for Part 2-Aditya Dhar has created a franchise that&#39;ll redefine the genre. Highly recommended-go watch it again (and again)! 🇮🇳🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11056566/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007414",
              "author": {
                "username": {
                  "text": "panigrahisameer"
                },
                "userId": "ur61695765"
              },
              "summary": {
                "originalText": "Just awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I rarely watch hindi movies. I am very glad that I watched this. There was not an instant where I felt bored. Story line , background music, cinematography and the cast was just too perfect. The action sequences were awesome.<br/><br/>They made a great decision to split the movie into two parts. I believe the next part will be awesome too.<br/><br/>Must watch!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007414/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007104",
              "author": {
                "username": {
                  "text": "arpitjha-41384"
                },
                "userId": "ur115069196"
              },
              "summary": {
                "originalText": "Stars, Action, and Unforgettable Moments"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s tension grows steadily, creating an immersive, morally complex universe. Ranveer Singh delivers a masterclass performance, conveying the protagonist&#39;s inner conflict alongside gripping action sequences. Sanjay Dutt&#39;s commanding presence adds gravitas, while Akshaye Khanna and R Madhavan provide subtle, intelligent performances. Arjun Rampal&#39;s quiet menace keeps suspense taut, and Sara Arjun&#39;s emotional moments provide a poignant counterpoint. Aditya Dhar directs with meticulous control, balancing strategy, suspense, and high-octane action. Cinematography captures sprawling chaos and intimate emotional beats, while the score punctuates key moments. By the climax, the story delivers thrilling and emotionally satisfying payoff."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007104/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11077659",
              "author": {
                "username": {
                  "text": "sharathkumarharishi"
                },
                "userId": "ur125197390"
              },
              "summary": {
                "originalText": "Blockbuster"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Loved this movie!. It&#39;s been so long since Bollywood gave us a real character-driven story that isn&#39;t just about the hero. Huge credit to the director for the deep research and a solid storyline that felt authentic. It&#39;s a refreshing change of pace. I&#39;m already hyped for Part 2!<br/><br/>The attention to detail really set it apart from the usual masala films. Every character felt like they had a purpose, which made the whole experience so much more engaging."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-31",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11077659/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007139",
              "author": {
                "username": {
                  "text": "sviraj-47822"
                },
                "userId": "ur118086463"
              },
              "summary": {
                "originalText": "Star-Studded Entertainment for Everyone"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film is a masterclass in storytelling, suspense, and high-octane action. Ranveer Singh delivers a layered, intense performance, Sanjay Dutt commands presence with gravitas, and Akshaye Khanna and R Madhavan provide subtle but impactful support. Arjun Rampal&#39;s quiet menace creates continuous tension, while Sara Arjun&#39;s emotional scenes provide narrative heart. Aditya Dhar&#39;s direction expertly balances strategy, plot twists, and action sequences, ensuring pacing and suspense remain taut throughout. Cinematography captures both sprawling urban chaos and intimate character moments, while the score accentuates tension. The finale delivers a perfect blend of adrenaline-fueled spectacle and emotional satisfaction."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007139/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006852",
              "author": {
                "username": {
                  "text": "Pratyush926"
                },
                "userId": "ur199121780"
              },
              "summary": {
                "originalText": "Drama That Sparks and Action That Roars"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the very beginning, the story immerses viewers into a labyrinth of danger, strategy, and intrigue. The lead&#39;s performance is layered, conveying fear, resolve, and moral complexity. Action sequences are dynamic, realistic, and narratively impactful. Cinematography and score work in tandem to create tension and emotional depth. Supporting characters are vividly drawn, enhancing the story&#39;s authenticity. Pacing and editing maintain suspense while allowing character arcs to develop naturally. By the climax, the film delivers both shocking revelations and satisfying resolution. This is a high-quality cinematic experience that leaves a lasting impact."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006852/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006431",
              "author": {
                "username": {
                  "text": "dosmzlxa"
                },
                "userId": "ur176906724"
              },
              "summary": {
                "originalText": "When Every Moment Feels Larger Than Life"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film thrives on its carefully layered writing, where each character&#39;s arc adds to the sense of escalating tension. Ranveer Singh delivers a career-defining performance, navigating moral dilemmas with subtlety and depth. The director orchestrates both explosive action sequences and quiet, emotionally resonant moments. Supporting actors bring nuance, and cinematography captures the gritty underworld with cinematic flair. The film&#39;s music and sound design enhance every twist, making it an unforgettable experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006431/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007319",
              "author": {
                "username": {
                  "text": "pravinverma"
                },
                "userId": "ur135721154"
              },
              "summary": {
                "originalText": "Stars, Action, and Unforgettable Moments"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film excels at building tension and emotional stakes simultaneously. Ranveer Singh delivers a masterful performance, portraying moral conflict, physical courage, and strategic intelligence. Sanjay Dutt commands attention in pivotal scenes, exuding menace and authority. Akshaye Khanna and R Madhavan provide subtle but critical support, and Arjun Rampal&#39;s understated menace adds tension to every interaction. Sara Arjun&#39;s emotional performance grounds the narrative. Aditya Dhar&#39;s direction ensures seamless pacing and suspenseful escalation, while cinematography and score amplify both tension and emotional beats. The climax delivers an unforgettable combination of action, strategy, and emotional payoff."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007319/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006984",
              "author": {
                "username": {
                  "text": "Pritam25447"
                },
                "userId": "ur199122896"
              },
              "summary": {
                "originalText": "A Grand Drama with Unforgettable Action Peaks"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the very first act, the film&#39;s slow-burning tension is palpable. Ranveer Singh conveys complex emotions through subtle gestures in tense negotiation sequences, while his action scenes are physically commanding and emotionally charged. Sanjay Dutt&#39;s formidable presence amplifies suspense, and every interaction with him carries weight. Akshaye Khanna and R Madhavan&#39;s performances add narrative depth, ensuring that even secondary characters leave a strong impression. Arjun Rampal&#39;s understated menace is perfectly calibrated, and Sara Arjun&#39;s scenes provide heart-wrenching human stakes. Aditya Dhar blends strategy, suspense, and visceral action with cinematic finesse. Cinematography captures both grand action set pieces and intimate character moments. By the second half, tension peaks with expertly executed plot twists, leading to a finale that satisfies both emotionally and visually."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006984/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020372",
              "author": {
                "username": {
                  "text": "mohsin-shahzad1"
                },
                "userId": "ur31544205"
              },
              "summary": {
                "originalText": "Same Story Different Actors"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "There was nothing new in the story. Such a big cast is wasted on an old story.<br/><br/>Considering Akshay, Sanjo and Arjun level of work, this film couldnt justify the work they have been doing. Same old drama of sending spys to neighbour country, getting married to their girl and then showing a climax of fulfilling a big target that is far from the reality.<br/><br/>So predictable and low grade."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 9,
                "downVotes": 159
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020372/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007235",
              "author": {
                "username": {
                  "text": "jainmanishh"
                },
                "userId": "ur118094717"
              },
              "summary": {
                "originalText": "Star-Studded Cast in a Dramatic Ride"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every aspect of the film demonstrates a careful attention to detail, from character development to action choreography. Ranveer Singh delivers a career-defining performance, skillfully portraying internal conflict while engaging in intense physical sequences. Sanjay Dutt&#39;s authoritative presence commands attention, while Akshaye Khanna and R Madhavan elevate supporting roles through nuanced portrayals. Arjun Rampal&#39;s understated menace adds a layer of tension, contrasting with Sara Arjun&#39;s tender, emotional moments that highlight the human cost of the narrative. Director Aditya Dhar meticulously balances suspense, psychological tension, and kinetic action, crafting sequences that are both thrilling and narratively justified. Cinematography captures sweeping urban landscapes, intimate interpersonal moments, and high-octane action with finesse. The score heightens drama and suspense, creating a fully immersive cinematic experience that culminates in an emotionally and narratively satisfying finale."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007235/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007199",
              "author": {
                "username": {
                  "text": "GauravS-3178"
                },
                "userId": "ur210717533"
              },
              "summary": {
                "originalText": "Temperatures rise as the drama deepens and the action unfolds"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story grips you immediately, weaving tension and intrigue through its layered narrative. Ranveer Singh delivers a career-defining performance, embodying his character&#39;s moral conflicts with subtle intensity. The supporting cast, including seasoned actors, adds depth to every confrontation and dialogue. Director Karan Dhar masterfully balances high-octane action sequences with quiet, introspective moments, while the cinematography captures both the chaos of underworld operations and the haunting stillness of personal stakes. Every frame feels purposeful, and the score heightens the suspense without overwhelming it, making the second half a gripping crescendo of emotion and adrenaline."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007199/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029305",
              "author": {
                "username": {
                  "text": "Jyo1021"
                },
                "userId": "ur88771653"
              },
              "summary": {
                "originalText": "Pinnacle of perfection!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Whoa!!! What a movie!! It&#39;s the finest in film making: the acting, directing, screenplay, music...you name it! It&#39;s just wow!! Akshaye Khanna stole the show while Ranveer Singh isn&#39;t far behind. Madhavan&#39;s role, though small in the first part, was at its finest. Rakesh Bedi, as the politician, showed his caliber in acting. The sets seemed so real! Aditya Dhar proved himself to be a finest director. A lot of dedication, hard work and conviction has gone into the making of this movie. I was glued to the screen for the full 3.5 hrs and if I had to watch for 3.5 hrs more, I&#39;d have done it. Wow!! What a movie!! Go watch it, if you haven&#39;t already!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029305/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012913",
              "author": {
                "username": {
                  "text": "PrathmeshGade"
                },
                "userId": "ur211144676"
              },
              "summary": {
                "originalText": "The Indian Award winning film of year"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A real brutal and gore experience after animal , kill and Marco ... Inspired by true events make it more curious , but one minus point is it feels lengthy like 3hr 34mins and that length feels somewhere but if you managed that then you&#39;ll have chills down your spine. And even Ranveer Singh is the spotlight but Akshay Khanna nailed it as always .... All the star cast even Sara Arjun who had a launch with this movie nailed their acting .... Really blessed to have such an inspiring and dedicated director..... Hatts off to Aditya Dhar."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012913/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029168",
              "author": {
                "username": {
                  "text": "Rakhee-90"
                },
                "userId": "ur211711109"
              },
              "summary": {
                "originalText": "Awestruck by this AMAZING movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What a Direction !! And superb Acting by all actors, very special mention to Ranveer Singh . This is sort of an eye opener to learn how agents live and serve our Country. I recommend all Indians to watch it in theatre. I am eagerly awaiting for its prelude . Aditya Dhar is a Genius in Filmmaking. Even though it has violence, I can watch it again."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029168/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010054",
              "author": {
                "username": {
                  "text": "tanuagrohi"
                },
                "userId": "ur128458682"
              },
              "summary": {
                "originalText": "Banger"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "That&#39;s how a movie should be made. Here&#39;s a crisp 50-word review:<br/><br/>**Dhurandhar** delivers a gripping blend of emotion, action, and powerful storytelling. The lead performance is magnetic, the visuals are stunning, and the narrative holds you tight from start to finish. With intense drama and striking moments of vulnerability, *Dhurandhar* stands out as a bold, compelling cinematic experience worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010054/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015917",
              "author": {
                "username": {
                  "text": "divyaprakashmishra"
                },
                "userId": "ur150795621"
              },
              "summary": {
                "originalText": "ABSOLUTE THRILLER"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I HAVE NEVER SEEN SOMETHING LIKE THIS\nFROm aKSHAY KHANNA TO R MADHAVAN..! And Real proof of stories are given💗💗💗best. Casting is best and film is also shoes thw real picture of Pakistan and how terrorist do their planning. Every should watch this songs are cherry on the top and entries arw just mind-blowing."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015917/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013209",
              "author": {
                "username": {
                  "text": "PankajK-2808"
                },
                "userId": "ur211588117"
              },
              "summary": {
                "originalText": "Awesome movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Excellent direction, editing, acting, and music. A must-watch movie based on real events. The action is great, and the entire cast has performed well-especially Akshay Khanna, whose acting is outstanding. The background score and songs are also excellent. Waiting eagerly for the next part.10/10*****"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013209/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11035922",
              "author": {
                "username": {
                  "text": "prashantkumar-17895"
                },
                "userId": "ur175389694"
              },
              "summary": {
                "originalText": "Fantastic!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Worth watching. 3.35 hrs long but it felts like nothing. Unlike some soo called spy universe&#39;s movies, it shows what real struggle of a spy looks like. It defines what a genre of filmmaking should look like. Each characters picked based on real life characters are amazing and for songs used in each scenes makes it an over the top and unforgettable movie that you will remember forever."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11035922/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007465",
              "author": {
                "username": {
                  "text": "SandeepK-1732"
                },
                "userId": "ur211549999"
              },
              "summary": {
                "originalText": "Just Awesome 😎 Pure Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "DHURANDHAR is one of those rare films where you feel everything is perfectly placed - direction, music, performances, and overall impact. From the very first scene till the end, the film keeps you completely hooked. The director deserves full credit for handling such a powerful subject with control and maturity. The storytelling is sharp, engaging, and emotionally strong. Every frame feels purposeful.<br/><br/>The songs are beautifully blended into the narrative and never feel forced. Background score quietly lifts the intensity and makes key moments even more impactful. The technical quality, camera work, and editing are top class and give the film a big-screen feel in the true sense.<br/><br/>Coming to performances - this is truly a multi-starrer done right. @ActorMadhavan once again proves why he is one of the most reliable actors in Indian cinema. @akshaye_khanna delivers a performance full of depth and silence that speaks louder than words. @Rampal72 brings solid intensity and control to his role. @duttsanjay commands the screen with his strong presence and experience. @RanveerOfficial surprises with his range and energy, showing a completely different side.<br/><br/>What really works is that no one tries to overpower the other. Everyone supports the story. That is the biggest strength of this film.<br/><br/>DHRANDHAR is not just entertainment, it is proper cinema with substance. It makes you think, feel, and stay with the characters even after the movie ends. The ending clearly opens doors for the second part, and honestly, the wait has already started.<br/><br/>Stop listening to random opinions and online noise. Some films are meant to be experienced, not judged through reviews. DHRANDHAR is one such film. Just go, watch it on the big screen, and feel it yourself."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007465/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013513",
              "author": {
                "username": {
                  "text": "jeetsaraswat"
                },
                "userId": "ur80042965"
              },
              "summary": {
                "originalText": "Don't only watch, feel the revenge."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie with so many tracks and each track fits in the situation perfectly, immense action, great camera work and acting so powerful that u can feel the pain, love for your country and each emotion which is going on the screen. Dialogues are so powerful that you can relate with your enemy. Background music is soul of the movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013513/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007147",
              "author": {
                "username": {
                  "text": "negirohan-02449"
                },
                "userId": "ur118091080"
              },
              "summary": {
                "originalText": "Larger-Than-Life Drama and Excitement"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is deliberate and methodical, pulling audiences into a world where trust is fragile and every decision matters. Ranveer Singh anchors the film with a performance full of nuance, balancing fear, courage, and moral ambiguity with breathtaking subtlety. Sanjay Dutt&#39;s commanding presence elevates every confrontation, his mere gaze enough to create tension. Akshaye Khanna and R Madhavan contribute quiet intelligence and layered complexity, while Arjun Rampal adds menace that simmers beneath the surface. Sara Arjun&#39;s vulnerable, heartfelt scenes make the stakes deeply relatable. Aditya Dhar directs with precision, orchestrating high-octane action and intimate emotional beats seamlessly. Cinematography captures chaos, quiet tension, and dramatic landscapes with finesse, while the score enhances suspense, signaling danger and emotional intensity at key moments. The second half crescendos with heart-stopping action, plot twists, and emotional revelations, creating a finale that is as cathartic as it is thrilling."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007147/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016392",
              "author": {
                "username": {
                  "text": "AvdheshB-67"
                },
                "userId": "ur211610150"
              },
              "summary": {
                "originalText": "Best indian spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is the best,realistic,grounded indian spy thriller,action movie.<br/><br/>The editing is not orthodox,but feels fresh\nAnd the crisp dialogues have weight when delivered on respective situations.<br/><br/>This movie has Good re-watch ability,personally watched twice and recommended to watch in theatre for best experience.<br/><br/>Only thing i have complain about that pakistani delect which could have been better."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016392/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020508",
              "author": {
                "username": {
                  "text": "rajroy-06121"
                },
                "userId": "ur76114039"
              },
              "summary": {
                "originalText": "Truth is Stranger than Fiction"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "As a 90&#39;s kid who grew up watching socio-political thrillers like Spygame, Pelican Brief, The contender, Enemy of the state, Clear and Present Danger, Bourne series, Body of lies to The Departed, I have to admit Dhurandhar surpasses the benchmark set by those Hollywood films. The execution was beyond my very humble knowledge of film making. What Adiyta Dhar has made possible is that in the theatre I found myself in the shoes of the character of Ranvir Singh - and it was a roller-coaster ride. The leftist cabal is not only wrong about their criticism, they are actually the ones who are making propaganda against such a revolutionary Indian film.<br/><br/>They say truth is stranger than fiction - the amount of reserach that has gone behind the movie is incredible. As viewer although you all will be tempted to think it was a fictional story but I got a sneaky feeling the storyline is actually fact.<br/><br/>Spoiler Alert : The movie is NOT anti-Muslim, it is NOT even anti Pakistan, if anything, it is pro-India which the movie will make you feel with very subtle nuances."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020508/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}