{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4x6bcjsqyxdo6id7wvh3nrsrtumqcb53qnt74pfado6qebgnesk2dcyouzfzjche4cglp4veggrp4gbt2myuazjee",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11032027",
              "author": {
                "username": {
                  "text": "imdbfan-9312740040"
                },
                "userId": "ur198001524"
              },
              "summary": {
                "originalText": "Excellent movie, best actor, true story, and nicely showcased."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I was completely surprised and shocked that we were unaware of all these incidents happening right under our noses. The film reveals how some Indian politicians and others were involved and helping Pakistan execute major attacks like the IC-814 plane hijack, the Parliament attack, and 26/11 - with Indian people assisting from within.<br/><br/>On top of that, the acting was fabulous, especially Akshaye Khanna who was absolutely the best - his performance as the gangster is unforgettable and steals every scene. Ranveer Singh also delivers powerfully as the undercover agent. Overall, this is the best movie - gripping from start to finish, with intense action, betrayals, and a story inspired by real events that keeps you on the edge of your seat.<br/><br/>The supporting cast, including Akshaye Khanna, R. Madhavan, Sanjay Dutt, and Arjun Rampal, adds great depth. Bold and ambitious filmmaking that redefines the spy genre. A must-watch in theaters for the big-screen experience! Can&#39;t wait for Part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032027/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024962",
              "author": {
                "username": {
                  "text": "arpanp-38965"
                },
                "userId": "ur125489921"
              },
              "summary": {
                "originalText": "What was that!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a razor-sharp political thriller that understands the power of restraint. It doesn&#39;t rely on noise or spectacle to command attention; instead, it pulls you in with strategy, psychology, and a constant undercurrent of danger. This is a film that treats intelligence as its primary weapon-and trusts the audience to keep up.<br/><br/>At the heart of Dhurandhar is a world driven by agendas rather than emotions. The narrative unfolds like a carefully planned operation, where every move has consequences and every character carries hidden intent. The story refuses to divide people into heroes and villains; instead, it presents operators-individuals shaped by ideology, ambition, and survival. That moral greyness is what gives the film its edge.<br/><br/>The performances are one of the film&#39;s strongest assets. The lead commands the screen with a controlled, almost chilling presence, proving that power doesn&#39;t need loudness. Supporting actors elevate the tension further, bringing gravitas, unpredictability, and authority to their roles. No performance feels wasted; each character exists for a reason, and each leaves a mark.<br/><br/>Direction and writing work in perfect sync. The screenplay is tight and intelligent, avoiding unnecessary exposition. Dialogues are crisp, layered, and often loaded with subtext. A single conversation can feel more dangerous than an action sequence-and that&#39;s where Dhurandhar truly shines. The pacing is deliberate, but never dull; it mirrors the mindset of its characters-patient, calculating, and precise.<br/><br/>Visually, the film maintains a grounded, serious tone. The cinematography complements the narrative without drawing attention to itself, while the background score subtly builds unease rather than dictating emotion. The editing keeps the tension intact, especially during moments of strategic confrontation.<br/><br/>What lingers after the film ends is its unsettling honesty. Dhurandhar doesn&#39;t offer comfort or closure. It reflects a world where intelligence can manipulate truth, loyalty is conditional, and victory often comes at a moral cost. It asks difficult questions-about power, nationalism, and ethics-without offering easy answers."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024962/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11054200",
              "author": {
                "username": {
                  "text": "worldofskd"
                },
                "userId": "ur35821167"
              },
              "summary": {
                "originalText": "A action packed spy thriller with a solid antagonist."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Spoilers ahead.<br/><br/>The movie was great and keeps the audience on the edge of the seat throughout the whole movie. Portrayal of hostage negotiation by indian secret service, then start of the DHURANDHAR programme by the Indian intelligence service. The epic entrance of our protagonist Hamza (Ranveer Singh) and the career of the antagonist Rehman Dakait/Galoch ( Akshay Khanna) is seen in the action packed scenes of the Lyari Underworld. How he (Rehman) emerges to power in the political field with Hamza&#39;s help and how he establishes his force within the political atmosphere; his connection to Pakistani intelligence to conduct terror attacks is portrayed with raw and vivid imagery. The role of Sanjay Dutt (SP Chaudhuri Aslam) is also relevant to the storyline.<br/><br/>Overall it is violence packed and strongly retains its A+ rating. After his(Rehman&#39;s) death, the story is open for a prequel to Hamza (Jaskirat Singh Rangi)&#39;s story of recruitment to Indian intelligence and his training; for the next movie &quot;REVENGE&quot; to be released in 23rd March 2026."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-25",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11054200/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009642",
              "author": {
                "username": {
                  "text": "AyushP-027"
                },
                "userId": "ur211561362"
              },
              "summary": {
                "originalText": "best Bollywood big budget movie ever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Matches the hype and even exceeds it. The entire cast performs well. It does not drag on despite the long runtime. The music choice is goated. Dividing the movie into chapters is a novel choice. The action scenes are superb albeit with a lot of gore which I liked(some won&#39;t).<br/><br/>All in all a gripping performance by everyone involved. This movie restores faith in Bollywood&#39;s ability to make good original films."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009642/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11035202",
              "author": {
                "username": {
                  "text": "VivekP-561"
                },
                "userId": "ur211761835"
              },
              "summary": {
                "originalText": "A Gripping Spy Thriller Worth Every Minute"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watched Dhurandhar overseas in Canada, and the show was completely housefull. I managed to get tickets only after a week, which already showed how strong the buzz was. Despite its long 3 hour 34 minute runtime, the movie never feels boring. It&#39;s a gripping action-spy thriller inspired by real events that keeps you fully engaged and seated throughout. Powerful performances, realistic action, and strong direction make it a true cinematic escape. Definitely worth watching on the big screen."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11035202/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11072682",
              "author": {
                "username": {
                  "text": "sanveer-48500"
                },
                "userId": "ur76030203"
              },
              "summary": {
                "originalText": "Not Worth the Hype"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a watchable movie that does not live up to the hype. It has copied the violence in Animal and there is not enough depth and character development despite being 3h15 (version that I watched at the Cinema).<br/><br/>I have so much more to say but then there would be too many spoilers in my review.<br/><br/>Just keep in mind that you will not be missing anything if you do not watch this movie. Nobody will remember it in a few years."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 4
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11072682/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11066455",
              "author": {
                "username": {
                  "text": "sankalpsahay"
                },
                "userId": "ur42022235"
              },
              "summary": {
                "originalText": "Absolute disappointment"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Another Government Propaganda and yet another disappointment from Bollywood. Dhurandhar does not carry any meaningful message or story. Off late, I had stopped watching Bollywood movies, at least going to theaters for them. Around so much hype, after a gap of about 3 years, I decided to go watch Dhurandhar and I regret this decision.<br/><br/>Firstly, the movie is quite pushy in terms of spreading the message that the previous governments were a failure. As if, there was no homeland security in India before and all our intelligence agencies were inefficient. So, we totally knew there will be an attack on Mumbai but since just the date of attack was changed from 3rd of Oct to 26th of Nov, our agencies and government turned blind eye towards the threat?<br/><br/>Secondly, coming to the direction, there is ample level of over acting in various scenes. There is unnecessary fight, unnatural ways of hitting and killing people, just a desperate attempt to keep the audience engaged. This is the closest Bollywood can get to in terms of action in a movie. The movie keeps stretching at almost all the scenes without any substance and is boring to the core."
                }
              },
              "authorRating": 3,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 10
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11066455/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11054486",
              "author": {
                "username": {
                  "text": "shrikg"
                },
                "userId": "ur103211872"
              },
              "summary": {
                "originalText": "A must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie deserves to run in theaters until it&#39;s next part arrives.<br/><br/>Kudos to the makers for such an honest portrayal of reality. If anyone criticizes the movie for its violence, either they don&#39;t understand the meaning of a movie being rated adult or their brains haven&#39;t matured yet.<br/><br/>Proud of the unsung heroes of our nation. The movie is definitely a tribute to them. For God&#39;s sake don&#39;t be so shameless to call it s propaganda.<br/><br/>Dialogues are ruthlessly honest and true.<br/><br/>If you haven&#39;t watched it yet, you missing one of the greatest cinema.<br/><br/>Must watch! Waiting for the sequel."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-25",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11054486/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11065045",
              "author": {
                "username": {
                  "text": "ravindrasirjadeja"
                },
                "userId": "ur159096802"
              },
              "summary": {
                "originalText": "Blockbuster 🔥💥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands out for its serious tone and layered storytelling. The film relies on performance-driven moments rather than noise, and it works beautifully. Ranveer&#39;s intensity, Akshay&#39;s restraint, and Sanjay Dutt&#39;s commanding presence make it engaging, impactful, and thoroughly watchable. A blockbuster to watch 💥🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11065045/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11030057",
              "author": {
                "username": {
                  "text": "Vineet-97"
                },
                "userId": "ur211718578"
              },
              "summary": {
                "originalText": "I have never seen a movie like this before"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar&quot; is a storm of growth and joy hormones surging through the veins. An explosive, intoxicating feeling. A tidal wave of addictive euphoria. No other film in 2025 has delivered a feeling quite like this. I would easily rank it among the most ferocious films I have ever seen.<br/><br/>&quot;Dhurandhar&quot; is a war story set in peacetime. Riveting. Immersed neck-deep in the essence of valor, gruesomeness, and fury. This is strictly for those who have the stomach for such gore-slasher-action cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11030057/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031774",
              "author": {
                "username": {
                  "text": "kamal-976"
                },
                "userId": "ur211731952"
              },
              "summary": {
                "originalText": "Rn it's my favourite"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie cant bored you , you&#39;ll recall the movie , character,and scenes even after some days..<br/><br/>Movie Review: Dhurandhar<br/><br/>Dhurandhar is a gripping and hard-hitting film that lives up to its powerful title. From the very first scene, the movie pulls you into a world of raw emotions, ambition, and moral conflict. The storytelling is intense yet engaging, balancing realism with cinematic flair. Every frame feels purposeful, keeping the audience hooked till the very end.<br/><br/>The performances are the strongest pillar of Dhurandhar. The lead actor delivers a commanding performance, portraying strength, vulnerability, and inner turmoil with remarkable ease. Supporting characters are not just fillers; each one adds depth to the narrative and enhances the overall impact. Dialogues are sharp, meaningful, and memorable, especially during confrontational scenes.<br/><br/>Direction deserves special praise for maintaining a tight pace and extracting powerful performances without over-dramatization. The background score perfectly complements the mood of the film, elevating crucial moments without overpowering them. Cinematography captures the dark and gritty atmosphere beautifully, making the setting feel alive and authentic.<br/><br/>What truly makes Dhurandhar stand out is its underlying message about power, choices, and consequences. It doesn&#39;t glorify wrongdoing blindly but presents a thought-provoking perspective that stays with you long after the credits roll.<br/><br/>Overall, Dhurandhar is a compelling, well-crafted film that offers strong performances, impactful storytelling, and emotional depth. It is a must-watch for audiences who appreciate intense, meaningful cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031774/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018163",
              "author": {
                "username": {
                  "text": "charankartik"
                },
                "userId": "ur81733442"
              },
              "summary": {
                "originalText": "Most Amazingly Directed Must Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Bitter truth scares but the neighborhood India held is real hell. No mercy on reality, scenes based on Horrific real Incidents and An truly awesome storytelling, Action, Dialogues, Background Music, BGM and most importantly surrounding Characters who touched the peak Aura Farming.<br/><br/>DHU RAN DHARRR 🔥\nHats off to Aditya Dhar, Akshay Khanna &amp; R Madhvan. 👏"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018163/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11053949",
              "author": {
                "username": {
                  "text": "meinalmv"
                },
                "userId": "ur150518593"
              },
              "summary": {
                "originalText": "Must watch Eye opener movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What an intact screenplay. The BGM marks a huge part while every scene takes its turn. The songs are amazing.<br/><br/>Every moment, scene and lines are worth giving attention and your valuable time. Makers, take a bow!<br/><br/>All actors have really done well.<br/><br/>Unknown facts regarding a nation&#39;s structure or struggle don&#39;t go unnoticed.<br/><br/>Most of the violent scenes are enough brutal, however thanks to prostetics team. All efforts are highly appreciated. The sequel is awaited eagerly."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-25",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11053949/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031229",
              "author": {
                "username": {
                  "text": "yshasveepatel"
                },
                "userId": "ur181979183"
              },
              "summary": {
                "originalText": "shows the reality"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping film that stands out for its strong connection to reality. The story feels authentic, with believable characters and situations that reflect real-life struggles rather than exaggerated drama. Honest performances and grounded storytelling make the film impactful and thought-provoking. A solid watch for viewers who appreciate realistic cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031229/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11058997",
              "author": {
                "username": {
                  "text": "HushS-7"
                },
                "userId": "ur200263771"
              },
              "summary": {
                "originalText": "Once in decades movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "You know when Dhurandhar&#39;s trailer came. I watched it and enjoyed it, because it is something different. Then I played it multiple times. I usually don&#39;t watch movies much but mannn this movie I watched it 3 times full and going to watch it again tomorrow. You know these kind movies comes once in a man&#39;s lifetime. When I was born DDLJ came before that Sholay, those movies bring so much impact on not only indian cinema but world cinema. Now this movie Dhurandhar is going to do that. So much negetive PR by leftists and so called critics who are left or pakistan funded, still dhurandhar came on top and came in 1000 cr club. On your face negetive PR chooots. At last incredible acting by all the actors even actor in smaller roles, I know this because I saw every minute details. Amazing story and Incredible direction by Mr. Dhar. Kuch sikho baki chutiyon movie kese banate hai.(People know to whom I am talking about not to 3-4 good directors). Shaandar music, full album is on loop, specially sonu nigam&#39;s and rebels track. Congratulations to the team of dhurandhar and waiting for part 2. May part 2 cross 2000 cr."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11058997/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11032285",
              "author": {
                "username": {
                  "text": "swanangolder"
                },
                "userId": "ur132076324"
              },
              "summary": {
                "originalText": "Good film .. Vibe created . But missing emotion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tried new genera of film making . Vibe created. Action just top notch ! Gore 100%.. but remember this is a film.. so being so perfect still emotionally not connected . Overall good film. But not a film which i can watch again and again and will not discuss post few days\n3 hours 34 min runtime was not required .<br/><br/>Everyone is talking about akshay khanna.. he is finest actor we all know that.. but Ranveer singh Arjun Rampal both are phenomenal in this movie. 100out of 10 for acting. Without acting marks ill rate this movie 5/10."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032285/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025444",
              "author": {
                "username": {
                  "text": "skumar-55560"
                },
                "userId": "ur166648570"
              },
              "summary": {
                "originalText": "Best thrush portral"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just... perfect. Realistic picture of how spies work and how terrorism is actually. No BS drama, no stupid overly done action scenes. And most of all, the gruesome truth. A movie that can be said a documentary. No need for anyone to get offended. Facts are facts... IYKYK what that meant. It&#39;s great how amazing everyone acted as well. And hats off to the nations real life heroes. Not Indian but felt patriotism and anger! As it should !"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025444/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11052880",
              "author": {
                "username": {
                  "text": "Ash-7111"
                },
                "userId": "ur211904201"
              },
              "summary": {
                "originalText": "What a movie bc !!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "All I can say plz watch it!<br/><br/>Acting 10/10\nMusic 10/10\nStory 10/10\nCinematography 10/10\nAction 10/10\nYRF 0/10<br/><br/>I&#39;m just so happy that people are waking up and realising that yrf movie universe have always been a bunch of propaganda mish-mash. This movie will re-define Indian spy/Action films and will do justice to our history, country and culture."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-25",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11052880/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031572",
              "author": {
                "username": {
                  "text": "PriyangshuN-17"
                },
                "userId": "ur211729975"
              },
              "summary": {
                "originalText": "One of the best movie in Bollywood industry"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Everything of this movie fits perfectly the bgm the songs the story,the cast the plot the twists the reality which is shown just everything. Anyone reading this go watch it in theatre without a second thought. 10/10 movie. Very excited for the part 2 after watching the first part. Its definitely Better than animal coz of the way everything is portrayed in this movie 🎥🍿 absolute banger."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031572/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029379",
              "author": {
                "username": {
                  "text": "sarangidipu"
                },
                "userId": "ur134407197"
              },
              "summary": {
                "originalText": "Dhurandhar, A Slow-Burn Spy Thriller That Redefines Intelligence Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar, directed by Adithya Dhar, is a refreshing and gripping addition to Indian spy cinema. Told in a chapter-wise format, much like a premium web series, the film takes its time to build characters, tension, and intrigue-and that patience pays off brilliantly. Ranveer Singh delivers a restrained yet powerful performance as Hamza, an Indian spy who infiltrates Pakistan through Afghanistan and embeds himself deep within the enemy&#39;s ecosystem. From working at a humble juice shop to gaining the trust of Rahman Dakait (a brilliantly understated Akshay Khanna), the film shows intelligence work as it truly is slow, methodical, and psychologically demanding. Akshay Khanna shines as Rahman, a complex antagonist with deep roots in underworld operations, arms supply, and anti-India conspiracies. Arjun Rampal as the ISI chief brings a calm menace, while Sanjay Dutt adds gravitas as a Pakistani DSP caught between duty and chaos. The inclusion of the 26/11 Mumbai attacks gives the film emotional weight and realism. The narrative boldly highlights how intelligence failures and miscommunication can lead to devastating consequences, making the story feel grounded rather than jingoistic.<br/><br/>Despite its long runtime of 3 hours and 22 minutes, Dhurandhar never feels boring. The screenplay remains tight, the twists are earned, and the final act especially Hamza&#39;s calculated endgame involving Rahman shows the cold precision of a trained spy operating without emotional leakage. The film ends on a tantalizing note, clearly setting up a second part slated for 2026, promising deeper revelations about Hamza&#39;s past, his recruitment, and the larger dismantling of enemy networks. Dhurandhar doesn&#39;t rely on loud patriotism or over-the-top action. Instead, it trusts intelligence, patience, and layered storytelling. It feels less like a conventional film and more like the beginning of a serious spy saga. Highly recommended for fans of realistic spy thrillers."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029379/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019241",
              "author": {
                "username": {
                  "text": "omegaxy"
                },
                "userId": "ur193123102"
              },
              "summary": {
                "originalText": "Reality smeared onto fiction"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those films that blurs the line between what is real and what is imagined so delicately that the audience is never fully sure which side they&#39;re standing on. It presents itself as fiction, yet every frame feels soaked in truths we recognize from the world around us. This is where the movie finds its strongest voice-reality isn&#39;t simply adapted into fiction; it is smeared across it, staining the narrative in ways that are subtle, unsettling, and deeply engaging.<br/><br/>The story follows an ordinary man caught in extraordinary circumstances, and though the plot takes creative liberties, the emotions and conflicts feel uncomfortably real. The film uses exaggeration not to mislead but to illuminate. It stretches reality just enough to reveal the cracks that we tend to ignore in everyday life. This technique-half-truths woven into imaginative storytelling-creates a strangely immersive experience. You are aware that you&#39;re watching fiction, yet you feel the weight of its truths.<br/><br/>Performances are grounded and sincere, especially the lead, who carries the tension of the film with a rawness that feels unpolished in the best possible way. The cinematography also plays into the &quot;reality smeared onto fiction&quot; theme: scenes shift between gritty realism and stylized surrealism, mirroring the protagonist&#39;s uncertain moral landscape.<br/><br/>If there&#39;s one drawback, it&#39;s that the film occasionally leans too heavily into its metaphorical ambitions, risking confusion for viewers who prefer clear-cut narratives. But for those who enjoy cinema that challenges rather than comforts, Dhurandhar succeeds brilliantly."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019241/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013770",
              "author": {
                "username": {
                  "text": "varsha-321"
                },
                "userId": "ur211592503"
              },
              "summary": {
                "originalText": "Finally, a gut wrenching truth comes out!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must watch movie for everyone on the planet earth, not just the Indians!<br/><br/>Excellent choice of star cast and they all have made more than just justice to the roles. The movie keeps you hooked throughout without making you blink at all or without losing out on interest.<br/><br/>Cinematography and editing are amazing. It takes courage to bring such movies to the cinemas where mainstream popular media do not touch such subjects at all."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013770/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019767",
              "author": {
                "username": {
                  "text": "RajivM-967"
                },
                "userId": "ur211639170"
              },
              "summary": {
                "originalText": "Worth it🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best movie of 2025 it was awesome and I will be in the proctur app for Android version hai na ki hai jab 2 log in to resume watching u had something to do it today and I will be in the proctur app for Android version hai na ki hai jab 2 log in to resume watching u had something to do it today and I will be in the proctur."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019767/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018484",
              "author": {
                "username": {
                  "text": "PrahladK-843"
                },
                "userId": "ur211392451"
              },
              "summary": {
                "originalText": "A griping tale of a wounded lion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is exactly what it promises to be: the story of a wounded lion, a man driven by nothing but pure, undiluted rage after witnessing atrocities committed against his own pack, his people. This is not a stylized revenge fantasy, it is a personal war.<br/><br/>From the very first trailer it was clear this would not be your typical rom com disguised as an espionage movie. And the film fully delivers on that warning. It does not shy away from brutality, gore, or the emotional weight behind it. Every gruesome moment feels earned, rooted in real human emotions like anger, grief, and betrayal.<br/><br/>The performances are absolutely gripping.<br/><br/>Every actor brings layers to their character, and nobody is presented as a flat stereotype. Akshaye Khanna especially, there is a scene where his character gets slapped by his wife, and he just stands there, absorbing it. No macho reaction, no exaggerated response. Just raw honesty.<br/><br/>And let us be clear, the brutality in Dhurandar is not hyper masculine chest thumping. The violence is narrative driven, emotional, and reflective. It shows the malice of the antagonists and the psychological descent of the protagonist with precision.<br/><br/>People calling the film polarizing are missing the point entirely. The movie does not target any community or group, it aims directly at those responsible for the cruelty shown. Nothing more. Nothing less.<br/><br/>Viewers just need to widen their lens and see the film for what it truly is,\na fierce, unfiltered character study wrapped in a gripping narrative of vengeance and sheer nationalism."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018484/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013531",
              "author": {
                "username": {
                  "text": "KrrishR-0"
                },
                "userId": "ur211590922"
              },
              "summary": {
                "originalText": "One the best movie in 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I have watched this movie in theater and the experience was amazing. The actors were terrific and very detailed reality showed in the movie. Everyone should watch it. If you are a fan of RAW and very patriotic to the country then this movie is for you. The reality of terrorism shown in this movie is fantastic."
                }
              },
              "authorRating": 2,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 6,
                "downVotes": 29
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013531/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}