{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6fdzsqyxdo6ig76vh7mzurdq4wbz234mtz7pjdpj3qflanes2qc25oeze7w3qlfdtqn266vmflntxjdpxapfy",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11006082",
              "author": {
                "username": {
                  "text": "Prabhanjay"
                },
                "userId": "ur211541305"
              },
              "summary": {
                "originalText": "Grounded Spy thriller. A must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Right from the start story grips you the scenes are intense you&#39;ll feel like you&#39;re living the situation. Action is more grounded not like typical masala movies,cast is fabulous, cinematography is beautiful it feels like pakistan. Overall the best indian movie to come in quite a few years. And lastly BGM hits hard at right time. Great work done."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006082/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007794",
              "author": {
                "username": {
                  "text": "mayankprakash1979"
                },
                "userId": "ur34859917"
              },
              "summary": {
                "originalText": "Part 1: Fiction, But Grounded - And Very Watchable"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Is the 3 hour 40 minute runtime justified for just Part 1 of a spy thriller? The real answer will only come with Part 2 - but one thing is clear: the film remains consistently engaging. I&#39;ve enjoyed many 3-hour-plus films in the past, so the length wasn&#39;t an issue for me. The pacing is taut, and the violence is relentless but not without dramatic purpose. Most of the lead actors fully commit, and that effort shows.<br/><br/>The film is divided into chapters, but this choice adds little value. The narrative flows linearly, characters overlap across sections, and the chapter breaks feel more cosmetic than structural.<br/><br/>Is it propaganda? Yes and no - and it depends on one&#39;s lens. The film is a highly fictionalized account that draws from multiple covert operations and real geopolitical situations: the Baloch struggle, Lyari&#39;s underworld, and ISI-backed militancy. Madhavan&#39;s character, clearly modeled on Ajit Doval, does push the familiar narrative of a weak UPA vs a strong NDA - just as Uri and Article 370 did - but it never derails the storytelling. This is a well-crafted film first, with strong direction and technical finesse.<br/><br/>Performances are uniformly solid. Ranveer Singh is excellent when he plays it grounded - and though he stays mostly in the background here, his presence is central. Akshaye Khanna shines (as he always does), reminding us of his incredible range and how underutilized he has been over the past two decades. The biggest surprise is Rakesh Bedi, who balances humour and cunning beautifully and holds his own among heavyweights.<br/><br/>The only disappointment in the cast is Sanjay Dutt. He seems disinterested, and his scenes feel flat - though capable direction and stronger co-actors keep them afloat.<br/><br/>The music choices elevate several sequences, though the wedding &quot;item&quot; number could have been replaced with a slick retro track. The action is intense and impactful, but almost every gunfight is marred by excessive shaky-cam, which dilutes clarity and tension. And the final hand-to-hand combat sequence goes on far too long - clunky, old-school choreography that doesn&#39;t match the sophistication seen earlier. Interestingly, a much shorter revenge set-piece earlier in the film packs a far bigger punch.<br/><br/>The ending provides closure while leaving us truly curious about Ranveer&#39;s past and his next move.<br/><br/>Part 2 arrives in March - and I&#39;m all in for it."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 9,
                "downVotes": 6
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007794/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010469",
              "author": {
                "username": {
                  "text": "anirudhbharadwajmi"
                },
                "userId": "ur97969940"
              },
              "summary": {
                "originalText": "Entertainment Entertainment Entertainment"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must watch. Not a single second of boredom with this much long running time not a single second. Acting 10/10, Direction 10/10, Cinematography 10/10, Action 10/10, Story 10/10. Everything was perfect. Really liked the movie. Red screen was cherry on top to show the original recordings and talk between the perpetrators. Really a wonderful film and a must watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 8,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010469/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012513",
              "author": {
                "username": {
                  "text": "gandhisubodh"
                },
                "userId": "ur76112397"
              },
              "summary": {
                "originalText": "Top Notch thriller.. Go for it"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is absolute banger. Best espionage thriller ever from Bollywood. Out of syllabus for Aditya Chopra&#39;s YRF spy universe. It defines how a spy movie should be presented. Each and every frame is so beautifully and perfectly crafted that you&#39;re glued to seats during the whole 3hr 30 mins. Each actor played their best. They felt more like characters than themselves. Screenplay is tight. Direction is top class and stylish. Music sets the perfect mood. Action sequences felt real. 10/10 for everything. Don&#39;t miss this one. This will be a benchmark movie in bollywood for spy genre and deserves to be watched in theatres. 1000 times better than YRF or Dharma productions crappy movies."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 7,
                "downVotes": 4
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012513/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11040362",
              "author": {
                "username": {
                  "text": "sandeeps-9320"
                },
                "userId": "ur211803975"
              },
              "summary": {
                "originalText": "Loud high octane macho patriotism"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie feels dragged and lengthy(3h:30min). Above average worth a watch. Made to cater people of age 20-50 Yrs. Young adults would like to watch twice for loud bachground score and eye squinting violence. Not for kids and senior adults because kids must not be exposed to such violence and senior adults will get headache from the loudness.<br/><br/>Story -7\nActing -7(Akshaye Khanna 10)\nDirection - 8\nMusic-7."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11040362/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018878",
              "author": {
                "username": {
                  "text": "Vpatel_03"
                },
                "userId": "ur117675941"
              },
              "summary": {
                "originalText": "All Style, No Substance"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar starts with promise but quickly falls apart due to uneven pacing, random song placements, and a story that never finds real direction. Instead of building a grounded narrative, the film relies on exaggerated patriotism and fabricated drama, which makes the experience feel forced rather than engaging.<br/><br/>Despite a decent track like Gehra Hua, the overall film feels long, disconnected, and emotionally empty.<br/><br/>Not recommended-it plays more like a sentiment-driven commercial product than a well-crafted thriller."
                }
              },
              "authorRating": 2,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 11,
                "downVotes": 44
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018878/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033679",
              "author": {
                "username": {
                  "text": "priyanshuchakraborty-26814"
                },
                "userId": "ur175066117"
              },
              "summary": {
                "originalText": "Arjun Rampal stole the show"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I know some will lash at me for this but it&#39;s just an opinion. This film is unlike any other spy film we ever saw. No caricature, no forced plot device or event. Well developed characters with distinct flairs but the only which felt the most natural was Arjun Rampal&#39;s ISI character. His character felt the most natural."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033679/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11030934",
              "author": {
                "username": {
                  "text": "loyalka-s"
                },
                "userId": "ur29764452"
              },
              "summary": {
                "originalText": "Superb watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "There are some very violent scenes. But the story, direction and actors are fantastic. A must watch. Akshay khanna was fabulous, Ranveer singh is too good. All characters in the movie are too good. The plot of the movie is thrilling and even if the movie is long you dont feel that. Even when it ends you are stuck to your seat. Waiting for the second part."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11030934/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031587",
              "author": {
                "username": {
                  "text": "nikhileshbhandari"
                },
                "userId": "ur183896190"
              },
              "summary": {
                "originalText": "Ranbir Singh at His Electrifying Best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every once in a while, a film comes along that reminds you why you fell in love with cinema in the first place. Durandur, starring Ranbir Singh, is exactly that kind of movie - a heady mix of energy, emotion, and entertainment that keeps you hooked from start to finish.<br/><br/>From the first frame, Ranbir commands the screen with his trademark intensity and effortless charm. His portrayal of Durandur - a rebellious soul chasing both dreams and redemption - feels raw, authentic, and deeply human. There&#39;s a vulnerability behind his swagger that makes the character unforgettable.<br/><br/>The film&#39;s direction deserves special mention. The pacing is sharp, the visuals are stunning, and the action choreography feels fresh without going over the top. Each frame bursts with color, rhythm, and the kind of cinematic thrill that only a director confident in their craft can deliver.<br/><br/>But what truly sets Durandur apart is its heart. Beneath the stylized sequences and adrenaline-pumping moments lies a story about resilience, love, and the price of ambition. The music amplifies every emotion, and the supporting cast - especially the lead actress and the antagonist - elevate the story with layered performances."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031587/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025698",
              "author": {
                "username": {
                  "text": "arshsinghknp"
                },
                "userId": "ur166976535"
              },
              "summary": {
                "originalText": "Best spy film of bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film may feel slow in the first half to some people and all the love angle may feel uneccesary but the film covered all of its flaws in the second half and also the music album of this film is🔥.<br/><br/>The film is not glamorizing ranveer singh as he is the main lead but instead each character feels like the protagnist of their own story akshaye khanna , arjun rampal and ranveer singh nailed it.<br/><br/>Acoording to me the main showstealer was rakesh bedi as he overshadowed every actor with his presence and the film was successfully showcased his versatile acting.<br/><br/>Aditya Dhar hats off to you man ! What a brilliant work behind the camera not a single minute felt boring at all the screenplay is so well written that 3 hour 30 minutes feel like blink of an eye.<br/><br/>The style of this film highly resembled Quentin Tarantino&#39;s Kill Bill."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025698/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11065569",
              "author": {
                "username": {
                  "text": "chiragrathod09"
                },
                "userId": "ur155643091"
              },
              "summary": {
                "originalText": "Bollywood's Finest Spy Thriller in Years"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar, the man behind the tectonic shift in Indian war cinema with Uri: The Surgical Strike, returns with Dhurandhar-a film that swaps the &quot;How&#39;s the Josh?&quot; adrenaline for a cold, calculated, and often unsettling look at deep-cover intelligence. Clocking in at a massive 3 hours and 34 minutes, it is an epic that demands patience but rewards it with some of the best technical craft and acting seen in recent years.<br/><br/>Film is monumental achievement in Hindi cinema - a nearly 4-hour epic that feels gripping from start to finish without a single dull moment. Ranveer Singh embodies Hamza, the undercover Indian agent infiltrating Karachi&#39;s deadly underworld to dismantle the ISI-terror nexus, with remarkable restraint and depth. But the real standout is Akshaye Khanna as the charismatic yet ruthless gangster Rehman Dakait - his swag, menacing presence, and razor-sharp dialogue delivery make him the undisputed MVP.<br/><br/>Dhar masterfully weaves real historical events (IC-814 hijacking, Parliament attack, 26/11) into a fictional Godfather-style mafia saga set in Lyari&#39;s gang wars. The world-building is immersive, the cinematography stunning, and the intelligent scripting trusts the audience with complex moral ambiguities and high-stakes espionage.<br/><br/>Dhurandhar is a rare beast: a high-budget blockbuster with the soul of an indie thriller. It is a masterpiece of tension and a testament to Ranveer Singh&#39;s versatility. It doesn&#39;t just ask for your attention; it commands it.<br/><br/>Bottom Line: If you have the stomach for its length and its grit, Dhurandhar is the most important Indian film of the year.<br/><br/>Rating: 10/10 - A game-changer for Bollywood, it&#39;s a theatrical must-watch. Can&#39;t wait for Part 2!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11065569/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011247",
              "author": {
                "username": {
                  "text": "ASHBORN-4"
                },
                "userId": "ur211573478"
              },
              "summary": {
                "originalText": "Awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I LIKE THIS MOCIE A LOT AND I THINK OTHERS TOO BUT I THINK A BIT MORE ACTION AND SOME MORE AWESOME DIALOGUES WOULD ME BETTER AND OVERALL THIS MOVIE WAS FIRE I RECOMMEND WATCHING THIS ANYONE WHO IS THINKING WHETHER TO WATCH THIS OR NOT WATCH THIS IS A GOOD ONE YOU MIGHT NOT LIKE THIS BUT TRY THIS AT LEASR ONCE."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011247/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013763",
              "author": {
                "username": {
                  "text": "ManavM-20"
                },
                "userId": "ur211592591"
              },
              "summary": {
                "originalText": "Amezing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One and only best spy movie in Bollywood\nBecause it does not have the story of Tiger and Zoya real and jenuine spy movie ever.<br/><br/>One and only best spy movie in Bollywood\nBecause it does not have the story of Tiger and Zoya real and jenuine spy movie ever.<br/><br/>Best music best camera angal best starcast and ofcourse akshay khanna."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013763/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014135",
              "author": {
                "username": {
                  "text": "Tan-298"
                },
                "userId": "ur211594558"
              },
              "summary": {
                "originalText": "A must watch, What a brilliance !!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie overall is an absolute brilliance, and the story overall is very well developed for the upcoming climax or plot. The film starts from an intriguing point which perfectly lines up on what will happen next in the story. The character portrayed by R. Madhvan in the Film (Ajay Doval irl ) is superb even though it doesn&#39;t have enough screen time. The main story which starts after the unfortunate events that happen. The story is developed very well, and I accept the story does develop slowly in the first half. However, they made sure that there are no holes in the movie which led to a smooth storyline to take place. We then see Akshaye Khanna&#39;s character, and everyone falls in love with his acting and especially the dance. Akshaye Khanna was very closely representing Raheem Baloch also when it came with the dialogue delivery. It felt I was the one facing him. Going to the next character which was portrayed by Arjun Rampal which received very less of screen time as he will be in the part 2 as a main villain (Theory). The character of Major Iqbal had no difference between the Reel and Real version. Next, we have SP Chaudhary Aslam acted by Sanjay Dutt was a gem and the casting for this role couldn&#39;t be offered to anyone else as Sanjay Dutt slayed in his role. Whenever he is on the screen the audience will feel a sense of laughter and this character added the life into the movie to lighten the mood from serious to a bit less serious. However, Aditya Dhar is a mastermind as he used red background followed by black text for that one particular scene released a feel of anger in my body for what the Pakistanis have done. Finally, Ranveer Singh&#39;s performance was very lively and engaging and it felt too real with all those emotions. The acting of Ranveer Singh was eventually foreshadowed by the eye-catching performance of Akshaye Khanna. The only thing that concerned me in the movie was some scenes which could have been a bit disturbing for some people to watch even if the movie is A rated. However, this movie was really different from all the other spy films as there are almost no romantic scenes focusing on its main plot and climax. I personally enjoyed the movie."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014135/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11032060",
              "author": {
                "username": {
                  "text": "wpqnwdn"
                },
                "userId": "ur186209928"
              },
              "summary": {
                "originalText": "Good movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch 7 rating for me. Loved it.<br/><br/>Ranvir singh pulled it off. Akshay stole the movie. All the characters have done their best. Its align with the terror incidents happened in the country. Which everyone is aware and made several movies of it. This one was clubbing all together in single movie. Akshay Khanna entry was just amazing. Sanjay Dutt I found okies, just regular acting."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032060/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005488",
              "author": {
                "username": {
                  "text": "shardulkul"
                },
                "userId": "ur59581831"
              },
              "summary": {
                "originalText": "Mid"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Overindulgent. Music so loud couldn&#39;t even hear the dialogues. Unnecessary gore. Cringe attempts at comedy. Only a few redeeming moments. Dragged quite a bit at action scene.<br/><br/>Ranvir Singh did not shine through. Mostly kept a stoic face and screamed for a bit. Rampal surprised me, although nothing exceptional. Sanjay Dutt played Sanjay Dutt as usual. Madhvan remained angry throughout. The girl playing Yalia is super hot, but the character is unbelievably dumb.<br/><br/>Kept bashing congress and blowing BJP as usual."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 6,
                "downVotes": 19
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005488/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018528",
              "author": {
                "username": {
                  "text": "Truly369"
                },
                "userId": "ur211592685"
              },
              "summary": {
                "originalText": "I am in DHURANDHAR FEVER...."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Greatest film of all time , surely best film in couple of decade. Story , action , dialogue all fantastic. I enjoyed it with my friends . I am sure you will also enjoy.<br/><br/>Exceptional Performances The entire ensemble cast has been widely lauded, particularly the dynamic between Ranveer Singh and Akshaye Khanna.<br/><br/>Dhurandhar is a must-watch theatrical experience for those who appreciate a bold, intense, and emotionally rich spy thriller."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018528/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11041185",
              "author": {
                "username": {
                  "text": "dhruvkalkeri"
                },
                "userId": "ur175149382"
              },
              "summary": {
                "originalText": "Bollywood needs more films like this"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Bollywood needs more films like this where film makers aren&#39;t playing it safe with to get the flim PG rated, where they aren&#39;t playing it safe to get through censor board. Where not only the main protagonist but also the side characters get plenty screentime. We need films driven by story, not stardom.<br/><br/>Also I one of the first thing I noticed about the film is that the music is great compared to the current bollywood standards."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11041185/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11032073",
              "author": {
                "username": {
                  "text": "SaumyaM-13"
                },
                "userId": "ur211735353"
              },
              "summary": {
                "originalText": "Unapologetic script"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar wins you over with nerve.<br/><br/>The storytelling is sharp, deliberate, and layered.<br/><br/>Performances and background music is the star of the movie but the script is a solute cinema. Ranveer Singh delivers a controlled, intense performance that feels lived-in rather than performed. Akshay Khanna, Arjun Rampal, R Madhvan...all of them show what makes them an actor. Supporting cast leave an impression, even with limited screen<br/><br/>The dialogues are crisp, impactful, and grounded. No unnecessary hero worship, no loud moral sermons.<br/><br/>This is not a mindless entertainer. It demands attention and rewards it generously."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032073/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016387",
              "author": {
                "username": {
                  "text": "avantiever"
                },
                "userId": "ur178262194"
              },
              "summary": {
                "originalText": "Highly stimulating Spy thriller: blown away Experience!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar( means hard working, loyal etc)\nLet me just say.... I was blown away!!! Watching this movie.<br/><br/>Show started at 7pm and finished at 10.30pm..Almost 3.5 hours and every minute was captivating!!! The story the characters.. the emotion the intensity and the graphic violence!!!<br/><br/>When i watch a film i watch the finer details. I try to find the flaws ... however Dhurandar passed all the major aspects and exceeded my expectation and i hate yet excited to say i hardly found any flaws.<br/><br/>The direction, the locations, the impactful scenes, the songs, background score.. was almost perfect throwing in the 90&#39;s pop hindi songs, the Baloch song made me gasp and smile and stare at the screen wide eyed!<br/><br/>All the actors perfomed brilliantly blending into the theme and each of them playing an important role.... Watch out for R. Madhavan and Arjun Rampal!!!<br/><br/>Ranvir Singh as Hamza is raw and intense.. his best work since Gully Boy and Padmavat... And Akshaye Khanna as the villain ... wow!! I am not surprised though... He is such a refined actor..\nThe raw vs the refined !!!! Based on true events and characters made it even more engaging and incredible to watch!!!!!<br/><br/>No over the top scenes or useless song and dance.. this is such a well balanced and performance based film stimulating the mind.....\nA Spy thriller that is simply quality cinema and has undeniably raised the bar !!!!!<br/><br/>Cant wait for the sequel releasing in March 2026!!<br/><br/>Wow i actually wrote an essay here!!!!<br/><br/>Now i can finally breathe."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016387/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011052",
              "author": {
                "username": {
                  "text": "navroopboparai"
                },
                "userId": "ur189592243"
              },
              "summary": {
                "originalText": "Bestt"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It is one of great directions and super creative. What a story build up!!!!!!! All of the starcast did justice to their roles.... It is totally badass. I loved it so much. The best movie after such a long timea. Ready to watch again......\nAlso, the songs are amazing. Definitely waiting for its part 2 to release in 2026 march."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011052/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031626",
              "author": {
                "username": {
                  "text": "soikatsoikat-99724"
                },
                "userId": "ur152484977"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just nailed the show all of the characters, director, writer, music everything just like Animal 2023. Everyone should go and watch the film atleast once at a time...\nThe magic behind this movie is Real + Reel in a word... What if the fictional character gets into the real life?<br/><br/>This mind blowing game had been played by Aditya Dhar. And also the music. Uffff...i can&#39;t sleep, its like playing the music like Gehra hua, Lutt le geya, naal nachna, Title track, Sararat all of yhrm."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031626/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031126",
              "author": {
                "username": {
                  "text": "KetanM-12"
                },
                "userId": "ur204090348"
              },
              "summary": {
                "originalText": "\"Power in Restraint: Dhurandhar Is Intelligent Cinema at Its Best\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "With Dhurandhar, director Aditya Dhar delivers a riveting, intelligent political thriller that stands among the finest examples of contemporary mainstream Hindi cinema. Controlled, confident, and uncompromising in its seriousness, the film proves that scale and substance need not be mutually exclusive.<br/><br/>Dhar&#39;s direction is exemplary. He demonstrates absolute command over tone, pacing, and narrative intent, refusing to dilute complexity for easy gratification. The film thrives on measured tension, moral ambiguity, and disciplined storytelling, allowing characters - not spectacle - to drive the drama. Every frame feels purposeful, and the director&#39;s restraint becomes the film&#39;s greatest strength.<br/><br/>The background score and music are near-flawless in their execution. Used with precision, the music enhances atmosphere without overpowering the narrative. Silence is treated as a storytelling tool, and the score steps in only when necessary, elevating key moments with quiet authority.<br/><br/>Performance-wise, Dhurandhar belongs unequivocally to Akshaye Khanna. In a career defined by understated excellence, this ranks among his finest work. Khanna delivers a performance of rare control - internal, intelligent, and deeply absorbing. With minimal dialogue and maximum impact, he commands the screen through sheer presence, making power feel lived-in rather than performed. His portrayal adds gravitas and credibility, anchoring the film&#39;s emotional and intellectual core.<br/><br/>Ranveer Singh matches the film&#39;s intensity with a committed, finely tuned performance, but it is Khanna&#39;s restraint that leaves the deepest impression. The supporting cast complements the narrative without a weak link in sight.<br/><br/>Dhurandhar is cinema that respects its audience - its intelligence, patience, and appetite for complexity. It may not court instant gratification, but it rewards engagement richly.<br/><br/>Verdict: A masterfully directed, superbly acted film that sets a new benchmark for serious Hindi cinema. Anchored by Akshaye Khanna&#39;s outstanding performance, Dhurandhar is essential viewing."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031126/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11034591",
              "author": {
                "username": {
                  "text": "vakkpandit"
                },
                "userId": "ur81687765"
              },
              "summary": {
                "originalText": "Awesome Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie was good. Everyone is talking about Ahsyan Khanna. But the best acting was by RAkesh Bedi. Cutting 2 points because the last chapter was boring. Kya chal ra tha kuch samjahn nahin aaya. This could have been done better. Over all the movie was good.<br/><br/>First 2 hrs were gripping. Some scenes are very voilent."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11034591/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11056613",
              "author": {
                "username": {
                  "text": "VarunAgw"
                },
                "userId": "ur33471328"
              },
              "summary": {
                "originalText": "Good movie with dull ending"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is good.<br/><br/>The ending was very dull. There is no closure. They are kind of forcing you to watch the next part.<br/><br/>The ending was very dull. There is no closure. They are kind of forcing you to watch the next part.<br/><br/>The ending was very dull. There is no closure. They are kind of forcing you to watch the next part."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11056613/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}