{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xojdzltazcwzy472thvobrqpqmoajs3mktt4pmb3o6qebgnesk2dk4oe2vljchfgruoxfmpo2vhpvcopkrvuugda",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11007214",
              "author": {
                "username": {
                  "text": "monybatra"
                },
                "userId": "ur118093999"
              },
              "summary": {
                "originalText": "Star-Studded Cast Brings Action Alive"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening shot, the film immerses audiences into a meticulously constructed underworld where danger lurks in every shadow. Ranveer Singh delivers a career-defining performance, embodying both moral conflict and raw determination, his expressions and body language conveying the internal struggles of a man navigating treachery and loyalty. Sanjay Dutt dominates every scene with commanding authority, his presence alone heightening tension and credibility. Akshaye Khanna and R Madhavan add layers of intelligence and subtlety, delivering dialogue and emotional beats that give the narrative depth. Arjun Rampal&#39;s quiet menace keeps viewers constantly on edge, while Sara Arjun&#39;s innocent, heartfelt moments add emotional stakes, grounding the story in humanity. Director Aditya Dhar&#39;s vision is impeccable, orchestrating suspense, strategy, and large-scale action sequences with precision. Cinematography captures Karachi&#39;s urban chaos and intimate, character-driven moments with equal flair, while the score punctuates every beat of tension, making even quiet scenes feel charged. The second half escalates into a breathtaking mix of revelations, confrontations, and emotional catharsis, culminating in a finale that is both thrilling and deeply satisfying."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007214/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011960",
              "author": {
                "username": {
                  "text": "amitkrprasad-46648"
                },
                "userId": "ur145201771"
              },
              "summary": {
                "originalText": "Best thriller movie ever saw based on real terrorist incidents."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is based on real incident of terror attack in different parts of India. In this movie an indian Spy agent worked as undercover in Pakistan&#39;s Karachi area(Lyari). He tried many attacks to foil by friendshiping with many terrorist group in Pakistan. Some parts gives goosebumps whereas most part gives pain and tears.<br/><br/>Waiting for the Part 2 to be released in March 2026."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011960/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029274",
              "author": {
                "username": {
                  "text": "mandeepkrpatel"
                },
                "userId": "ur113526392"
              },
              "summary": {
                "originalText": "It was a master piece."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerful and engaging cinematic experience that stands out for its intensity, emotional depth, and strong storytelling. From the very beginning, the film grips the audience with its compelling narrative and maintains a steady momentum throughout. It successfully blends action, drama, and social commentary, making it both entertaining and thought-provoking.<br/><br/>One of the strongest aspects of<br/><br/>Dhurandhar is its performances. The lead actor delivers a commanding and emotionally charged performance, portraying strength, vulnerability, and determination with remarkable conviction. The supporting cast complements the protagonist well, adding layers of realism and depth to the story. Each character feels purposeful, contributing meaningfully to the film&#39;s progression."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029274/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025904",
              "author": {
                "username": {
                  "text": "mohitc-898"
                },
                "userId": "ur211682577"
              },
              "summary": {
                "originalText": "Watch it in theater"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s raw movie and looks like everything is happing in front of our eyes.<br/><br/>The movie makes a connection as we have lived those moments like parliament and Mumbai attack.<br/><br/>Fantastic acting by everyone, specially by Akshay and Ranveer.<br/><br/>BGM is killer. All songs are matched to the scene and context.<br/><br/>Go and watch it in theater."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025904/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11071857",
              "author": {
                "username": {
                  "text": "nntsjr"
                },
                "userId": "ur175716864"
              },
              "summary": {
                "originalText": "very interesting and raw"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is the first time i have watched such a long film without any boredom. The film was very raw, intersting and based on facts .It have a very unique concept. Don&#39;t listen to hypocrite film critic who provide baseless critics just to satisfy their ego. The film is really good. Excitingly waiting for part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11071857/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044079",
              "author": {
                "username": {
                  "text": "rishabhdelta"
                },
                "userId": "ur61386131"
              },
              "summary": {
                "originalText": "Intense Spy Action as it should be !!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After a long time got a chance to say that bollywood knows what spy movies actually are. Instead of romancing with ISI agents , teaming up with pk army , this film shows near actual scenarios of what a spy goes through , his life spectrum and ups and downs in his journey far away from home.<br/><br/>1 star butthurt kiddos go get a life and tell your dads this is how a badass spy action should be made."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044079/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012692",
              "author": {
                "username": {
                  "text": "pcbtechnicalsonic"
                },
                "userId": "ur150799113"
              },
              "summary": {
                "originalText": "Best realistic movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "⭐ Movie Review: DHURANDHAR - 10/10 ⭐\n&quot;Pure mass, pure energy, pure entertainment. Dhurandhar delivers on every level.&quot;<br/><br/>Dhurandhar is the kind of film that grabs your attention from the first scene and keeps you hooked till the very end. The lead actor absolutely dominates the screen with strong dialogue delivery, powerful expressions and whistle-worthy action moments. The story is simple but executed in a tight, engaging way with zero dull moments.<br/><br/>🎬 Acting:\nEvery actor plays their part perfectly. The protagonist shines the most - intense when needed, funny when needed, and always confident on screen.<br/><br/>🔥 Action &amp; BGM:\nThe action scenes are high-energy and full paisa-vasool. The background music boosts every moment and gives the film a larger-than-life feel.<br/><br/>📸 Direction &amp; Cinematography:\nThe visuals are stylish and clean. The direction keeps the pacing sharp, emotions balanced, and excitement high throughout the movie.<br/><br/>👍 Verdict:\nDhurandhar is a complete blockbuster entertainer - a perfect mix of action, drama and mass moments.<br/><br/>If you love high-energy cinema, this one is a must-watch.<br/><br/>⭐ Rating: 10/10 - Highly Recommended! ⭐"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012692/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026112",
              "author": {
                "username": {
                  "text": "apoosharma"
                },
                "userId": "ur195486143"
              },
              "summary": {
                "originalText": "Fire 🔥🔥🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Genuinely I say personally I don&#39;t like Ranveer Singh but in this movie Ranveer Acting top notch he killed with his acting and Akshay Khanna is a banger. All characters acting is very good.<br/><br/>Aditya Dhar is real DhuranDHAR who make this type real ground leval movie not like YRF. Personally I love this movie not only for acting... I like movie Set character story telling any many more reason. 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026112/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003889",
              "author": {
                "username": {
                  "text": "rohitprabhu-83707"
                },
                "userId": "ur81071516"
              },
              "summary": {
                "originalText": "Dhurandhar: An Adrenaline-Pumping, Flawless Masterpiece!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Verdict: A landmark patriotic thriller that Indian cinema desperately needed! Director Aditya Dhar delivers a staggering film that is, simply put, mind-blowing from start to finish.<br/><br/>Dhurandhar is not just a movie; it is a meticulously crafted, emotionally resonant, and relentlessly paced cinematic event. The sheer brilliance of the direction by Aditya Dhar is the film&#39;s backbone. Following his previous work, Dhar once again proves he is a master of the genre, tackling a sensitive patriotic subject with maturity, grit, and a spectacular vision. The scale and execution of this project are truly top-notch.<br/><br/>One of the film&#39;s most remarkable achievements is its narrative grip. At a colossal runtime of 3 and a half hours, it doesn&#39;t feel stretched for a single second. The screenplay is so taut and the pacing so dynamic that you remain glued to your seat, completely immersed in the covert operations and intense geopolitical drama.<br/><br/>The technical and performance aspects are equally flawless:\nBGM (Background Music): The score is an absolute character in itself-hard-hitting, visceral, and perfectly timed to amplify the tension and the emotional stakes. It gives you goosebumps during every action beat.<br/><br/>Acting: The ensemble cast is flawless. Every actor, regardless of screen time, delivers a knockout performance, bringing conviction and raw intensity to their respective roles.<br/><br/>Patriotic Tone: This is the kind of patriotic film that is the much-needed hour for Indian cinema. It is grounded, real, and carries its nationalistic message with dignity and impact, avoiding melodrama.<br/><br/>A special, towering mention must go to Aditya Dhar for taking on such an ambitious and amazing project and executing it in a breathtaking way. His vision, dedication, and ability to command such a massive canvas are truly commendable. Dhurandhar sets a new benchmark for the Indian spy thriller genre. A must-watch big-screen experience!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003889/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11100257",
              "author": {
                "username": {
                  "text": "Shekha-89"
                },
                "userId": "ur212223583"
              },
              "summary": {
                "originalText": "Must watch!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Brilliant acting by all cast members! Music is gas! &#39;Romantic&#39; angle was beautifully done - not forced into the story but vert much part of it! Ranveer Singh as Hamza is thrilling! Akshaye Khanna and Danish Pandor are excellent brothers as Rehman and Uzair. Sara as Yalina is a refreshing - the way she stood, hand out, asking for money from her father was so on point! Hamza double take when entering the club was flawless...Danish screaming &#39;bhaga, bhaga, bhaga...nostrils flared up...absolutely brilliant...Sanjay Dutt...legend!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11100257/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006704",
              "author": {
                "username": {
                  "text": "amitabhp-32296"
                },
                "userId": "ur189344369"
              },
              "summary": {
                "originalText": "A Powerhouse Blend of Drama and High Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Intelligence and ambition define this film, which balances high-stakes action with emotional resonance. Ranveer Singh&#39;s portrayal is magnetic, conveying both charm and moral ambiguity, ensuring audiences are invested in his character&#39;s choices. Director Dhar orchestrates a rich narrative, blending suspenseful plotting with moments of quiet reflection that deepen the story. Action sequences are crafted with precision, often escalating tension through inventive choreography rather than sheer spectacle. Each supporting actor delivers memorable performances, with layered motivations that make the underworld feel vivid and dangerous. The cinematography captures a spectrum of moods, from claustrophobic intensity to wide, cinematic tension, while the sound design intensifies every heartbeat of the narrative. The screenplay&#39;s intricate pacing ensures that even the quieter moments are charged with significance. By the climax, the film achieves a rare synthesis of adrenaline, emotion, and narrative satisfaction."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006704/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11098003",
              "author": {
                "username": {
                  "text": "rnraoin-43966"
                },
                "userId": "ur105735649"
              },
              "summary": {
                "originalText": "Record Breaking"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Personally, Dhurandhar broke more records for me than it did at the box office.<br/><br/>I&#39;ve never liked a movie enough to watch it twice in the theater within two weeks - until Dhurandhar. I had never done that before. Usually, with OTT releases just a month or two away, there&#39;s little reason to revisit a film on the big screen. But this one was different. Its characters quietly move into your mind and refuse to leave. Even after leaving the theater, you keep discovering more about them through reels, interviews, and behind-the-scenes stories - which only deepen the connection.<br/><br/>I&#39;ve always dismissed remixes as unoriginal, a lazy excuse to repackage old hits. But Dhurandhar&#39;s music turned that belief on its head. Its tracks sound as fresh and stirring as the originals - sometimes even more so. I&#39;ve been looping the album nonstop, and every listen makes me want to experience the film again on the big screen. The absence of official music videos only adds to the intrigue, making the imagination do the heavy lifting.<br/><br/>What Dhurandhar has really done is redefine my movie-watching experience. I&#39;ve always appreciated nationalistic and patriotic films, but most fail to deliver artistically. Audiences don&#39;t pay for sentiment alone - they pay for quality. Dhurandhar succeeds because it&#39;s an exceptional piece of filmmaking first, and a patriotic story second. Its commercial success proves that excellence resonates across ideologies, unlike Ikkis or other &quot;peace narrative&quot; films that have struggled to find an audience.<br/><br/>Perhaps the most surprising record it broke was personal - I never imagined watching a Ranveer Singh film in theaters, let alone twice. Though undoubtedly talented, I often found his performances excessive. The last Hindi film I watched in a theater was Chup. Since then, nothing - no actor, no story - felt worth the ticket. Films like Su From So or Kantara seemed more deserving of that big-screen experience... until Dhurandhar came along.<br/><br/>Many have compared it to Satya - RGV&#39;s finest work - calling Dhurandhar &quot;the Satya of Lyari.&quot; I couldn&#39;t agree more. Every few years, a film comes along that resets the standard and redefines cinema&#39;s possibilities. Dhurandhar is one of those rare milestones."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11098003/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008116",
              "author": {
                "username": {
                  "text": "GambhireP"
                },
                "userId": "ur211554589"
              },
              "summary": {
                "originalText": "There is still hope from Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watched Dhurandhar yesterday, and it genuinely left an impression on me. The film may not be your typical masala entertainer, but it has its own intensity that slowly pulls you in.<br/><br/>The story builds up with a mix of mystery, emotion, and a slight old-school flavor, which I actually enjoyed. What stood out the most for me was Akshaye Khanna&#39;s performance, he completely owns every frame he&#39;s in. There&#39;s something about his calm yet commanding presence that makes even the simplest dialogue hit harder. He brings depth to his character without going overboard, and that&#39;s what makes him so good. You can sense the maturity and nuance he adds; it&#39;s one of those performances that remind you why he&#39;s still among the most underrated actors in Bollywood.<br/><br/>The supporting cast did fairly well too, though some scenes could&#39;ve had tighter editing. The background score added a nice touch to the tension, especially in the second half. But honestly, it&#39;s Akshaye who carries the film on his shoulders.<br/><br/>Overall, Dhurandhar is not just another thriller, it&#39;s a performance-driven film with substance. If you&#39;re someone who appreciates strong acting and layered storytelling, it&#39;s definitely worth watching once."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008116/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007354",
              "author": {
                "username": {
                  "text": "karanbhargav-88289"
                },
                "userId": "ur154427461"
              },
              "summary": {
                "originalText": "A Story That Hits Hard and Fast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film is a study in patience and precision, gradually drawing the audience into its intricate web of crime, politics, and personal conflict. Ranveer Singh anchors the story with a performance that is equal parts intensity and subtlety, making every decision feel consequential. Director Dhar&#39;s vision is evident in the careful pacing, visual storytelling, and attention to character arcs. Action scenes are expertly choreographed, blending realism with cinematic spectacle. Supporting cast members bring authenticity and depth, enriching the narrative. Cinematography, editing, and score come together seamlessly, enhancing the emotional and narrative impact. The climax delivers both catharsis and reflection, leaving a powerful aftertaste."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007354/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007151",
              "author": {
                "username": {
                  "text": "laadharsh"
                },
                "userId": "ur118091124"
              },
              "summary": {
                "originalText": "Stars Shine Bright in This Action Saga"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every frame of the film feels deliberate, balancing action, narrative complexity, and emotional resonance. Ranveer Singh delivers a performance layered with intensity, portraying a man navigating morality, danger, and loyalty with stunning precision. Sanjay Dutt brings his characteristic gravitas and menace, commanding every scene he inhabits. Akshaye Khanna and R Madhavan provide sophisticated, layered performances that enrich the ensemble, while Arjun Rampal&#39;s understated menace adds tension that never relents. Sara Arjun&#39;s scenes are emotionally striking, her innocence a counterpoint to the story&#39;s high stakes. Aditya Dhar orchestrates action, suspense, and strategy masterfully, creating sequences that are both visually stunning and narratively essential. Cinematography captures the chaos and intimacy of the story world beautifully, while the score punctuates tension, suspense, and drama. By the climax, the narrative threads converge in a thrilling, emotionally charged resolution that leaves a lasting impression."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007151/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018284",
              "author": {
                "username": {
                  "text": "luqman96"
                },
                "userId": "ur196609066"
              },
              "summary": {
                "originalText": "Best movie of 2025 🔥🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is how a espionage/spy film should be made, It was pure goosebumps moment\nCan&#39;t believe i watched it,\nThe music was great sashwat sachdeva dropped bangers 💥\nThanks to Adithya dhar for making this film 🙏\nRanveer Singh deserves national award for dhurandhar🙌\nDhurandhar is the best movie of 2025 🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018284/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015946",
              "author": {
                "username": {
                  "text": "rakshit-28434"
                },
                "userId": "ur132044487"
              },
              "summary": {
                "originalText": "Obliterates the Pakistani Deep State"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Durandhar works remarkably well as a political thriller because it balances tension with emotion instead of relying only on action. The story dives into power, guilt, and moral compromise in a way that stays engaging while still leaving space for reflection. Ranveer Singh carries the film with a performance that is intense yet measured, making the character&#39;s moral struggle believable."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015946/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010942",
              "author": {
                "username": {
                  "text": "abhishekkumarsingh-83697"
                },
                "userId": "ur136193402"
              },
              "summary": {
                "originalText": "Best movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best movie I have ever watched till now . Shows the reality of Pakistan and some liberalundu living in India, really happy to see them crying. The songs are Epic, editor has done a very excellent work all the cast and their dresses. Director has focused on every small small details. Bollywood deserve more director and producer like Aditya Dhar ."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010942/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007076",
              "author": {
                "username": {
                  "text": "deepparrikar"
                },
                "userId": "ur190973277"
              },
              "summary": {
                "originalText": "The Perfect Storm of Stars, Drama, and Thrills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s strength lies in its immersive world, detailed plotting, and powerful performances. Ranveer Singh balances inner conflict with outward decisiveness, while Sanjay Dutt dominates scenes with gravitas. Akshaye Khanna and R Madhavan provide intelligent support, and Arjun Rampal contributes quiet menace. Sara Arjun grounds the narrative emotionally. Aditya Dhar blends tension, drama, and action with masterful pacing, while cinematography captures the story&#39;s scope and emotion. The soundtrack heightens suspense and emotional beats. By the climax, the film delivers a high-stakes, emotionally resonant experience that lingers long after viewing."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007076/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007242",
              "author": {
                "username": {
                  "text": "mayanksharma-25544"
                },
                "userId": "ur118094764"
              },
              "summary": {
                "originalText": "Heartfelt Drama, Edge-of-Seat Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative is a slow-burning exploration of morality, loyalty, and ambition in a dangerous underworld. Ranveer Singh carries the film with a performance rich in nuance and intensity, while Sanjay Dutt dominates scenes with commanding authority. Akshaye Khanna and R Madhavan provide layered performances that complement the leads and strengthen the story&#39;s realism. Arjun Rampal&#39;s understated menace keeps viewers on edge, and Sara Arjun&#39;s emotional presence emphasizes the human cost of conflict. Aditya Dhar orchestrates action, suspense, and character development with mastery, ensuring every sequence advances the story while engaging the audience. Cinematography captures both grandiose and intimate settings, while the musical score heightens tension and emotional stakes. The final act delivers a thrilling and emotionally charged payoff that lingers long after the film ends."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007242/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024910",
              "author": {
                "username": {
                  "text": "harshitsolanki-85659"
                },
                "userId": "ur150861921"
              },
              "summary": {
                "originalText": "Must to watch."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Fabulous 🎥\nMore movies like this should be made and promoted as much as possible.<br/><br/>The story, cinematography, sound, acting &amp; story were top notch like best of best. Very patriotic movie but shows reality... Very inspirational like this much that\nJust convinced me to become a special force army officer...\nMy English is not that good so sorry if there are any mistakes in it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024910/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029699",
              "author": {
                "username": {
                  "text": "HemantC-593"
                },
                "userId": "ur206496927"
              },
              "summary": {
                "originalText": "DHURANDHAR: HONEST REVIEW"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is not a movie, this is the dawn of the new century for bollywood, if this type of movies made in future, bollywood will compete with Hollywood.thsi movie is bombastic , famous in whole india , teh song FA9LA worked so well that Akshye khanna nailed it , this movie is bombastic, the scenes, casts , story , MUSIC are relly upper level , good work , jio studios we will wait for such a movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029699/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003760",
              "author": {
                "username": {
                  "text": "Kmanav"
                },
                "userId": "ur4606595"
              },
              "summary": {
                "originalText": "Dhurandar: Style, Substance and Stunning Performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film opens with a confidence that is immediately disarming. Dhurandar doesn&#39;t rush. It watches, listens, and slowly allows its world to unfold with a kind of swagger that comes only from total conviction in writing and craft. Within minutes, you realise you aren&#39;t merely watching a film-you&#39;re entering a vibrant ecosystem of personalities, egos, secrets and ambitions.<br/><br/>The narrative breathes. Every scene feels measured, yet alive. Dialogues crackle with wit, the dramatic beats never overreach, and the emotional undercurrents are surprisingly tender. There is a tonal balance here - satire, sentiment, and sharp observation - handled with the sort of maturity Hindi cinema rarely attempts today.<br/><br/>Performances are the engine, and what an engine.<br/><br/>Rakesh Bedi, the &quot;yesterday&#39;s young comedian&quot; who has seen decades of stage and screen, brings a touch of genius. His rhythm is impeccable. He does not try to be funny - he is funny. Even when silent, the eyes comment, the body responds, and the scene wakes up. He steals moments with the ease of a veteran who knows timing is everything.<br/><br/>Akshay Khanna gives a performance that is both brittle and charismatic. There is a wryness in his smile, a melancholy in his gaze, and a razor hidden behind almost every word. He moves through the film like a man who has seen too much and trusted too little, and the audience senses the fragility beneath the surface. His restraint is thrilling.<br/><br/>And then there is Ranbir Singh. Physically, visually, energetically - he looks like he has walked out of a polished Hollywood frame. The grooming, the attitude, the sinewy precision of his movement, the camera loves him. More importantly, he delivers not only glamour but gravitas. His presence lifts the film. There is a quiet command in his performance, the kind that makes every scene feel more expensive, more international, more stylish.<br/><br/>What stays long after the lights come up is the feeling of pleasure - the pleasure of watching actors who know their craft, a director who respects the story, and a film that never underestimates its audience. Dhurandar is witty without being flippant, emotional without being sentimental, and entertaining without ever becoming hollow.<br/><br/>A rare achievement in contemporary cinema.<br/><br/>A film worth applauding."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003760/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11048073",
              "author": {
                "username": {
                  "text": "RumanaA-44"
                },
                "userId": "ur206832005"
              },
              "summary": {
                "originalText": "More than just a movie-it's a powerful experience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is much more than just a movie-it&#39;s a powerful experience that stays with you. From the very first scene, it pulls you in and keeps you completely engaged. The storytelling is gripping, the pacing is smooth, and every scene feels purposeful.<br/><br/>The performances are outstanding, with each actor delivering emotions that feel real and natural. Nothing seems forced, and the emotional moments lands perfectly. On top of that, the songs and background score are absolutely top-notch. The music blends beautifully with the story, elevating key scenes and making the overall experience even more immersive.<br/><br/>Despite being around more than 3 hours the movie never feels lengthy. The flow is so well handled that time just flies by. Dhurandar truly stands out as one of those rare films that leave a lasting impression. If you haven&#39;t watched it yet, you&#39;re seriously missing out."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11048073/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007148",
              "author": {
                "username": {
                  "text": "RitikR-07"
                },
                "userId": "ur203912371"
              },
              "summary": {
                "originalText": "A universe where every moment counts and every star delivers"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative gradually unfurls like a tightly wound coil, releasing tension in carefully orchestrated bursts. Ranveer Singh commands attention, portraying internal conflict with subtle expressions and well-timed intensity. The supporting cast complements his performance, adding weight to every political and underworld dynamic. Director Dhar&#39;s vision shines through his ability to blend thoughtful character study with high-stakes action. The cinematography captures both the claustrophobia and expansiveness of the setting, while editing maintains narrative tension throughout. The action is both visceral and story-driven, culminating in sequences that are unforgettable for both spectacle and emotional resonance."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007148/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}