{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4s6ncbsqyxdo6id7wtxxmrvrxu4qazy2mpd37hjdpj3qflanes26bk5oa4u7w7ucl6gzq6xgy7uzsqvxdgdzy6j",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11024442",
              "author": {
                "username": {
                  "text": "albusdumbeldoreengland"
                },
                "userId": "ur158334347"
              },
              "summary": {
                "originalText": "Shows reality of Pakistan"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The Anti-Nationalist crictics in India are having heavy meltdown on this movie. That, how could they show true face of Pakistan. I appreciate the Writer &amp; Director Sir Aditya Dhar&#39;s vision. This shows how passionate and dedicated director he is! Kudos to entire dhurandhar team! A truly fact based project. Love it! Would watch it again and again on loop."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024442/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11090724",
              "author": {
                "username": {
                  "text": "dubeyakashm"
                },
                "userId": "ur150949883"
              },
              "summary": {
                "originalText": "\"Dhurandhar: When Music, Direction, and Reality Collide\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerful and thought-provoking film that leaves a lasting impact right from the very beginning. The movie opens with a shlok from the Bhagavad Gita, instantly setting a profound and intense tone-something rarely seen and deeply effective.<br/><br/>What truly stands out is the direction and the bold choice of background music. The way songs are placed during crucial scenes is simply unbelievable. No one would imagine playing &quot;Loot Le Gaya&quot; during an election candidature announcement, yet it worked brilliantly. Similarly, using the Dhurandhar title track during the car fight sequence elevates the scene to another level. These creative risks make the audience go &quot;wow&quot; repeatedly.<br/><br/>Beyond the cinematic brilliance, the film courageously showcases the harsh realities of heinous terror attacks in India by Napak and highlights the importance and impact of demonetization-handled with clarity and conviction.<br/><br/>Overall, Dhurandhar is not just a movie; it&#39;s an experience that blends storytelling, music, and realism with purpose.<br/><br/>A must-watch for each and every Indian. 🇮🇳"
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-02",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11090724/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11053099",
              "author": {
                "username": {
                  "text": "sandybindass-24445"
                },
                "userId": "ur174761391"
              },
              "summary": {
                "originalText": "A Realistic Spy Thriller That Redefines the Genre"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The action scenes are amazing. The intention behind these scenes was to show cruelty, and they succeed in doing so very effectively. The screen time given to each actor is perfectly balanced and according to the requirement of the story. The dialogues are beautifully written.<br/><br/>A spy movie should not be overly heroic; instead, it should feel real-like a true mole story that makes the audience feel the fear of being caught and the terror of punishment. This movie serves that purpose very well. The collections are impressive, especially considering that the movie was banned in Gulf countries, from where a major portion of overseas collections usually comes.<br/><br/>Aditya Dhar has changed the dynamics of the spy movie genre. This will be a real challenge for YRF Productions in the future.<br/><br/>Another beautiful aspect of the movie is its songs. You hardly feel like you are listening to songs; instead, they feel like a continuation of the story the director wants to narrate. The songs play a vital role-without them, the movie would feel incomplete. Kudos to the music director for composing/recomposing such beautiful tracks and to the director for using them at the right moments.<br/><br/>The promotions of this movie were minimal. Only word of mouth worked, and I believe this is how it should be for all movies. If a movie is good, no negative hate can stop it. Dhruv Rathee tried hard to defame it and portrayed it as propaganda, similar to a Vivek Agnihotri movie, but he did not succeed.<br/><br/>Therefore, this movie is a perfect example for filmmakers: focus on making a good product. Don&#39;t worry about promotions or negative criticism. If your product is good, word of mouth will help fill the seats.<br/><br/>#Pacifistsandeep."
                }
              },
              "authorRating": 2,
              "submissionDate": "2025-12-25",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 6
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11053099/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014138",
              "author": {
                "username": {
                  "text": "aparnrao"
                },
                "userId": "ur139046835"
              },
              "summary": {
                "originalText": "A no nonsense spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is the kind of movie that focuses on the story and not on one &quot;hero&quot; character, such a refreshing change from the usual bollywood story telling. The real events in the background adds credibility. The violence and the gore takes some getting used to, but it doesn&#39;t distract from the actual story line. Overall, its a fresh new approach to a spy thriller."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014138/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021252",
              "author": {
                "username": {
                  "text": "gauravronaldo"
                },
                "userId": "ur123846987"
              },
              "summary": {
                "originalText": "A tribute to the nation's security holders"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every true Indian should watch this movie repeatedly. It&#39;s a tribute to the security forces of the country for whom we are living a peaceful life. The reality of the dark world of terrorism has been wonderfully portrayed and how New India handles it tactically has been narrated in the best possible manner. Must watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021252/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11041324",
              "author": {
                "username": {
                  "text": "imdbfan-0611422940"
                },
                "userId": "ur198704813"
              },
              "summary": {
                "originalText": "Raw spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A wonderful movie. Not like some yrf movie best movie in this year from india.<br/><br/>Aditya Dhar your work is improving with years you are going to be a great director in upcoming days . Excited for second part . Ranveer Singh acting was topclass as well as Akshay khanna&#39;s and sanjay dutt but madhavan screen time was very less should be more in second part 🔥🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11041324/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015824",
              "author": {
                "username": {
                  "text": "ReelMysterySeeker"
                },
                "userId": "ur90728055"
              },
              "summary": {
                "originalText": "A Gritty Beast of a Film - Raw, Relentless & Intensely Engaging"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just another Bollywood thriller; it is a heavy, unfiltered experience that grips you from the first act and refuses to let go. Set against the backdrop of crime, espionage, and political tension, the film dives deep into the underworld with courage and ambition. What stands out immediately is how unapologetically gritty it is - no sugar-coating, no restraint, just pure high-voltage storytelling.<br/><br/>The performances are a major driving force here. Ranveer Singh delivers one of his most layered roles in recent times, balancing aggression, conflict, and vulnerability with finesse. Akshaye Khanna, calm but dangerously compelling, steals scenes without effort. Supporting actors like R. Madhavan and Sanjay Dutt bring their own weight to the narrative, making the film feel rich in character and presence. Each face on-screen adds to the story rather than just filling space.<br/><br/>Cinematography and sound design elevate the tension - dimly lit alleys, chaotic shootouts, and atmospheric background score create a world you can feel. However, Dhurandhar isn&#39;t a light watch. At nearly three and a half hours, the length is noticeable. The story is loaded with subplots, violence, and emotional weight, which may overwhelm viewers who prefer tighter or softer films. But for those who appreciate bold storytelling, the runtime serves as immersion rather than drag.<br/><br/>What makes Dhurandhar memorable is not just the action, but the emotion beneath it - loyalty, sacrifice, betrayal, and the cost of power. It leaves you thinking, even after credits roll.<br/><br/>A long, intense, and hard-hitting film - not perfect, but undeniably impactful."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015824/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11038534",
              "author": {
                "username": {
                  "text": "Aksh-03"
                },
                "userId": "ur211792141"
              },
              "summary": {
                "originalText": "Prayed for times like this."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After so many years, finally a movie which shows the truth the way it is. Don&#39;t think just go watch the movie.<br/><br/>No extra drama, no imaginary friendships btw two enemy nations. Just brutal and raw truth as it can get. Can&#39;t wait for next part. Movie left me in shock, so moving.<br/><br/>Can&#39;t thank Aditya Dhar enough for getting this out for everyone to see."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11038534/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023683",
              "author": {
                "username": {
                  "text": "nikhileragon"
                },
                "userId": "ur111463723"
              },
              "summary": {
                "originalText": "A movie worth watching."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Only thing to say is that the left and other tukde tukde gang must be using a lot of burnol now.<br/><br/>Movie is exhilarating and interesting. Many points shown in the movie are such that most of bollywood actors and directors will avoid. Hat&#39;s off to the director. Akshay Khanna has done a tremendous job of real acting and the movie won&#39;t make you sit silently at all. Ranveer Singh has done an amazing job in his role and the character buildup is astonishing. The small details of the movie showing is amazing also. Overall the movie is worth watching...."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023683/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016501",
              "author": {
                "username": {
                  "text": "Chandraketup"
                },
                "userId": "ur211611719"
              },
              "summary": {
                "originalText": "One of the best movie from Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The pursuit of a film that delivers the &quot;unvarnished truth about a country, without any gimmicks or false pretenses&quot; is a quest for authentic cinematic representation. This kind of movie transcends mere entertainment; it becomes a vital document, a mirror reflecting a nation&#39;s soul, its complexities, and its often-uncomfortable realities. Such a film must deliberately eschew the typical Hollywood tropes and narrative conventions that smooth over rough edges or prioritize an easily digestible, marketable image."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016501/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029382",
              "author": {
                "username": {
                  "text": "sumit-10113"
                },
                "userId": "ur64120119"
              },
              "summary": {
                "originalText": "Must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What an experience this was. Redefining the genre of Indian Spy movies. The harmony of characters and the incorporation of real footage of various terrorist activities just made the story more compelling. The 4 hours just passed like wind and wasn&#39;t bored once. Must watch movie if you love Indian cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029382/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001418",
              "author": {
                "username": {
                  "text": "newtonbon"
                },
                "userId": "ur150659203"
              },
              "summary": {
                "originalText": "Dhurandhar is a film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a film that seems ambitious on the surface, but the moment it begins, it becomes clear that the execution is far from effective. The story lacks originality and feels like a collection of familiar plotlines seen many times before. There is no real novelty, no surprise element, and no emotional depth that keeps the audience hooked. The narrative moves at a frustratingly slow pace, dragging through scene after scene without meaningful progress.<br/><br/>The characters feel hollow due to poor writing. The protagonist doesn&#39;t have a strong personality or compelling motivation. His emotional journey is inconsistent, and his reactions often feel misplaced. The supporting characters exist only for the sake of filling space and do not contribute meaningfully to the storyline. Even the villain lacks presence, making the conflict feel weak and unexciting.<br/><br/>The direction lacks clarity and confidence. Many scenes feel stretched without purpose, while others feel rushed and unfinished. Emotional scenes fail to connect, action scenes lack intensity, and dramatic scenes feel over-performed. The film struggles to maintain the audience&#39;s attention because it doesn&#39;t offer any memorable or engaging moment.<br/><br/>Technical aspects also fall short. The cinematography feels flat and uninspiring, with very few visually interesting shots. The editing is sloppy, causing abrupt scene transitions that break the flow. The background music feels repetitive and often fails to match the tone of the scene.<br/><br/>By the time the movie reaches its climax, the audience is already exhausted. The conclusion feels weak and unearned, leaving viewers unsatisfied. The film attempts to end with an emotional resolution, but since the journey itself lacked emotional weight, the final scene also feels meaningless.<br/><br/>Overall, Dhurandhar is a disappointing film with weak writing, poor direction, dull performances, and slow pacing. It lacks the energy and emotional impact needed to make it memorable. It&#39;s not a movie I would recommend to anyone looking for a strong or engaging cinematic experience."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 9,
                "downVotes": 189
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001418/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011368",
              "author": {
                "username": {
                  "text": "twinkle-04212"
                },
                "userId": "ur142281244"
              },
              "summary": {
                "originalText": "Dhurandhar: Intense, Unfiltered, and Worth Every Minute"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Genuinely enjoyed watching Dhurandhar. Even though it&#39;s a lengthy film, not a single minute felt wasted. The narrative is gripping, the performances are solid, and the film keeps you hooked with its intensity and realism.<br/><br/>One of the most impactful aspects of the movie is how boldly and accurately it portrays Pakistan, its terror outfits, and their deep nexus with criminal gangs operating across the border. The film doesn&#39;t shy away from exposing the machinery behind terror-how handlers, networks, and gangs operate as one coordinated system. It presents this dark reality without exaggeration, and that honesty hits hard.<br/><br/>But the moment that shook me the most was the 26/11 sequence. Hearing the actual recorded conversation between the terrorist and his handler sent chills down my spine. It was unsettling, infuriating, and emotional all at once. That scene alone reminds you why such stories need to be told-so we don&#39;t forget what happened and what still threatens us.<br/><br/>Overall, Dhurandhar is more than just a film-it&#39;s an experience. Intense, revealing, thought-provoking, and absolutely worth your time. I walked out feeling both impressed and deeply moved."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011368/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011567",
              "author": {
                "username": {
                  "text": "Ankitr-2171"
                },
                "userId": "ur211576449"
              },
              "summary": {
                "originalText": "Pure cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It was great in portraying actual horror of terrorist so brutal and realistic surely best cinema experience.the story the cast their acting all are just perfectly blended. It runs on a smooth pace you won&#39;t even realise how 3 hours passed so quickly.it is very great to see nowadays the level of indian cinema is rising and they are showing true face of terror with facts so people must understand this."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011567/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027213",
              "author": {
                "username": {
                  "text": "madhabikanayak"
                },
                "userId": "ur83972420"
              },
              "summary": {
                "originalText": "This is cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is mad\nBollywood is so back.<br/><br/>Dhurandhar is not just a movie, it&#39;s an experience that slowly grips you and refuses to let go. From the very first frame, the film pulls you into a dark, intense world where silence speaks louder than dialogues and every look carries weight. The storytelling is raw, layered, and unapologetically bold.<br/><br/>The performances are the backbone of this film. Each character feels lived-in, especially the ones walking the thin line between right and wrong. There are no easy heroes here-only humans shaped by circumstances. The emotions feel real, sometimes uncomfortable, and that&#39;s exactly what makes Dhurandhar stand out. You don&#39;t just watch the characters; you feel their struggles, their rage, and their quiet moments of vulnerability.<br/><br/>The direction deserves special mention. The pacing is deliberate, allowing scenes to breathe and tensions to build naturally. The background score subtly enhances the mood without overpowering the narrative, and the cinematography captures the grit and intensity perfectly. Every frame feels purposeful, adding depth to the story rather than just looking visually appealing.<br/><br/>What truly makes Dhurandhar memorable is its ability to stay with you even after the credits roll. It makes you think-about choices, consequences, and the price one pays for power and survival. The film doesn&#39;t spoon-feed answers; instead, it trusts the audience to interpret, question, and reflect.<br/><br/>In an era of loud and predictable cinema, Dhurandhar chooses to be different. It&#39;s brave, thought-provoking, and emotionally heavy in the best way possible. This is the kind of film that grows on you with time, leaving an impact that doesn&#39;t fade easily.<br/><br/>Dhurandhar is cinema that demands attention-and rewards it fully."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027213/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014812",
              "author": {
                "username": {
                  "text": "DakshM-165"
                },
                "userId": "ur211600570"
              },
              "summary": {
                "originalText": "Amazing movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s amazing the movie.i like how the director use the real life footage to generate the revenge emotion in audience. The fiction story around it was really well done. For an Indian movie the action was done much closer to reality, for most part . Which the audience appreciate. Ranveer kapoor acting was as always fabulous. I also loved the villains. I await for the 2 movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014812/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014522",
              "author": {
                "username": {
                  "text": "GauravK-2856"
                },
                "userId": "ur211598959"
              },
              "summary": {
                "originalText": "wow! amazing best movie of 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Loved it. Dhurandar is a feel-good film that leaves you smilingOne of the major strengths of Dhurandar is its clean, cleverly written script. The dialogues are witty, the situations are relatable, and the pacing keeps the film engaging without a single dull moment. The director deserves credit for shaping the story into a vibrant, fast-paced entertainer that never loses its emotional core\nIt&#39;s refreshing, well-crafted and packed with memorable moments If you&#39;re looking for a wholesome entertainer Dhurandar is absolutely worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014522/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015457",
              "author": {
                "username": {
                  "text": "Anmolk-035"
                },
                "userId": "ur211604578"
              },
              "summary": {
                "originalText": "Bhut time baad essi koi badass movie ayyi h bollywood me"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Mind blowing. Dhurandhar is a gripping blend of stylish action, emotional depth, and sharp storytelling that keeps you engaged from the very first frame. What makes the film truly stand out is its ability to balance sleek, high-octane moments with grounded human drama, creating a cinematic experience that feels both entertaining and meaningful."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015457/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026353",
              "author": {
                "username": {
                  "text": "wholefood-79159"
                },
                "userId": "ur160971958"
              },
              "summary": {
                "originalText": "Amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Loved it. Amazing\nTechnically sound and cinematography fab\nPerformance top notch\nStory and screenplay out of the world ,\nMusic and background music great\nLocation and production value top level .<br/><br/>Akshay Khanna has proved its acting above looks and abs\nRanveer Singh is great , subtle yet amazing best after Sarkar (Amitabh Bachchan )\nArjun Rampal is amazing as well.<br/><br/>Rakesh Bedi is fabulous\nGive more chances to old actors they will prove why they were legendary\nKudos to Aditya Dhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026353/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015846",
              "author": {
                "username": {
                  "text": "ShikhaB-082"
                },
                "userId": "ur211604863"
              },
              "summary": {
                "originalText": "Rekindled my love for cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Where shall I begin? I loved and enjoyed this movie thoroughly. This movie rekindled my love for action movies again and took me once again to theatres after many years. This is the film I wanted for so long. This is an excellent well made movie without having over the top action and is grounded in reality driven by a compelling storyline and good acting which is not the case with action movies these days which are just massy and over the top action. Don&#39;t get me wrong I like massy film but I think india has stretched it too far. Even if I put aside this fact this film is good by its own merit. The characters drives the story forward and are so impactful. I know everybody is gasping about Akshay Khanna&#39;s character, yes sure he has done an exceptional job with his character and is very impactful throughout the film but I loved and deeply resonated with Ranveer Singh&#39;s character. His eyes did all the work, he barely had any dialogues in the film. I connected with him instantly with the opening song &quot;na karwan ki talash na humsafar ki talash hai&quot;. This sets the characters motivation so perfectly and to see the pain and hardship his character goes through makes you realise what the people in this work go through in real life to protect this nation. Ranveer Singh&#39;s character is so small and purposefully so and yet so impactful. Especially the scene of 26 11, I literally cried reminiscing of what a horror it was back in the day. It was conveyed from the perspective of ranveer singh so beautifully that you feel all his helplessness and pain. The fact that the horror of the reality is front of him and he s shocked and hyperventilating but he cannot react in that moment. His character deeply touched me because I think the people who only exist just to protect a nation sacrificing everything that life could offer, choosing hardship for others, truly are the most noble people on this planet. I think that&#39;s the highest form of love that the person is capable of. I could feel the emptiness and holoness of his character and yet I could feel his pure sense of love for his nation. It is great acting. Sanjay Dutt&#39;s character was fun and the conflict and face off between Akshay Khanna&#39;s character and his was truly a delight to me. It was entertaining to the core. Sanjay Dutt&#39;s madness and his self driven motivation to kill Akshay Khanna&#39;s character was pure entertainment. This movie was so much more on the deep level than just on the surface is what makes it an outstanding piece of art. Aditya dhar has given us yet again another film which we all indians can be proud of."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015846/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011216",
              "author": {
                "username": {
                  "text": "borkarfaiz"
                },
                "userId": "ur63756912"
              },
              "summary": {
                "originalText": "Akshaye Khanna Shines, the Film Doesn't"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar doesn&#39;t divide people by country; it divides them by religion. The film subtly reinforces a narrative that certain entities have already normalised in our society, repeatedly hinting that one particular community is the problem. It ends up feeling more like a propaganda piece than a genuine thriller. Apart from Akshaye Khanna&#39;s acting, there&#39;s nothing here worth holding on to. If you enjoy violent action, the movie has some of that, but I&#39;m not a fan of that style anyway. For me, the whole experience falls flat."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 22
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011216/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004379",
              "author": {
                "username": {
                  "text": "whkb-63236"
                },
                "userId": "ur151019687"
              },
              "summary": {
                "originalText": "Thank you Aditya Dhar."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is an electrifying action thriller that keeps you on the edge of your seat. Akshay Khanna steals the show with his captivating performance, making him a standout star in this gripping film. Rakesh Bedi&#39;s versatile acting shines in Dhurandhar, as he portrays a politician willing to go to great lengths for power. Meanwhile, Sara Arjun impresses in her film debut, showcasing remarkable talent."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004379/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010850",
              "author": {
                "username": {
                  "text": "visheshc-87"
                },
                "userId": "ur211568436"
              },
              "summary": {
                "originalText": "The best in class movie."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Kya movie hai year, Pakistan ki gaand fadne wali movie hai. This also shows that congress government is the worst.<br/><br/>A tremendous movie showing what India is capable of.<br/><br/>All the star cast has done the roles very good.<br/><br/>Especially role of Akshaye khanna sir was something unforgettable.<br/><br/>Kudos to the team of Dhurandar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010850/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016755",
              "author": {
                "username": {
                  "text": "vartikav-68317"
                },
                "userId": "ur158893469"
              },
              "summary": {
                "originalText": "Dhurandhar is blockbuster.."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I genuinely have no words to describe how magnificent Dhurandhar is. I&#39;m still in absolute awe of what I just witnessed. It&#39;s one of those rare cinematic experiences that stays with you long after the credits roll. Every frame, every beat, every performance feels like a reminder of what exceptional filmmaking truly looks like.<br/><br/>Aditya Dhar&#39;s direction is nothing short of tremendous. The command he has over the craft, the clarity of vision, and the sheer boldness with which he brings this story alive is remarkable. It genuinely feels like after ages, Bollywood has delivered something so powerful, so purposeful, and so worth watching. He is truly a boon to our industry.<br/><br/>And then what an extraordinary cast. I have honestly never seen such accurate casting in the history of Bollywood. It feels almost unreal how perfectly every actor fits their role.<br/><br/>Akshaye Khanna has my whole heart. He is par excellence, an actor who doesn&#39;t just perform but becomes the soul of the film. His screen presence is magnetic, when he appears, your eyes simply cannot look anywhere else. The depth, intensity, and honesty he brings to his character is beyond brilliant.<br/><br/>Ranveer Singh delivers what I believe is his finest performance to date. This new avatar suits him unbelievably well, controlled, powerful, and refreshingly nuanced. He looks absolutely dapper throughout and performs with a maturity that demands applause.<br/><br/>R. Madhavan once again proves that he can effortlessly slip into any role given to him. His versatility and conviction shine through. Arjun Rampal too is outstanding, impactful, composed, and perfectly cast.<br/><br/>The cinematography is breathtaking, each shot crafted with such precision and visual depth that it pulls you right into the world of the film. The screenplay is tight, immersive, and brilliantly layered, keeping you invested every single second. And the background score.. outstanding. Shashwat Sachdev&#39;s work elevates the narrative to another dimension; his soundtrack isn&#39;t just music, it&#39;s emotion, woven so seamlessly into the storytelling that it becomes a character of its own.<br/><br/>Dhurandhar is not just a film; it is an experience, stunning, immersive, and unforgettable. It reignites hope in Bollywood, reminding us that brilliance is still very much alive when the right minds come together. This movie will stay with me for a long, long time.<br/><br/>I still can&#39;t believe the masterpiece I&#39;ve just witnessed."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016755/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028608",
              "author": {
                "username": {
                  "text": "salonionijain"
                },
                "userId": "ur160638662"
              },
              "summary": {
                "originalText": "Mindblowing."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best movie i have seen in a very long time, feels like Hollywood...no nautanki, awesome script, great acting, mind blowing bgm n songs. This is a masterpiece and I cannot wait for part 2. Everyone should watch this movie...and the people who are baiting on it have an agenda for sure, these are the people who are fans of war and Pathan type movie where hero has to fall in love with the enemy...this is as real as it gets."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028608/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}