{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6ldzitazcwzy472vxtmjxr3rmqary3epdd4hidpj3qflanes2ydk5pe2u7w4mfqmrtlg6fd2ak5m47wi7ei7k",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11007229",
              "author": {
                "username": {
                  "text": "silentkillervampire"
                },
                "userId": "ur105653772"
              },
              "summary": {
                "originalText": "Great movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great movie..dad of pakistanis....\nRanveer Singh delivers one of his most controlled yet explosive performances. His character is fierce, vulnerable, and unpredictable - making him the film&#39;s emotional anchor.<br/><br/>Akshaye Khanna is an absolute scene-stealer. His calm but terrifying screen presence adds depth and menace to the narrative.<br/><br/>Sanjay Dutt, Madhavan, and Arjun Rampal complement the story with weighty, convincing performances. No role feels wasted."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007229/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013981",
              "author": {
                "username": {
                  "text": "ayanchakrabarty"
                },
                "userId": "ur72133119"
              },
              "summary": {
                "originalText": "A Pulse-Pounding Spy Action Thriller That Delivers From Start to Finish"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This spy action thriller is an absolute adrenaline rush-slick, sharp, and relentlessly gripping. From the opening frame, it throws you into a world of shadowy intelligence networks, ruthless operatives, and high-stakes missions where every choice feels like life or death. The pacing is electric, balancing explosive action sequences with tense, edge-of-your-seat espionage drama.<br/><br/>All the lead characters are magnetic, carrying the film with a perfect blend of intensity and vulnerability. This is a movie that other directors can learn a lot from and that stands out as a benchmark of espionage films. But what stands out is Akshaye Khanna&#39;s performance. His presence elevates the entire film-every expression, every line, every calculated move adds a layer of menace that lingers long after the moment has passed. It&#39;s the kind of portrayal that doesn&#39;t just challenge the hero-it defines the movie. The choreography of the action scenes is outstanding-clean, brutal, and brilliantly shot, proving that the genre can still surprise with fresh, inventive set pieces. The plot is layered without ever feeling confusing, rewarding the viewer with twists that land and emotional stakes that matter.<br/><br/>What truly elevates the movie is its atmosphere, the double-crosses, and the globe-trotting danger-all executed with cinematic finesse. It&#39;s the kind of thriller that keeps your heart racing long after the credits roll.<br/><br/>What brings this to life more is the truthfulness of the director and not something like a fancy spy thriller. Dhurandhar is a must-watch for anyone who loves smart espionage, fierce action, and storytelling that never lets go off the audience&#39;s attention."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013981/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014769",
              "author": {
                "username": {
                  "text": "Tushar-758"
                },
                "userId": "ur211600768"
              },
              "summary": {
                "originalText": "Best movie showing the reality"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Crazy scenes crazy action I love the movie and I&#39;m in hundred percent sure to sure watch all upcoming parts of this movie and existed and this movie is showing the reality of the Pakistan how they do the attacks on India Aditya doing grateful work I love it and this movie is the worth of money must watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014769/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11037546",
              "author": {
                "username": {
                  "text": "pankajmalvi-93965"
                },
                "userId": "ur70868321"
              },
              "summary": {
                "originalText": "Bang of Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After soooo long without vfx the soul of film making comes into theatre , pure story almost touches reality Super Direction , Cast , Acting , BGM and more over the patriosm shows this how should be SPY MOVIE develop and Akshay Khanna was cherry on top , the Swag , Apex Predator woooooo,can&#39;t wait for second part."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11037546/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006411",
              "author": {
                "username": {
                  "text": "rituchouhan-68210"
                },
                "userId": "ur179210674"
              },
              "summary": {
                "originalText": "High Voltage Action & Heartfelt Stories"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A sense of urgency permeates the story, heightened by precise action choreography and a gripping score. Actors deliver nuanced performances that lend credibility to both the thrills and the quieter emotional moments. The director maintains a tight narrative focus, seamlessly integrating suspense, moral dilemmas, and explosive sequences into a cohesive, unforgettable cinematic experience."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006411/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006459",
              "author": {
                "username": {
                  "text": "seregoid"
                },
                "userId": "ur176953083"
              },
              "summary": {
                "originalText": "Sound, Fury, and Heart in Every Frame"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Supporting performances are impactful, adding layers to the central narrative. Cinematography, sound, and editing coalesce to create an immersive experience, with action sequences that thrill without overshadowing the story&#39;s core.<br/><br/>Dhurandhar is a cinematic triumph where every frame reflects meticulous planning and visionary direction."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006459/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017919",
              "author": {
                "username": {
                  "text": "AnuragR-984"
                },
                "userId": "ur208202860"
              },
              "summary": {
                "originalText": "Dhurandar : A Movie you can't miss at any cost"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the very first frame, Dhurandhar grabbed me by the collar and didn&#39;t let go for 3 hours and 30 minutes straight. This isn&#39;t just a movie - it&#39;s an experience, a spectacle, an emotional hurricane wrapped inside a visually stunning spy thriller 🎬✨. The performances are top notch especially that of Akshay Khanna . He literally overshadowed everyone in the movie . The BGM is a character of its own , Saurabh Sachdeva delivers the absolute banger of an Album 🔥 What truly stands out is how the film blends emotion, scale, and tension without ever losing its grip. Not a single dull moment 👌."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017919/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004167",
              "author": {
                "username": {
                  "text": "sainirh-73651"
                },
                "userId": "ur141401529"
              },
              "summary": {
                "originalText": "Dhurandhar - A Must-Watch Spectacle!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an intense and fantabulous cinematic experience that grips you from the very first frame. The acting by the entire cast is superb &amp; adds incredible depth and emotion, making every scene powerful and memorable. This is truly a movie that is a must watch in a theater to feel its scale, impact, and brilliance on the big screen.<br/><br/>The storytelling keeps you hooked throughout, and I genuinely can&#39;t wait for Part 2 to unfold the next chapter. Hats off to Director Aditya Dhar for delivering such a gripping, high-quality film inspired by true events. An absolute blockbuster!<br/><br/>#AdityaDhar #Dhurandhar #FirstDayFirstShow #hyderabad #ranvirsingh #akshaykhanna #thisisthenewIndia #GhayalHoonTohGhatakHoon #gharmeinghuskemarenge."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004167/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11097024",
              "author": {
                "username": {
                  "text": "ayushzade"
                },
                "userId": "ur175613673"
              },
              "summary": {
                "originalText": "best movie ever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": ".*Dhurandhar* is a compelling cinematic experience that leaves a strong and lasting impression. From the very beginning, the film establishes a confident tone, drawing the audience into a world that feels intense, layered, and thoughtfully constructed. The storytelling is one of its greatest strengths-tight, purposeful, and emotionally engaging without ever feeling rushed or overindulgent. Every scene appears to serve a clear narrative function, which keeps the momentum steady throughout.<br/><br/>The performances are particularly noteworthy. The lead character is portrayed with remarkable depth, balancing strength, vulnerability, and resolve in a way that feels authentic and powerful. Supporting performances further elevate the film, adding nuance and emotional weight to the story. The chemistry between characters feels organic, making their conflicts and alliances genuinely engaging.<br/><br/>Visually, *Dhurandhar* is striking. The cinematography enhances the mood of the film, using framing and lighting to reflect the inner turmoil and determination of its characters. Action sequences, where present, are well-choreographed and impactful, prioritizing storytelling over spectacle. The background score complements the narrative effectively, heightening tension during critical moments while allowing quieter scenes the space to breathe.<br/><br/>What truly sets *Dhurandhar* apart is its thematic depth. The film explores ideas of resilience, ambition, and moral complexity in a way that encourages reflection rather than offering easy answers. It respects the audience&#39;s intelligence, trusting viewers to engage with its subtleties and emotional undercurrents.<br/><br/>Overall, *Dhurandhar* is a strong, well-crafted film that combines solid performances, refined technical execution, and meaningful storytelling. It stands as a confident piece of cinema that entertains while also leaving room for thought, making it a highly satisfying watch and a memorable addition to its genre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-04",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11097024/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019713",
              "author": {
                "username": {
                  "text": "rajmani-38402"
                },
                "userId": "ur132305778"
              },
              "summary": {
                "originalText": "Comeback of bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "1st of all its Akshay khanna movie with new concepts actions strategies thriller dialogues with new era and the remake of songs from sa re ga ma touched the hearts of indian. Blockbuster movie without any promotion, no overacting, no remake scenes . Nest actors with direction,\nA truly passionate movie specially for Deshbhakats of a nation."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019713/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007220",
              "author": {
                "username": {
                  "text": "honeyjoshi-87792"
                },
                "userId": "ur118094027"
              },
              "summary": {
                "originalText": "All-Out Action Meets Deep Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative unfolds with careful precision, gradually pulling viewers into a world where every choice carries life-or-death consequences. Ranveer Singh&#39;s performance is magnetic, his intensity never waning even in the most emotionally charged moments, as he negotiates moral dilemmas with both subtlety and power. Sanjay Dutt&#39;s presence is magnetic, a towering figure whose every line and gesture exudes menace and authority. Akshaye Khanna and R Madhavan provide a cerebral counterbalance, their nuanced performances lending credibility and intelligence to the plot. Arjun Rampal&#39;s silent menace creates a constant layer of tension, while Sara Arjun&#39;s performance offers poignant emotional depth that humanizes the narrative stakes. Aditya Dhar orchestrates action, political intrigue, and psychological tension masterfully, balancing slow-building suspense with pulse-pounding sequences. Cinematography captures sprawling cityscapes, claustrophobic interiors, and intimate emotional moments with equal skill. The editing ensures a seamless flow, heightening suspense while preserving narrative clarity. By the climax, every character arc converges in a cathartic, emotionally charged sequence that is both shocking and inevitable."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007220/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018293",
              "author": {
                "username": {
                  "text": "Urbanm-27"
                },
                "userId": "ur206027804"
              },
              "summary": {
                "originalText": "High Adrenaline movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch for Indians and Pakistanis\nHow politician works and how the normal citizens are just puppets in the hands of both the countries. Will not vote for any other govt. The real struggles of unknown men because of them we sleep peacefully. Way better than Yash raj films wishy washy movies where half naked heroines and old men just shows six pack abs 😁 and faaltu Sfx."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018293/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11062329",
              "author": {
                "username": {
                  "text": "ratnakll"
                },
                "userId": "ur112398923"
              },
              "summary": {
                "originalText": "Outstanding 👍 Phenomenal ⭐⭐⭐⭐⭐"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great story, edge of the seat, thrilling experience. I mean even in a 11pm night show 3 and half hours, I couldn&#39;t blink it was gripping. This movie belongs to each and every actor. Akshay khanna Ranveer Arjun Maddy Rakesh Bedi and the shocking transformation shopkeeper Gaurav Gera. Top notch script, direction, fight scenes, the Rockstar BGM, the make up and costume team (real dhurandhar)...and the set designs uff the list of a listers of this film is never ending awesome!! You can watch it more than three times to simply appreciate different nuances each time. Banger!!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11062329/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006752",
              "author": {
                "username": {
                  "text": "imdbfan-7061093225"
                },
                "userId": "ur198933790"
              },
              "summary": {
                "originalText": "Power-Packed Performances in Every Scene"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This cinematic experience immerses viewers in a world of political intrigue and underworld danger. Ranveer Singh&#39;s performance is captivating, Sanjay Dutt&#39;s presence is commanding, and Akshaye Khanna and R Madhavan bring depth. Arjun Rampal&#39;s menace contrasts with Sara Arjun&#39;s poignant moments, highlighting stakes. Aditya Dhar&#39;s direction balances complex storytelling with thrilling action. Cinematography captures sprawling cityscapes and intimate exchanges, while the score punctuates tension and drama. The narrative escalates beautifully toward a climactic payoff that is both emotional and intense."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006752/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010155",
              "author": {
                "username": {
                  "text": "AnubhutiS-9"
                },
                "userId": "ur211564854"
              },
              "summary": {
                "originalText": "Finest movie of 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Surpassed expectation, its not your random masala movie\nif you like raw and real , go and watch it\nif you like sugarcoating , please avoid.<br/><br/>Movie having a class of actors with world class performance.<br/><br/>3.5 hours long and you will not feel once its long\nmovie keeps you at edge\nthe red screen scene is a must watch for every indian."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010155/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028218",
              "author": {
                "username": {
                  "text": "detectivebarbareek"
                },
                "userId": "ur190825520"
              },
              "summary": {
                "originalText": "Bangerrrr!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "First of all salute to all those unknown agents because of them only we are safe here at home. One have ever dreamt of such a movie made by Indian, story and entertainment both are covered very beautifully. Dhurandhar is nothing short of fantabulous-a gripping cinematic experience that leaves a lasting impression long after the credits roll. From its powerful opening sequence to its emotionally charged climax, the film maintains a tight grip on the audience, blending storytelling, performances, and technical brilliance with remarkable finesse.<br/><br/>The narrative of Dhurandhar stands out for its depth and conviction. It is not just a story; it is a statement-bold, intense, and thought-provoking. The screenplay is sharp and well-paced, ensuring that every scene contributes meaningfully to the overall arc. Moments of tension are balanced with emotional depth, making the journey engaging rather than overwhelming.<br/><br/>Performances are one of the film&#39;s strongest pillars. The lead actor delivers a commanding performance, embodying the spirit of &quot;Dhurandhar&quot; with raw intensity and nuanced emotions. Supporting characters are equally impactful, adding layers to the story instead of merely filling space. The dialogues are hard-hitting and memorable, often resonating with realism and power.<br/><br/>Visually, the movie is a treat. Cinematography enhances the mood of the film, whether it&#39;s portraying conflict, silence, or inner turmoil. The background score deserves special mention-it elevates key scenes without overpowering them, perfectly complementing the narrative flow.<br/><br/>What truly makes Dhurandhar fantabulous is its ability to connect with the audience on multiple levels-emotional, intellectual, and cinematic. It is a film that entertains while making you think, proving that strong content and commercial appeal can go hand in hand. Dhurandhar is a must-watch and a commendable addition to meaningful cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028218/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012815",
              "author": {
                "username": {
                  "text": "amritanshcityhunter"
                },
                "userId": "ur133126843"
              },
              "summary": {
                "originalText": "Amazing......."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I will just request everyone to watch this movie in theatres , one of the best movies I have watched in my entire life ....\nI am eagerly waiting for part 2 .<br/><br/>Dhurandhar stands out as one of the most compelling political crime dramas in recent years, blending gritty realism with sharp storytelling. The film dives deep into the underbelly of power, crime, and corruption, presenting a narrative that feels uncomfortably close to real life. What makes Dhurandhar truly engaging is its refusal to oversimplify-every character is layered, morally grey, and driven by believable motivations.<br/><br/>The direction is crisp, maintaining a tense pace without sacrificing depth. The screenplay cleverly intertwines multiple storylines, gradually revealing hidden connections that keep the viewer fully invested. The performances are a major highlight: the lead actors deliver intense, controlled portrayals that bring authenticity to each scene. The supporting cast, too, adds weight, especially in moments dealing with political manipulation and gangland dynamics.<br/><br/>Cinematography effectively captures the rawness of urban chaos, using shadows, tight frames, and atmospheric lighting to build a sense of constant unease. The background score amplifies this tone without ever becoming overwhelming.<br/><br/>Overall, Dhurandhar succeeds as both entertainment and commentary. It doesn&#39;t just tell a story-it forces viewers to reflect on the blurred boundaries between governance, crime, and ambition. A must-watch for fans of hard-hitting, intelligent cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012815/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012854",
              "author": {
                "username": {
                  "text": "thybhatta"
                },
                "userId": "ur55186701"
              },
              "summary": {
                "originalText": "One of the most well made bollywood films of recent times"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is the kind of that deserves the big screen, the grandeur, and the audience hooting along all add to the experience. While some far left critics have labelled them as &#39;pure propoganda&#39; which much like the film is an exaggeration of truth. Sure, the film is probably not a historical recount, but that aside it is an extemely well produced film.<br/><br/>The background music absolutely bangs, the performances feel real, and Akshay Khanna is going to stay with you long after the film ends. The story and the timelines are woven really well and the action is entertaining.<br/><br/>Where the film falters-and why it isn&#39;t a 10/10 for me- Some of the gore doesn&#39;t land because the VFX feels off, the bloodied faces look too animated and break the immersion. Sanjay Dutt&#39;s intro scene is a green screen shot, the kind that immediately pulls you out of the moment. The film could also have been tighter by at least 5-10 minutes, Ex- Ranveer&#39;s club entry could&#39;ve been straightforward instead of dragging through the &quot;no stags&quot; bit.<br/><br/>But the film deserves an unbiased watch for the sheer production scale. Jaao, you&#39;ll have fun."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012854/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006498",
              "author": {
                "username": {
                  "text": "soniya-77807"
                },
                "userId": "ur177212467"
              },
              "summary": {
                "originalText": "Action That Roars, Drama That Touches"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Each scene is meticulously crafted, slowly building a tension that culminates in explosive action. Ranveer Singh delivers a career-defining performance, blending physicality with quiet emotional depth. Dhar&#39;s direction ensures that the story never feels rushed, giving space for secondary characters to shine. The political and criminal undercurrents are woven seamlessly into the plot, while cinematography captures both grandeur and intimacy. The climax is powerful, leaving a lasting impression that lingers well beyond the runtime."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006498/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013509",
              "author": {
                "username": {
                  "text": "gchq-58427"
                },
                "userId": "ur81720134"
              },
              "summary": {
                "originalText": "Oustanding storyline, amazing performances, remains true and raw to its core."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is hands down the best espionage film ever made by Bollywood. The storyline is very gripping and maintains parallelism with the actual events. It does not try to spread any fake peace agenda or overly flashy movies that are commonly made by Bollywood (YRF is crying in the corner). The acting is top-notch, the soundtrack is bombastic, the action scenes are wonderfully choreographed, and the depiction of an actual spy is damn realistic. A must-watch film for everyone (except the weak-hearted or leftist people)."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013509/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006803",
              "author": {
                "username": {
                  "text": "icrkphqg"
                },
                "userId": "ur177078041"
              },
              "summary": {
                "originalText": "A Bold Tale of Battles and Bonds"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a cinematic powerhouse where every performance feels intentional and precise. The lead actor&#39;s portrayal is multi-layered, effortlessly navigating action, drama, and moral conflict. Supporting actors, even in brief roles, leave lasting impressions due to the director&#39;s careful guidance and casting choices."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006803/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11030106",
              "author": {
                "username": {
                  "text": "kashishnada-92389"
                },
                "userId": "ur172011974"
              },
              "summary": {
                "originalText": "It's a masterpiece, Indian Film Making has come a long way"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Wow, just wow. Dhurandhar is a complete masterpiece - Indian filmmaking has truly come a long way with this one. Aditya Dhar is hands down the best director working in Bollywood right now; he doesn&#39;t give up on that classic Indian style but elevates it to something world-class. This is pure entertainment, a thrilling ride with an incredible storyline that keeps you hooked from start to finish. I&#39;m not here to judge anyone or anything - it&#39;s just a fantastically engaging movie that delivers non-stop tension and excitement.<br/><br/>The acting is great across the board. Ranveer Singh is phenomenal, totally immersed in his character, and the supporting cast - Akshaye Khanna, R. Madhavan, Arjun Rampal, Sanjay Dutt - everyone brings their A-game. Sanjay Dutt&#39;s entry is pure fire - that massy, over-the-top moment with the upbeat track, raining bullets, and all that swagger as he takes on the gangsters. And trivia: it&#39;s straight-up mature Bollywood cinema in 2025, embracing that heroic, larger-than-life vibe we love, especially in a gritty underworld setup involving arms trafficking and high-stakes ops. Lol, it had the theater erupting!<br/><br/>Character development is spot on; you really feel for these people as the story unfolds. The background music is killer, building the atmosphere perfectly.<br/><br/>Cinematography is stunning - those gritty shots of the underworld pull you right in. (Spoiler ahead, skip if you haven&#39;t seen it) One sequence where Ranveer&#39;s character sees the ghost of Akshaye Khanna&#39;s character is straight out of a Julius Caesar reference, with that Shakespearean betrayal vibe - it&#39;s haunting and brilliantly done.<br/><br/>It&#39;s a slow burn that reminds me a lot of The Departed, with all the infiltration, betrayals, and moral gray areas. I don&#39;t know how historically accurate the representation of the Baloch people is, but I really liked how it was portrayed - felt authentic and added depth.<br/><br/>Sure, there&#39;s a bit of bias towards India, but come on, it&#39;s made for a mass audience here, and at its core, it&#39;s about national identity and pride - religion aside, it&#39;s just a solid thriller. The movie shows both sides too, even the failures and complexities on the Indian side, which makes it more balanced than you might expect.<br/><br/>I usually don&#39;t watch much Bollywood these days, but this one? It&#39;s going to be a cult classic, right up there with Devdas and Gangs of Wasseypur. The level of ambition, execution, and sheer guts is unmatched.<br/><br/>I really hope Aditya Dhar stays original in the second part and doesn&#39;t get swayed by critics or the success - keep it as raw and authentic as this one.<br/><br/>One suggestion: it should be dubbed properly in other languages (they can even use AI now for better quality), so international audiences can enjoy it too. But honestly, watch it in the original Hindi with subtitles - that&#39;s the best way to experience the dialogues and performances.<br/><br/>If you love intense spy thrillers, go see this in theaters. You won&#39;t regret it! Can&#39;t wait for Part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11030106/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013044",
              "author": {
                "username": {
                  "text": "ShreyashD-71"
                },
                "userId": "ur211587641"
              },
              "summary": {
                "originalText": "Grounded Brilliance"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What an amazing movie, All the characters nailed it, the action, the acting, the thrill, and specially the reality each and every thing in this movie is worth watching.<br/><br/>Real footage of 26/11 and conversation of attack handlers is shown, the truth is shown and we should watch the truth, the journey and sacrifice of an Indian."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013044/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019935",
              "author": {
                "username": {
                  "text": "gbittu"
                },
                "userId": "ur50867190"
              },
              "summary": {
                "originalText": "Astounding performance"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Amazing work by Aditya Dhar but kudos to Danish Pandor and Arjun Rampal. The seasoned stars get too much praise as they get to work in many movies and of course they will do good but these two really were natural in their roles. In whatever scenes they appeared I wanted to see how they were acting and in every scene they really amazed me."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019935/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010694",
              "author": {
                "username": {
                  "text": "raghukamath"
                },
                "userId": "ur150581451"
              },
              "summary": {
                "originalText": "Excellent movie depicting true nature spy world"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After all those spy movies depecting Indian and Pakistani spy agents dancing together and spreading the message of So called Bahichara, finally one guy has shown the courage to highlight the true work of Indian spies and the work they put in to protect the country. Hats off. And to those bollywood reviewers one word get lost."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010694/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}