{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6dbbntazcwzy472thvnzwrhu4mab22iotx6xoald6mqbdf4skydk3o4yf5mjyoal3wa3eugs2qk22rwkgazrnkb7q",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11010696",
              "author": {
                "username": {
                  "text": "gklolge"
                },
                "userId": "ur62707456"
              },
              "summary": {
                "originalText": "Dhurandhar isn't just a film it's a reminder of how a spy thriller should be made: raw, fearless, and unapologetically real."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar isn&#39;t just a film; it&#39;s a reminder of how a spy thriller should be made: raw, fearless, and unapologetically real. It strips away the glamour often attached to espionage and replaces it with authenticity, danger, and emotional truth. The narrative is intense, grounded in real-world intelligence operations, and crafted with a seriousness that demands attention. Only the patriotic have the guts to watch a film this honest, this brutal, and this close to reality.<br/><br/>The screenplay is crisp, layered, and constantly building. Every scene serves a purpose, whether adding psychological depth, advancing intelligence strategy, or sharpening the tension in the ongoing conflict. The realism of the storytelling keeps viewers alert, and there isn&#39;t a single dull beat.<br/><br/>Ranveer Singh delivers a career-defining performance: controlled, silent, and deeply internal. His character feels lived-in, shaped by sacrifice and national duty. Akshaye Khanna&#39;s cold precision, Sanjay Dutt&#39;s commanding grit, R. Madhavan&#39;s gravitas, Arjun Rampal&#39;s brooding presence, and Sara Arjun&#39;s emotional depth form a cast with no weak links. Each character is written with purpose and performed with conviction.<br/><br/>Technically, the film excels. The raw soundscape, minimalistic score, and grounded action sequences immerse the audience in a world that feels disturbingly close to real. The red-screen sequence paired with chilling intercepted audio remains one of the film&#39;s most haunting moments a reminder of the cost of freedom and the unseen war fought in the shadows.<br/><br/>Verdict:\nDhurandhar is gripping, intense, and emotionally heavy not a comfort-watch, but a necessary one. It is edge-of-the-seat cinema with a conscience, crafted for viewers who understand the weight of patriotism, sacrifice, and truth. With its bold ending, the wait for March 2026 already feels long."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010696/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018549",
              "author": {
                "username": {
                  "text": "MotheA-1"
                },
                "userId": "ur211628749"
              },
              "summary": {
                "originalText": "engagement blast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The most interesting point for me was in a time where the attention span is at a all time low aditya dhar managed to keep the audience all on their edges of their seat for 3 and half hours i think this show his dedivation in this art form and how he is a great narrator. Another point if i may add is that i like ranveer&#39;s acting despite his pr problems which i believe affected the films sale in the start but i think the art was not unnoticed and is now getting the clout it deserves."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018549/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011474",
              "author": {
                "username": {
                  "text": "imdbfan-43050"
                },
                "userId": "ur200152296"
              },
              "summary": {
                "originalText": "Dhurandhar: A Gutsy, Unflinching Epic that Dares to Speak the Truth!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar: A Gutsy, Unflinching Epic that Dares to Speak the truth\nDhurandhar is more than just a spy thriller; it&#39;s a monumental, adrenaline-soaked epic that pulls absolutely no punches. Director Aditya Dhar proves he has the courage and vision to tackle India&#39;s most complex security challenges with unflinching honesty and breathtaking scale.<br/><br/>The film is set against the backdrop of real geopolitical conflicts and the dark underbelly of covert operations, primarily in the terror-infested zones of Karachi. What sets this movie apart is its sheer audacity. Dhar doesn&#39;t shy away from the truth, taking a definitive, ballsy stance by explicitly calling out Pakistan for its state-sponsored terror bases and the nexus between its intelligence agencies, crime syndicates, and fundamentalist groups. This level of clarity in a mainstream film is both rare and incredibly powerful.<br/><br/>From the heart-stopping re-creation of the Kandahar hijacking to the infiltration of Karachi&#39;s crime world, the narrative is taut, dense, and relentlessly gripping. Every action sequence is grounded, brutal, and brilliantly choreographed, giving you goosebumps.<br/><br/>The performances are stellar across the board, particularly the leads who fully embody the grit and complexity of their roles. They bring a grounded patriotism that feels earned, not shouted.<br/><br/>Yes, the film is long, but not a single frame is wasted in building this high-stakes, realistic world. This is essential cinema-a necessary, must-watch experience that will stay with you long after the credits roll. Aditya Dhar has delivered a definitive statement and an unforgettable cinematic triumph."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011474/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006495",
              "author": {
                "username": {
                  "text": "avinashshrma"
                },
                "userId": "ur181063021"
              },
              "summary": {
                "originalText": "Superstar-Led Action Adventure"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene is packed with intention, from strategic confrontations to explosive action. Ranveer Singh balances subtle emotion with high-octane intensity, Sanjay Dutt brings commanding menace, and Akshaye Khanna and R Madhavan provide narrative depth. Arjun Rampal&#39;s quiet threat keeps tension taut, while Sara Arjun grounds the story emotionally. Aditya Dhar&#39;s direction ensures action, suspense, and character arcs are seamless. Cinematography emphasizes scope and intimacy, and the score accentuates suspense. The finale delivers a thrilling, emotional, and unforgettable experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006495/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002905",
              "author": {
                "username": {
                  "text": "Ritwik07"
                },
                "userId": "ur211525408"
              },
              "summary": {
                "originalText": "Aatish Kapoor deserves a Filmfare Award"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is an Akshaye Khanna movie, he is literally the soul, every frame he is a part of, was breathtaking. Followed by the effortless charisma of Arjun Rampal, great screen presence, even with very less screen time, it seemed like he&#39;d have a much bigger role in the sequel.<br/><br/>Ranveer was good, I would surely applaud his efforts to build his physique for this role.<br/><br/>Baba and Madhavan as usual didn&#39;t disappoint. The movie was surely worth the hype overall, the climax was not as satisfying as expected. But from an entertainment point of view, it was a great watch."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002905/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022064",
              "author": {
                "username": {
                  "text": "adityaa-30422"
                },
                "userId": "ur131301283"
              },
              "summary": {
                "originalText": "Awesome movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Fantabulous movies with awesome screenplay, a message to our nation by aditya dhar that all the spies and secret service agents are serving their whole life for us and how some internal enemies supporting the enemies of our country....any person who love india is gonna love the movie ... action acting and emotions packed movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022064/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015501",
              "author": {
                "username": {
                  "text": "palakgujral"
                },
                "userId": "ur50022354"
              },
              "summary": {
                "originalText": "A master piece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar made an amazing movie. Loved it so muchthat i might go and see it again in theater. Gripping screenplay, great performances. Ranveer proved he is an amazing actor. Everybody did amazing work. It is going to be so difficult for film industry to match this level of cinema. Can&#39;t wait for the 2nd part."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015501/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010868",
              "author": {
                "username": {
                  "text": "Rushi-52"
                },
                "userId": "ur211570420"
              },
              "summary": {
                "originalText": "Classic and real with magnificent acting"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhan is a compelling blend of mass entertainment and smart storytelling-a film that understands exactly what its audience wants and delivers it with confidence, style, and surprising emotional depth.<br/><br/>Story &amp; Screenplay<br/><br/>The narrative follows a familiar yet engaging trajectory: a larger-than-life protagonist caught in a web of rivalry, loyalty, and hidden truths. What makes Dhurandhan stand out, however, is the sharp writing. The screenplay keeps the momentum alive with clever twists, well-timed humor, and moments that punch straight to the heart. The pacing rarely dips, and every scene feels crafted with purpose.<br/><br/>Performances<br/><br/>The lead actor, in particular, commands the screen from the very first frame. His charisma, dialogue delivery, and emotional range elevate the film significantly. The supporting cast is equally impressive-each character has weight, giving the story richness and dimension. The antagonist, especially, is memorable, adding real tension and intensity to the narrative.<br/><br/>Direction &amp; Technical Brilliance<br/><br/>The director brings a strong vision to the film, balancing high-voltage action with grounded emotional arcs. The cinematography deserves special mention: dynamic camera work, thoughtfully framed shots, and visually stunning action sequences make Dhurandhan a treat to watch.<br/><br/>The music and background score amplify the drama beautifully-songs complement the story rather than interrupt it, and the BGM enhances every high-stakes moment.<br/><br/>Action<br/><br/>If you&#39;re a fan of mass-appeal action sequences, Dhurandhan will not disappoint. The choreography is slick, impactful, and perfectly in sync with the hero&#39;s persona. Each fight sequence feels earned, not overdone.<br/><br/>Emotional Core<br/><br/>Beneath its action-packed exterior, Dhurandhan has a surprisingly heartfelt core. Themes of family, friendship, and personal responsibility give the film depth, making audiences care about the characters beyond the thrills.<br/><br/>Verdict: A Powerful, Massy, and Emotionally Satisfying Watch<br/><br/>Dhurandhan fires on all cylinders-action, drama, emotion, music, performances, and style. It&#39;s a film that entertains thoroughly while offering more substance than one might expect. Whether you&#39;re in it for the adrenaline or the emotion, Dhurandhan delivers a memorable cinematic experience.<br/><br/>Highly recommended for fans of engaging storytelling and strong mass-appeal cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010868/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027016",
              "author": {
                "username": {
                  "text": "Ahnafsaw"
                },
                "userId": "ur211694774"
              },
              "summary": {
                "originalText": "All time Blockbuster"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is truly a cinematic masterpiece, starting from the camera work to the lighting and edits. The plot was very strong but what made it work was the amazing casting. Each character had it&#39;s own unique input to the scenes and not one scene makes you feel lost or uninterested. Although the film is based and made on controversial and has a propagandists vibe to the messages as it is claimed to be based on true events, but it can truly be enjoyed as a fiction and unbiased opinions.<br/><br/>Bonus points: Akshaye Khanna being a very strong character and kept audiences hooked from the first scene.<br/><br/>Ranveer Singh has proved himself once again as why he will be the next best legend of Bollywood.<br/><br/>Overall a must watch and will be watching this once released online as well."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027016/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023718",
              "author": {
                "username": {
                  "text": "andsekhar"
                },
                "userId": "ur53405904"
              },
              "summary": {
                "originalText": "A Knocker out of the park"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Brilliant in every aspect. A powerful narrative depicting absolute truth which cannot be denied. Outstanding performances by each and every actor, brilliant screenplay with every dialogue delves deep in to your mind. High Octane absolute madness spy action thriller, a must watch and not be missed movie... 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023718/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009269",
              "author": {
                "username": {
                  "text": "ankit-oza"
                },
                "userId": "ur27562503"
              },
              "summary": {
                "originalText": "Amazing power pack movie!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Loved ever minute of this movie. Background score along with high octane sequences makes it a true theratical experience. Every character is a king in his frame.<br/><br/>You must go and experience in theater. The acting, costume, makeup, diaglogs, music, background, sets and ofcourse the direction is simply mindblowing. All the credit goes to Aditya for bringing us back to theater."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009269/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007126",
              "author": {
                "username": {
                  "text": "taraksoni"
                },
                "userId": "ur115070127"
              },
              "summary": {
                "originalText": "Power-Packed Performances in Every Scene"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene is meticulously crafted, balancing suspense, emotion, and intense action. Ranveer Singh dominates with a nuanced performance, conveying moral ambiguity, inner conflict, and sheer determination. Sanjay Dutt&#39;s authoritative presence amplifies tension, while Akshaye Khanna and R Madhavan provide intelligence and subtlety in their performances. Arjun Rampal&#39;s quiet menace keeps audiences on edge, and Sara Arjun&#39;s emotional moments heighten stakes. Aditya Dhar blends narrative strategy, suspense, and visually stunning action seamlessly. Cinematography captures both sprawling chaos and intimate emotional beats, and the score punctuates every tense moment. The climax delivers breathtaking action and emotional payoff."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007126/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11078894",
              "author": {
                "username": {
                  "text": "rd00007"
                },
                "userId": "ur181508894"
              },
              "summary": {
                "originalText": "Amazing movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Today watched the movie for second time. Found it as engrossing as the first time I watched,even though it was a three hour thirty minutes movie.loved everything about the movie.dirsction fantastic.editing wonderful.background score superb. Each and every actor acted their part superbly. Loud applause for each one of them."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-31",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11078894/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018780",
              "author": {
                "username": {
                  "text": "uditanshu-68405"
                },
                "userId": "ur188233978"
              },
              "summary": {
                "originalText": "Literally Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar Breathing is a surprisingly captivating film that blends emotional depth with a steady, confident narrative style. The movie works because it doesn&#39;t rush-each scene feels intentional, allowing the characters and their struggles to breathe naturally. The performances are grounded and sincere, giving the story a quiet power that stays with you.<br/><br/>What&#39;s most admirable is how the film balances suspense and tenderness without losing its focus. It&#39;s not loud or flashy, but it&#39;s incredibly effective in the way it builds atmosphere and emotional connection. Overall, Dhurandhar Breathing is a thoughtful, well-crafted movie that earns appreciation through its subtlety and heart."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018780/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015837",
              "author": {
                "username": {
                  "text": "PrafullG-10"
                },
                "userId": "ur211606221"
              },
              "summary": {
                "originalText": "Badass"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar roars onto the screen like a full-power mass explosion, delivering one of the most electrifying cinematic experiences of recent times. From the first frame, the film grips you with its unstoppable energy, larger-than-life visuals, and hero elevations that hit harder than thunder. The storytelling moves at a lightning pace, mixing emotion, action, mystery, and style with absolute perfection.<br/><br/>The lead performance is a total firestorm-charisma, attitude, and screen presence at their peak. Every punch, dialogue, and slow-motion moment lands with mass impact. The music and background score amplify every scene, turning even simple moments into goosebump bombs.<br/><br/>The direction is fearless, the action sequences are mind-blowing, and the climax is pure madness-designed to make the theatre erupt. Dhurandhar isn&#39;t just a film; it&#39;s a festival, a celebration of mass cinema, and a record-breaking blockbuster in the making.<br/><br/>A full-fledged all-time blockbuster that sets the screen on fire. 🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015837/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014857",
              "author": {
                "username": {
                  "text": "ChintanK-9"
                },
                "userId": "ur211600784"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Fabulous movie. Real to reality...\nRecommending to watch.<br/><br/>Dhurandhar is a gripping and well-crafted thriller that stands out for its tight screenplay and confident storytelling. The film wastes no time in building tension, and right from the opening sequence, it pulls you into a world where motives are layered and nothing is as simple as it appears."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014857/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022786",
              "author": {
                "username": {
                  "text": "KAman-6"
                },
                "userId": "ur211662709"
              },
              "summary": {
                "originalText": "Bgm is superb"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Screen presence of each and every character is fantastic.<br/><br/>Evryone should watch this movie once with family or with anyone bcz this movie gives u the real feelings that how a spy goes to other country and how do they adopt their selves... The performance of Ranveer is fantastic yaar and Akshay Khanna too plus rakesh bedi and Arjun rampal is for Short period but well enough..and sanju baba whoa."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022786/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010758",
              "author": {
                "username": {
                  "text": "karansngh-32696"
                },
                "userId": "ur167947140"
              },
              "summary": {
                "originalText": "Best Bollywood Espionage movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar has aced it literally he&#39;s not a nepo kid but a talented one the detailing &amp; Script is so mind boggling Dhurandhar is a well made, engaging, and powerful film. With strong acting from Akshaye Khanna, Sanjay Dutt, Arjun Rampal, and an excellent performance by Ranveer Singh, it becomes a movie worth watching for anyone who enjoys intense and meaningful cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010758/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009274",
              "author": {
                "username": {
                  "text": "abhinavsinghbasti"
                },
                "userId": "ur112432832"
              },
              "summary": {
                "originalText": "Unexpected"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Cant believe bollywood can make such movies just wow All Credit goes to Dhar Sir<br/><br/>Uri Kashmir Files Baramulla Tanha Ji\nAkshay Khanna is like old wine hehe\nRanveer Singh is energatic\nStory Writing is engaging\nBGM is top notch\n26/11 scene was hard to watch\nwe have make such movies for new generation genZ<br/><br/>waiting for next part 😊"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009274/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006452",
              "author": {
                "username": {
                  "text": "gandhinikita-56415"
                },
                "userId": "ur123188658"
              },
              "summary": {
                "originalText": "High-Energy Drama with Top Stars"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story gradually immerses the audience in a labyrinth of crime, politics, and personal dilemmas. Ranveer Singh&#39;s performance is layered and compelling, conveying vulnerability, determination, and moral ambiguity in almost every frame. Sanjay Dutt embodies a seasoned, commanding presence, his subtle menace palpable even in quiet scenes. Akshaye Khanna and R Madhavan provide cerebral performances, their timing and dialogue delivering depth and texture. Arjun Rampal&#39;s intensity is understated yet omnipresent, while Sara Arjun&#39;s heartfelt portrayals add emotional grounding to the story&#39;s stakes. Aditya Dhar&#39;s direction seamlessly integrates slow-building suspense with bursts of high-octane action. Cinematography captures both the chaos of the city streets and the stillness of intimate confrontations, while the score punctuates tension and heightens drama. The narrative&#39;s escalation in the second half leads to jaw-dropping revelations and action sequences, culminating in a climax that delivers both adrenaline-fueled excitement and profound emotional resonance."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006452/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022718",
              "author": {
                "username": {
                  "text": "pardeepsha"
                },
                "userId": "ur110763738"
              },
              "summary": {
                "originalText": "Original story and well directed"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Sound is good story is good visuals are good and acting is good Powerful performances, intense storytelling, and a strong emotional core make it stand out. The direction keeps the pace tight, the dialogues feel raw and real, and the background sco elevates every crucial moment. A must-watch for anyone who appreciates meaningful cinema done right."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022718/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11061011",
              "author": {
                "username": {
                  "text": "SubhasishT-5"
                },
                "userId": "ur211958675"
              },
              "summary": {
                "originalText": "Good Movie and Entertaining"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched the movie for nearly 3.5 hours and honestly didn&#39;t realize how the time passed. That, for me, says a lot about how engaging it was. The film keeps you involved from start to finish and never feels tiring despite its long runtime.<br/><br/>Overall, I found it to be a good entertainer. It holds attention well and makes for a satisfying watch purely from a movie and entertainment perspective. I enjoyed the experience and felt the time spent was well worth it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11061011/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023997",
              "author": {
                "username": {
                  "text": "arocks-79442"
                },
                "userId": "ur166576122"
              },
              "summary": {
                "originalText": "Masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I don&#39;t know how much creative liberty the writter-director Aditya Dhar has taken in presenting this movie inspired from real events but it has been perfectly made from beginning till end.<br/><br/>Very realistic gripping thriller. I am sure it&#39;s upcoming part will break the record at box office just like this movie."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023997/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11045809",
              "author": {
                "username": {
                  "text": "schaudhrymd"
                },
                "userId": "ur151309732"
              },
              "summary": {
                "originalText": "A fantastic movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A movie based on facts. A movie that does not insult intelligence of Indians. A movie that has great stars who performed very well. A movie that has good background music. A movie with excellent direction by Aditya Dhar. A movie that needs to be watched by all Indians who are patriotic. It&#39;s a shame that Bollywood does not produce more realistic spy movies like this."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11045809/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007137",
              "author": {
                "username": {
                  "text": "ShubhamP-53"
                },
                "userId": "ur203912738"
              },
              "summary": {
                "originalText": "A cinematic battlefield of feelings and fury"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watching Dhurandhar felt like being on the edge of your seat for 3 hours. Ranveer Singh is the heart of the film, performing with full energy and emotion. Sanjay Dutt, Akshaye Khanna, and R Madhavan all shine in their roles, giving the story great depth. Arjun Rampal&#39;s intense action and Sara Arjun&#39;s emotional scenes make the film even better. Aditya Dhar&#39;s direction ensures that the complex story never feels confusing, balancing action, drama, and humor beautifully. The movie is engaging from start to finish, making it a must-watch for all cinema lovers."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007137/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}