{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6bcjltazcwzy472xhrmjtqpt4maj63umdx7xpataomqbdf4skydk2oqyfjmbyocberilzgrrzcmeg7hirjaou6cna",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11099062",
              "author": {
                "username": {
                  "text": "upinderswork"
                },
                "userId": "ur111050048"
              },
              "summary": {
                "originalText": "Cinematic Trauma"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I regret watching Dhurandar. The film is an unbearable stretch of narrative. The plot is nonsensical. A spy agent enters Pakistan, becomes instantly famous and persuades a politician to marry his daughter. This is implausible. The story lacks realism and logic. The screenplay, editing and writing are tedious and unengaging. The plot attempts to be a &quot;mass patriotic thriller&quot; but ultimately resembles low-quality fiction. The only saving grace is Akshaye Khanna, who attempts to salvage the film. Without him, the movie would collapse within the first 30 minutes.<br/><br/>Final Verdict: If you value your time, money and mental well-being, do not watch this film. It is not entertainment; it is cinematic trauma."
                }
              },
              "authorRating": 1,
              "submissionDate": "2026-01-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11099062/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11060046",
              "author": {
                "username": {
                  "text": "aaaayush"
                },
                "userId": "ur115359686"
              },
              "summary": {
                "originalText": "Just watched Durandhar and wow."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What I loved most was how it feels rooted in real life but cinematic at its core, sharp performances, raw world building, and moments that hit like they weren&#39;t just scripted but felt. The way it weaves in true-inspired events and even real footage makes it linger in your head long after. Ranveer and Akshaye absolutely bring it, this isn&#39;t just action, it&#39;s an experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11060046/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012523",
              "author": {
                "username": {
                  "text": "raj-88222"
                },
                "userId": "ur150816737"
              },
              "summary": {
                "originalText": "Best of best cast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The efforts and the hard work the actors have given is topknot\nAnd the director did the best job.<br/><br/>The exact same incident was copied by the director and hats off to him.<br/><br/>The song and bgm is the best, and for sure you will get goosebumps while watching the movie.<br/><br/>And you can relate if you were there in that situation."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012523/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007125",
              "author": {
                "username": {
                  "text": "BrijeshG-53"
                },
                "userId": "ur203911257"
              },
              "summary": {
                "originalText": "A fierce narrative wrapped in blazing action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a mix of action, emotion, and drama done perfectly. Ranveer Singh dominates the screen with his incredible energy and acting skills. Sanjay Dutt&#39;s presence is powerful, while Akshaye Khanna and R Madhavan add intelligence and depth. Arjun Rampal&#39;s action sequences are thrilling, and Sara Arjun brings innocence and emotion. Aditya Dhar&#39;s direction makes the long movie feel smooth and engaging. The storytelling, fight scenes, and music are perfectly timed. It&#39;s a full entertainment package that keeps you hooked from start to finish."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007125/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003687",
              "author": {
                "username": {
                  "text": "shwetaketu"
                },
                "userId": "ur60230986"
              },
              "summary": {
                "originalText": "Highly engaging and immersive"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best Bollywood films in a very long time. The intricacy of the internal dynamics and world building crafted against the backdrop of conflict, gang wars and terrorism fueled political landscape of 2000&#39;s Karachi is just as impeccable as the acting and sound design of the film. Definitely a theatre experience!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003687/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015992",
              "author": {
                "username": {
                  "text": "AfrhanH"
                },
                "userId": "ur211606105"
              },
              "summary": {
                "originalText": "Best spy film in bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I have never watched such a great spy film before . The film is very engaging and makes you connect with every character. The aura of Rehman Dakait is over the top . Excellent performance by Akshay Khanna. It archived almost 95 percent of perfection, some things can be improved. Go and watch this film in theaters."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015992/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002297",
              "author": {
                "username": {
                  "text": "Aaryankumar006"
                },
                "userId": "ur136228329"
              },
              "summary": {
                "originalText": "Dhurandhar (ragefilled filmmaking used at it's best)"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar Part 1 is an raw and gritty action thriller and it is awesome.<br/><br/>Dhurandhar wastes no time of it&#39;s huge 214 minutes runtime which feels like 120 minutes, I mean seriously the length of this film was never an issue for me it was paced perfectly- no scene or sequence felt out of place unnecessary or boring. Dhurandhar also uses practical locations largely and to it&#39;s huge advantage and it also adds to the gritty and raw nature of this film- you cannot pinpoint and say that this looks fake because it isn&#39;t.<br/><br/>Dhurandhar is also an multistarer and seriously each and every cast member was a standout Ranveer Singh was so great and seeing him on big screen you realize how much we missed him Akshay Khanna and Arjun Rampal were bloody brilliant they both looked and felt so convincing on screen, R. Madavan and Sanjay Dutt might have less screentime but they undoubtedly left an strong mark on screen and on us.<br/><br/>Dhurandhar also uses the A rating to it&#39;s advantage and it is more unfiltered and raw with it&#39;s dialogues than any other mainstream hindi film since- Udta Punjab.<br/><br/>The editing pattern in the starting portion of the film felt very distracting especially those cut to black screen for transitions the next chapters at start it more feels like an highlight rather than cohesive chapter, leaving this aside i had a blast watching Dhurandhar and cannot wait for the next chapters (part 2)."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002297/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004169",
              "author": {
                "username": {
                  "text": "Aaryankumar006"
                },
                "userId": "ur136228329"
              },
              "summary": {
                "originalText": "Dhurandhar (ragefilled filmmaking used at it's best)"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This was legitimately The hindi film of the year, Dhurandhar is the second film of Aditya Dhar whose last (first) film Uri: The surgical strike literally changed the landscape of Hindi cinema and Dhurandhar coming almost after 6 years of his first feature clearly tells you how much of rage was filled within him to make this film and after witnessing Dhurandhar on the big screen it is clearly evident.<br/><br/>Dhurandhar Part 1 is an raw and gritty action thriller and it is awesome.<br/><br/>Dhurandhar wastes no time of it&#39;s huge 214 minutes runtime which feels like 120 minutes, I mean seriously the length of this film was never an issue for me it was paced perfectly- no scene or sequence felt out of place unnessary or boring. Dhurandhar also uses practical locations largely and to it&#39;s huge advantage and it also adds to the gritty and raw nature of this film- you cannot pinpoint and say that this looks fake because it isn&#39;t.<br/><br/>Dhurandhar is also an multistarer and seriously each and every cast member was a standout Ranveer Singh was so great and seeing him on big screen you realise how much we missed him Akshay Khanna and Arjun Rampal were bloody brilliant they both looked and felt so convincing on screen, R. Madavan and Sanjay Dutt might have less screentime but they undoubtedly left an strong mark on screen and on us.<br/><br/>Dhurandhar also uses the A rating to it&#39;s advantage and it is more unfiltered and raw with it&#39;s dialogues than any other mainstream hindi film since- Udta Punjab.<br/><br/>The editing pattern in the starting portion of the film felt very distracting especially those cut to black screen for transitions the next chapters at start it more feels like an highlight rather than cohesive chapter, leaving this aside i had a blast watching Dhurandhar and cannot wait for the next chapters (part 2)."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004169/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014290",
              "author": {
                "username": {
                  "text": "Varunp-91"
                },
                "userId": "ur211595892"
              },
              "summary": {
                "originalText": "BANGER!!! 💥💥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If you are not watching this, You are biggest fool on the planet Casting top notch, Acting Top notch, Direction Top notch, Story Top notch. I saw some movies like pushpa 2 and animal which are more than 3 Hours and make me feel bored at a time but honestly speaking after watching this 3.5 hr dhurandar movie which is actually a 1st part of this movie only, I can&#39;t wait to watch the 2nd part and I feel so much connected that I can see 1st and 2nd part in a one go as well. Simple the best movie of 2025..Even step ahead of kantara and Chaava for me."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014290/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11074791",
              "author": {
                "username": {
                  "text": "harshivkansara"
                },
                "userId": "ur131454008"
              },
              "summary": {
                "originalText": "A Mass Entertainment Masterpiece🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The core of the movie being so mesmerizing is it&#39;s editing and use of sound and music. The cinematography is what will attract gen z and millennium audience as it is not like a typical south action movie or a movie shot in 90s style. It never feels cheap. Leave the whole &quot;inspired by true events&quot; controversy. This movie has a story and is meant to stay with audience after they leave the cinema hall. The ending shot with Sonu Nigam&#39;s verse was straight up fire🔥 This is the power of perfect editing and cinematography... it&#39;s supposed to sync with the situation of scene. Same with the beginning shot and sequence of the film. Only Aditya Dhar could&#39;ve pulled this off, just like Uri. He truly knows how to make his actors work. Ranveer singh, Akshay khanna, R. Madhavan, Arjun Rampal and every single actor in this film killed it 🔥🗿. Felt really good to see that some people in bollywood know the importance of editing, acting, cinematography and perfect use of music in a mass entertainment film. Take notes, Rohit shetty, Sidharth Anand, Neeraj pandey and every single south movie makers... this is how you end a commercial movie, straight up fire. Race to see this in cinemas cuz we don&#39;t get movies like this anymore! Jai Hind🔥"
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-30",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11074791/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013538",
              "author": {
                "username": {
                  "text": "Sujal-58"
                },
                "userId": "ur211589962"
              },
              "summary": {
                "originalText": "for all the haters and criticizers especially youtubers"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Trailer dekh k faltu ka gyaan na Pele wese hi aaditya dhar ne kya kamaal ka movie bnaya hai 8 saal me pehli baar ye movie dekhne k liye first day first show ka ticket woh bhi book kar k Liya hai<br/><br/>you may have liked kgf 2 because it had a different story and had gone to theater but how may of you have watched kgf 1 in theaters. Just bcoz you have watched in TV bcoz kgf 1 gets broadcasting multiple times even in YouTube but have you noticed why kgf 2 was not even released in YouTube?<br/><br/>After that every movie comes with same story<br/><br/>but dhurandhar is a pure vibe with a different mirch masala. Even the character is so goated that you gonna love with this.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013538/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006392",
              "author": {
                "username": {
                  "text": "janvi-26160"
                },
                "userId": "ur188287762"
              },
              "summary": {
                "originalText": "Action That Thrills, Drama That Resonates"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening sequence, the film demands attention with a blend of suspense and intricate plotting. The lead actor delivers a career-defining performance, balancing physical intensity with deep emotional nuance. Action scenes feel organic, often emerging from character decisions rather than pure spectacle, which gives every confrontation added weight. Cinematic visuals are breathtaking, capturing sprawling environments alongside intimate human moments. The score punctuates tension and relief with seamless precision. Each supporting character is given meaningful arcs, adding depth and authenticity. Political and criminal elements are portrayed with a realism that grounds the story, making the stakes feel immediate and dangerous. By the time the climax arrives, every emotional beat lands, making it both thrilling and unforgettable."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006392/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024334",
              "author": {
                "username": {
                  "text": "issolanki-48421"
                },
                "userId": "ur181989653"
              },
              "summary": {
                "originalText": "Best action movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just a movie, it&#39;s an experience. If you enjoy serious spy dramas, intense storytelling, and strong acting, this film is worth watching.<br/><br/>Dhurandhar is a powerful, intense, and ambitious spy-thriller that leaves a strong impact. The film stands out mainly because of its strong performances, gripping subject, and grand scale.<br/><br/>Ranveer Singh delivers one of his most intense performances, completely owning the role with raw emotion and screen presence. Supporting actors like Akshaye Khanna, R. Madhavan, and Sanjay Dutt add depth and seriousness to the narrative.<br/><br/>The story dives deep into espionage, patriotism, and the darker side of intelligence operations. While the second half is gripping and emotionally heavy, the first half feels a bit stretched, mainly due to the long runtime. However, once the film picks up pace, it keeps you engaged till the end.<br/><br/>The background score, cinematography, and action sequences elevate the cinematic experience, especially on the big screen. Some scenes are disturbing and intense, so this movie may not be for everyone."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024334/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11048603",
              "author": {
                "username": {
                  "text": "PreetiK-356"
                },
                "userId": "ur211873710"
              },
              "summary": {
                "originalText": "REALITY"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Worth watching 3 or more times, going again for the 2nd time. This is history, its important to know about it. India faced a lot of events like these. I hope people around the world can see what india was going through and is going through. I hope they o stop supporting paid youtubers to believe bull*** and just see the events themselves and decide weather these events and people who did it were good or bad. Use your own brain since you got one of your own."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11048603/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015726",
              "author": {
                "username": {
                  "text": "nishukumar-03400"
                },
                "userId": "ur179306378"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands out as a gripping drama that blends strong performances, tight storytelling, and striking visuals into a powerful cinematic experience. The film revolves around a central character whose journey is filled with conflict, moral dilemmas, and emotional depth, and the narrative does a great job of pulling the audience into his world. What makes Dhurandhar truly engaging is the way it balances intensity with quieter, reflective moments, allowing the story to breathe while keeping viewers hooked."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015726/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010587",
              "author": {
                "username": {
                  "text": "alhadparab"
                },
                "userId": "ur86245233"
              },
              "summary": {
                "originalText": "Reality never looked so real!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "3 hrs and 32 mins of pure brilliance. Not a single dull moment! With mind-blowing performances by the entire cast, intense action, and hard-hitting dialogues, Aditya Dhar made sure that Bollywood ends the year on high. The sets and locations are so spot-on, they transport you across borders. BGM showcasing different styles of music combined with rap is the soul of the movie, kicks in just at the right time to enhance each scene&#39;s essence. #dhurandhar is a spy-thriller based on true events is an absolute #mustwatch #masterpiece for every Indian!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010587/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018316",
              "author": {
                "username": {
                  "text": "SurajK-1992"
                },
                "userId": "ur211625693"
              },
              "summary": {
                "originalText": "Excellent 👌👌"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Just watched Dhurandar and absolutely loved it! 🔥🔥\nA complete entertainer with powerful action, hilarious moments, and strong emotional scenes. The hero&#39;s performance is top-notch, the direction is sharp, and the BG music gives goosebumps. This movie never bores you for a minute. A must-watch for mass-movie lovers! ⭐⭐⭐⭐⭐&quot;"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018316/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11092387",
              "author": {
                "username": {
                  "text": "atif611"
                },
                "userId": "ur34370059"
              },
              "summary": {
                "originalText": "Over the Top Indian Propaganda Art"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Had my wife extremely upset after watching. Especially since she&#39;s lived through the actually Karachi period as described. The additional star is for Akshay Khanna and his Baloch dance which is really why I went to the cinema to watch. Otherwise, this is your public demand Indian masala, a little bit of everything and to spice it up I&#39;m sure it was funded by the Indian and Pakistani mafia.<br/><br/>Also it makes one wonder if India still has a censor board? I think I heard more Urdu curses in one sitting then I every did my entire life. I understand art, this isn&#39;t it. Naya India Ranbeer? This is time pass, INSERT VULGUR CURSE IN HINDI HERE."
                }
              },
              "authorRating": 2,
              "submissionDate": "2026-01-03",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11092387/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007349",
              "author": {
                "username": {
                  "text": "NileshT-297"
                },
                "userId": "ur211549179"
              },
              "summary": {
                "originalText": "Refreshing change in Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After many years, we have a movie from Bollywood that&#39;s worth watching twice on the Big Screens.<br/><br/>The actors, the story, the BGMs, the plot.. I have to be honest, I didn&#39;t expect a lot from Ranveer Singh but man, he surprised me on this one &amp; I am happy to be proven wrong. Akshay Khanna, Sanjay Dutt did their part well. As an Indian, this resonates with me so much.. Go watch this on the big screens, shower it with your praise &amp; restore your faith in Bollywood. There&#39;s still some life left in this leftists elitist sh!th0le of an industry. Who knows, perhaps they&#39;ll learn their lesson from such movie successes."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007349/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004565",
              "author": {
                "username": {
                  "text": "saurav-90322"
                },
                "userId": "ur152478517"
              },
              "summary": {
                "originalText": "That's what we call a bollywood movie 🔥🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great script. Long movie. Not a single dull moment. And of course Rehman dacoit( Akshay khanna). It seems he is the heart of the first part. Awesome acting. The music will hold good throughout the movie. Fully action loaded movie.<br/><br/>Eagerly waiting for the second part. The major masala part seems to be added in the second part."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004565/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007357",
              "author": {
                "username": {
                  "text": "Kshitiz-13"
                },
                "userId": "ur211549438"
              },
              "summary": {
                "originalText": "Amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those rare films that doesn&#39;t just entertain - it leaves a mark. Aditya Dhar proves once again that he isn&#39;t just a filmmaker; he&#39;s a precision storyteller with fire in his vision. Every frame feels intentional, every scene purposeful, and every emotional beat lands exactly where it should.<br/><br/>From the very beginning, the movie grips you. The storytelling is layered yet smooth - complex themes delivered without ever losing clarity or momentum. Dhar builds tension like only he can: not loud, not rushed, but steadily rising until your pulse syncs with the rhythm of the film.<br/><br/>The background score deserves its own applause. It&#39;s atmospheric, intense, and immersive - the kind of score that doesn&#39;t just accompany the visuals, but elevates them. In action sequences, it punches. In emotional moments, it breathes. It&#39;s a rare example of music being as much a character as the actors on screen.<br/><br/>Speaking of action - flawless. Brutal, sharp, grounded and filmed with a commitment to realism rather than chaos. No unnecessary slow-mo, no over-stylization - just pure craft. The choreography, cinematography, and editing combine into a visual language that feels both cinematic and personal.<br/><br/>Performances across the cast are strong, but what stands out is how Dhar uses his actors. Nobody feels wasted. Nobody feels like filler. Every role matters. Every role moves the story.<br/><br/>The film may be facing some negativity online, but much of it feels less like genuine criticism and more like reactionary noise from people who seem uncomfortable with the film&#39;s confidence, tone, or national identity. Unlike those voices, the audience response inside theatres tells a different story - applause, silence when needed, and that collective breath-holding feeling only great films create."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007357/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007359",
              "author": {
                "username": {
                  "text": "shubhj-29931"
                },
                "userId": "ur154427384"
              },
              "summary": {
                "originalText": "Emotions Run High, Action Runs Hard"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film starts with a deliberate, almost meditative pace that draws the audience into a complex world of power, loyalty, and betrayal. Ranveer Singh&#39;s performance stands out, embodying a character who is both morally conflicted and intensely committed. The supporting cast enhances the story&#39;s richness, with each interaction layered with tension and meaning. Action sequences are brutal yet meticulously choreographed, and the director&#39;s storytelling combines political realism with emotional authenticity. Cinematic framing and lighting elevate even the quiet moments, while the music subtly underscores the stakes, creating an engrossing and sophisticated narrative."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007359/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014195",
              "author": {
                "username": {
                  "text": "Gourangg-0"
                },
                "userId": "ur211594873"
              },
              "summary": {
                "originalText": "The Real Truth"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Story line is superb and acting and direction is extraordinary.<br/><br/>Length of the is very good nowadays this 3.5 hours of length feels a diamond from coal because I don&#39;t like short movies at all I want long and thrusty stories ..\nAlso yrr acting of akshay khanna is diamond of this movie.. and yes R Madhavan is very good.. overall this movie related with the real truth of Pakistan and terrorism in India and story behind notes and attack on 26/11 is the real gold of movie .. and then....\nWell I don&#39;t know how to write more about it I can&#39;t express my self rightnow because I just came out from movie hall and I can say this is one of the best masterpiece i watched in theaters and yes I can&#39;t wait for part 2 and hope this will be another universe of spy and Indian stories .. hope this will go on and on and on .....<br/><br/>Thanks 👍🏻"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014195/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008687",
              "author": {
                "username": {
                  "text": "rebelprince-48227"
                },
                "userId": "ur104003271"
              },
              "summary": {
                "originalText": "Easily one of best Movie came out of Indian cinema.."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "So many negative reviews from obvious cabal who couldn&#39;t tolerate exposed t Truth of idea of Pakistan..<br/><br/>Dhurandhar is 10/10.. Exceptional, gritty, superb, Aditya Dhar is top notch. All actors have done commendable work. The 3.5 hours felt nothing Infact I could have watched part 2/if they played it next.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008687/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014196",
              "author": {
                "username": {
                  "text": "mishrasudhanshu-79972"
                },
                "userId": "ur182381066"
              },
              "summary": {
                "originalText": "DHURANDHAR - A MASTERPIECE"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must watch movie that depicts Real cinema.<br/><br/>A masterpiece , once in decade , blockbuster .<br/><br/>Shows the real face of terror of Pakistan.<br/><br/>Hatsoff to all the actors.<br/><br/>Go in large no. Because this movie really deserve to be on top .<br/><br/>Akshay, Ranveer , Sanjay, Arjun .. You all guys nailed it .<br/><br/>#Tabahi ."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014196/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}