{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6ndzktazcwzy47wvx5mbxrpsmuaz33mndx7xfaldomqbdf4skydk3oq3v5pzyodk3u4yqcagje7hbmqs5mg7ti2wa",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11044371",
              "author": {
                "username": {
                  "text": "kumarprasun-12547"
                },
                "userId": "ur121913365"
              },
              "summary": {
                "originalText": "Very eye opening and based on true incidents"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is based on the true incidents of terror network operating in Pakistan and plotting several terror attacks on India, particularly Hindus, this movie touches a major aspect of spy movies and shows the true condition of an Indian spy whose undercover mission is to infiltrate gangs operating in Pakistan who work with terrorists and supply them with arms and ammunition."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044371/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016574",
              "author": {
                "username": {
                  "text": "ArvantP"
                },
                "userId": "ur208066619"
              },
              "summary": {
                "originalText": "Must Watch Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar&#39;s Dhurandhar after URI and Baramulla, honestly feels like the best spy movie India has produced in years. It isn&#39;t loud, flashy, or cartoonish like the Pathan, Tiger, War universe; instead, it is grounded, sharp and terrifyingly close to real life. The film shows how intelligence officers actually think, plan, make mistakes, recover, and put their lives on the line for the country. What impressed me most was how the movie connects every mission with real-world tensions, cross-border infiltration, and the emotional pressure our agents carry. It highlights the cruelty and brutality performed by extremist terrorist groups against innocent Indian citizens, without unnecessary exaggeration. The scenes of captives, bomb factories, and hidden bases feel painfully real, and Akshaye Khanna&#39;s calm intensity mixed with Ranveer Singh&#39;s raw energy makes the narrative even more gripping. Their performances feel less like acting and more like they are living the mission especially in the interrogation sequences and the final infiltration scene.<br/><br/>What truly sets Dhurandhar apart is that it respects the idea of a spy thriller. Instead of turning heroes into superheroes like in Pathan, Tiger, or War, this film shows strategy instead of slow-motion, intelligence instead of random action, and purpose instead of just style. When Ranveer silently tracks a terror cell through the narrow lanes or Akshaye Khanna breaks down the enemy network using pure mind power, you feel the tension in your stomach. The movie also doesn&#39;t shy away from exposing the dark realities of cross-border extremist groups operating from Pakistan, how they manipulate young minds, and the inhuman torture methods they use. But the film is careful it targets terrorists, not ordinary people, and that realism makes the story more powerful. The last 30 minutes are enough to make you sit frozen in your seat, thinking about the sacrifices made by the unseen heroes of India. For me, &quot;Dhurandhar&quot; is not just a spy movie; it is a reminder of a world we choose not to see, and a tribute to the people who protect us without asking for credit. A full 10/10 from my side."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016574/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004902",
              "author": {
                "username": {
                  "text": "harshawasthi90"
                },
                "userId": "ur51766089"
              },
              "summary": {
                "originalText": "Best Spy Movie Bollywood has ever offered."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film runs for 3.5 hours, yet not for a moment does it lose momentum. It holds your attention with an almost hypnotic grip.<br/><br/>Special praise for the BGM. The way it blends with the narrative rhythm, and the way it rises and recedes with the tension, is genuinely masterful.<br/><br/>Outstanding performances\nMost compelling performances, in order:<br/><br/>Arjun Rampal - Major Iqbal\nJameel Jamali - Jameel Jamali\nAkshaye Khanna - Rehman Dakait\nRanveer Singh - Hamza Ali Mazhari\nMadhavan - Ajay Sanyal<br/><br/>The tight close-up shots, especially the ones capturing Ranveer Singh&#39;s micro-expressions, are brilliantly executed.<br/><br/>The production design feels remarkably authentic. Even the green-screen sequences have a level of realism rarely seen in mainstream cinema.<br/><br/>What I particularly appreciate is the film&#39;s unapologetic portrayal of Pakistan and the ISI.<br/><br/>This is a refreshing change from the sanitised, commercially driven crap seen in Jawan, Ek Tha Tiger, and similar franchises.<br/><br/>When the film ended,\nit genuinely caught me off-guard.<br/><br/>It felt as though I did not want it to finish, because the rising momentum had created such an immersive flow.<br/><br/>Please watch it.<br/><br/>Support it.<br/><br/>Make it a blockbuster,<br/><br/>so that more filmmakers gain the confidence to attempt bold and uncompromising storytelling.<br/><br/>Improvements I felt..\n1. Action sequences could be shorter and more grounded.<br/><br/>2. Romantic songs can be avoided to maintain the narrative flow.<br/><br/>3. Movies should have ended on an unresolved moment,\nmaking the audience want to return badly for the 2nd part.<br/><br/>(Something like the curiosity created by Why did Kattappa kill Baahubali? Just saying..)"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004902/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018359",
              "author": {
                "username": {
                  "text": "AnubhavM-05"
                },
                "userId": "ur211627458"
              },
              "summary": {
                "originalText": "This is the perfect way to expose Atankistan."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story is set against the backdrop of real historical events, specifically the 1999 IC-814 Kandahar hijacking and the 2001 Indian Parliament attack. Following these attacks, Indian intelligence chief Ajay Sanyal (played by R. Madhavan and loosely based on Ajit Doval) decides that India needs to stop playing defense. He devises a long-term covert operation to infiltrate the &quot;terror factory&quot; inside Pakistan.<br/><br/>The Mission: Operation Dhurandhar\nSanyal recruits a young prisoner with no family and a violent past named Jaskirat Singh Rangi (Ranveer Singh). Sanyal trains him to become a lethal &quot;weapon&quot; and gives him a new identity: Hamza Ali Mazari.<br/><br/>Hamza is sent to Lyari, a notorious neighborhood in Karachi, Pakistan, known for its gang wars. His mission is to infiltrate the local underworld, which is being used by the Pakistani state (ISI) to fund and organize terror attacks against India.<br/><br/>Infiltration &amp; Rise\nHamza manages to join the gang of Rehman Dakait (Akshaye Khanna), a feared Balochi gangster who wants to transition into a legitimate political leader. Hamza wins Rehman&#39;s trust by saving his family and proving his loyalty. Over time, Hamza rises through the ranks to become Rehman&#39;s right-hand man.<br/><br/>While deep undercover, Hamza navigates a complex web of power:\nRehman Dakait: The gangster with political ambitions.<br/><br/>**Jameel Jamali (Rakesh Bedi): A corrupt politician using the gangs for votes.<br/><br/>**Major Iqbal (Arjun Rampal): An ISI officer who orchestrates terror plots against India using the gang&#39;s resources.<br/><br/>**SP Chaudhry Aslam (Sanjay Dutt): A ruthless Pakistani cop (the &quot;Encounter Specialist&quot;) trying to clean up Lyari, who becomes a major obstacle for Hamza and Rehman.<br/><br/>The Turning Point\nHamza falls in love with Yalina (Sara Arjun), the daughter of the politician Jameel Jamali, complicating his mission. However, the emotional core of the movie shifts during the 26/11 Mumbai attacks. Hamza is forced to watch helplessly as his &quot;bosses&quot; in Pakistan celebrate the attacks on his homeland. This fills him with rage and solidifies his resolve to destroy the network from within.<br/><br/>Ending Explained\nThe Betrayal\nThe climax sees the lines between loyalty and duty blur. Hamza uses the conflict between the police (SP Chaudhry Aslam) and the gangsters to his advantage. Although Hamza has built a brotherhood with Rehman Dakait, his duty to India comes first.<br/><br/>After Rehman is injured in a confrontation with SP Aslam, Hamza takes him to safety-only to reveal his true allegiance. In a heart-wrenching scene, Hamza kills Rehman Dakait, fulfilling the first major step of his mission. This is significant because he has to kill the man who treated him like a brother to serve his country.<br/><br/>The Cliffhanger\nThe movie does not end with a &quot;happily ever after.&quot; After killing Rehman, Hamza returns to his cover life. In the final scene, he is seen looking at a secret diary/list of targets. Rehman Dakait was just the first name. He crosses it out, revealing the next major target: Major Iqbal (the ISI officer).<br/><br/>The film ends with the promise of Dhurandhar Part 2 (slated for March 2026), where Hamza will likely go after the state-sponsored actors (ISI) directly.<br/><br/>Real-Life Inspirations\nThe movie is a fictionalized account but draws heavily from reality:\nHamza Ali Mazari: A fictional deep-cover agent.<br/><br/>Ajay Sanyal: Based on India&#39;s National Security Advisor, Ajit Doval.<br/><br/>Rehman Dakait: Based on the real-life Lyari gangster Rehman Dakait, who was a central figure in the Karachi gang wars.<br/><br/>SP Chaudhry Aslam: Based on Chaudhry Aslam Khan, a real Pakistani police officer known for his encounters against terrorists and gangsters."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018359/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011926",
              "author": {
                "username": {
                  "text": "Manav-69"
                },
                "userId": "ur211578191"
              },
              "summary": {
                "originalText": "An amazing bollywood movie after soo long"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is action packed, some dark scenes, soo close to reality. Loved it, a must watch on the big screen, ignore the bad paid PR, watch it for yourselves. After soo long, I went to cinemas to watch a bollywood film and it was one of the best decision. I don&#39;t why someone is doing bad PR for such a great movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011926/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006414",
              "author": {
                "username": {
                  "text": "srvqevxa"
                },
                "userId": "ur176906560"
              },
              "summary": {
                "originalText": "Where Drama Breathes and Action Blazes"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The emotional core of the film is as compelling as its adrenaline-pumping sequences. Ranveer Singh delivers a layered performance, perfectly capturing the turmoil of a man navigating danger and moral dilemmas. Direction is precise, crafting a world where politics, crime, and personal stakes collide. Action scenes are choreographed to thrill without sacrificing story, and the supporting cast enhances the narrative with subtle yet impactful performances, making the film a holistic cinematic experience."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006414/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018599",
              "author": {
                "username": {
                  "text": "abhihbti-82963"
                },
                "userId": "ur62091420"
              },
              "summary": {
                "originalText": "Engaging and Refreshing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an engaging and refreshing film that strikes a perfect balance between strong storytelling and memorable performances. The narrative is crafted with clarity and purpose, keeping the audience invested from start to finish. The cast delivers natural, heartfelt acting, bringing depth and authenticity to each character. The direction is sharp, the pacing is smooth, and the visuals perfectly complement the tone of the movie. Overall, Dhurandhar is an enjoyable and well-made film that leaves a lasting impression-a commendable effort by the entire team."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018599/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016381",
              "author": {
                "username": {
                  "text": "VishalsinhZala-8"
                },
                "userId": "ur211610291"
              },
              "summary": {
                "originalText": "This is what cinema should be RAW & REAL"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a film that stands apart from most modern spy thrillers because of one simple reason - its rawness. Unlike the glossy, over-stylized, over-dramatic movies like Pathaan or Tiger 3, this film doesn&#39;t try to sell fantasy. It doesn&#39;t hide behind unnecessary glamour, childish heroism, or diplomatic sugar-coating. Instead, Dhurandhar presents a world that feels brutally real, emotionally heavy, and disturbingly close to what an actual covert operation might look like.<br/><br/>What I appreciated the most is how the movie handles the portrayal of geopolitical tension. It doesn&#39;t pretend that everything is rosy between neighbouring nations. It doesn&#39;t create fake friendship arcs or forcefully show the enemy country as &quot;good&quot; just to make the plot politically correct. Instead, it shows the harsh mindset, hostility, and underground operations that exist in the world of intelligence. The movie doesn&#39;t generalize people - it targets the systems, organizations, and power structures that fuel conflict. And in that sense, the film hits with a level of truthfulness that mainstream spy films usually avoid.<br/><br/>Ranveer Singh&#39;s performance adds a layer of intensity that makes you feel the danger and brutality of espionage. His character isn&#39;t a superhero - he bleeds, breaks, doubts, and still fights. The film&#39;s atmosphere remains dark, realistic, and grounded from start to end, without jumping into unrealistic stunts or cringe dialogues seen in many commercial spy movies.<br/><br/>The biggest strength of Dhurandhar is its commitment to authenticity. The cinematography, locations, interrogations, military operations, and emotional stakes are all built with a sense of reality, not Bollywood-style exaggeration. It creates tension that feels earned and situations that feel possible.<br/><br/>Overall, Dhurandhar is a gripping, unapologetically real spy thriller that refuses to compromise its truth for entertainment. If you prefer grounded storytelling over flashy nonsense, this movie is absolutely worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016381/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11040711",
              "author": {
                "username": {
                  "text": "kabirshekhawat-00426"
                },
                "userId": "ur169290404"
              },
              "summary": {
                "originalText": "Dhurandhar review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A superb, real, raw movie of indian cinema never see something like this. It&#39;s a slowly intoxicating addiction. Once it takes over, you can&#39;t forget it. It&#39;s have repeat value love this movie so muchhhh. When you start the movie then you forget when your time pass. Some said it&#39;s big problem is it&#39;s length but I said if you watch then it&#39;s not a problem it&#39;s a power of this film it&#39;s. This film length justify to introduce characters of a film this film want time if they don&#39;t give time to this film then it&#39;s not give that impact like how you got now."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11040711/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018326",
              "author": {
                "username": {
                  "text": "SrishT-5"
                },
                "userId": "ur211626384"
              },
              "summary": {
                "originalText": "Gut Wrenching Performances. Absolute Masterpeice"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The 3 hr + Dhar&#39;s movie is an absolute masterpiece to watch. The story the emitons the bgm, and everything in between were in a perfect sync. Some scenes were so brutal that it was hard to digest, but the intent hit the mark. Kudos to the tea,m waiting for the second part. Akshay Khanna is a show stealer, and R Madhava, you beauty. Aditya Dhar created a magic, and I expect the second part to be as good as the first one. Please don&#39;t ruin the story. All the best for part 2."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018326/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11069208",
              "author": {
                "username": {
                  "text": "sagnikbanerjeeindia"
                },
                "userId": "ur93984961"
              },
              "summary": {
                "originalText": "Might just be the best movie to come out of bollywood in a very long time"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The trailer and teaser definitely peaked interest but nothing could&#39;ve prepared me for what I witnessed on screen. This reminded us why it&#39;s so important to experience movies in theaters. The performances were raw, earnest and absolutely spectacular. The music top notch. The cinematography, editing pushing perfection. But what impressed me the most has to be the story and the way it&#39;s told. There&#39;s a certain kind of magic, a touch of sorcery when the lights dimmed in the theatre and the face of Madhavan popped up on the screen and for the next 3.5 hours it was a saga that certainly didn&#39;t feel like monotone even for a second. An absolute spectacle."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11069208/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020371",
              "author": {
                "username": {
                  "text": "AARYANT-11"
                },
                "userId": "ur211642437"
              },
              "summary": {
                "originalText": "My POV"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a bold and gripping spy thriller that blends political intrigue, smart world-building, and intense performances. Ranveer Singh delivers one of his most controlled and layered roles, bringing both vulnerability and fire to his character. Akshaye Khanna is outstanding as the unpredictable antagonist, adding depth and tension whenever he appears on screen.<br/><br/>The film&#39;s scale is huge\npacked with gritty action, strong cinematography, and a soundtrack that elevates the atmosphere. The pacing in the first half can feel stretched, but once the story locks in, it becomes a compelling and immersive ride. By the end, the film sets up its sequel with a strong cliffhanger that leaves you wanting more.<br/><br/>Overall, Dhurandhar is an ambitious and stylish espionage drama that rewards patient viewers with powerful moments, strong performances, and a rich narrative world."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020371/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020805",
              "author": {
                "username": {
                  "text": "DhanReview"
                },
                "userId": "ur150752804"
              },
              "summary": {
                "originalText": "Stop scrolling! It's the best movie of 2025 go watch it."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I&#39;m reviewing this after a long time. Since you might have already seen the trailer, expect plenty of violence.<br/><br/>This movie has everything action, romance, solid direction, and great acting!<br/><br/>Akshaye Khanna grabbed everyone&#39;s attention. He deserves a dedicated hero role in future movies as well. I hope he returns in the second part of Dhurandhar. The entire theater was going crazy.<br/><br/>This movie is pure madness and I loved it!<br/><br/>Things i didn&#39;t like:\nmultiple swearing words were there in the movie.<br/><br/>Donga taking on shots and still standing was unnecessary."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020805/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006436",
              "author": {
                "username": {
                  "text": "vikas-10199"
                },
                "userId": "ur181312856"
              },
              "summary": {
                "originalText": "Drama That Moves You, Action That Wows You"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watching Dhurandhar is like witnessing a perfect storm of direction and performance. The director&#39;s precision ensures that each character arc is meaningful, and every twist hits with impact. The lead actor dominates the screen with intensity and nuance, while the supporting cast complements brilliantly, giving life to secondary storylines without stealing focus. The film&#39;s long runtime never feels heavy because of this balance. From tense political standoffs to emotionally charged interpersonal moments, the director&#39;s vision keeps the audience immersed. Truly a benchmark in modern storytelling."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006436/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026970",
              "author": {
                "username": {
                  "text": "nehaspathak"
                },
                "userId": "ur155471553"
              },
              "summary": {
                "originalText": "Truly dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "💯 recommended. Reality is shown and it is not boring for a minute despite of long running time.<br/><br/>Real footage and audios of 26/11 are shown. Real image of pakistan which they doesn&#39;t want india to show.<br/><br/>Amazing cast and amazing performances from all the actors. Ranveer and akshaye&#39;s performances are top notch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026970/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007251",
              "author": {
                "username": {
                  "text": "jshah-41734"
                },
                "userId": "ur118603091"
              },
              "summary": {
                "originalText": "Action Packed, Heartfelt, Unmissable"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the very first frame, the film immerses viewers in a tense, morally complex world where strategy, loyalty, and danger intersect. Ranveer Singh delivers a compelling, layered performance, alternating between calculated restraint and explosive action. Sanjay Dutt commands every scene with gravitas, authority, and subtle unpredictability. Akshaye Khanna and R Madhavan enrich the ensemble, creating a sense of realism and depth in the supporting cast. Arjun Rampal&#39;s understated menace amplifies tension, while Sara Arjun&#39;s performance brings crucial emotional weight. Aditya Dhar&#39;s direction blends narrative strategy, suspense, and visceral action seamlessly. Cinematography captures Karachi&#39;s chaotic energy and quiet character moments alike, while the score accentuates tension and emotional beats. The climax is both exhilarating and emotionally satisfying, showcasing meticulous storytelling and masterful pacing."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007251/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007382",
              "author": {
                "username": {
                  "text": "sonodyine-99444"
                },
                "userId": "ur121937427"
              },
              "summary": {
                "originalText": "Thats how you make a spy movie from original story"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What a brilliant movie...\nWatched once but felt it was not enough, planing again for next weekend. Each and every actor acted brilliantly. Akshay Khanna and Ranveer were breathtaking. Hats off to the maker. Must watch for theaters. Music scores were excellent, and there should be a seperated award for casting."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007382/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023974",
              "author": {
                "username": {
                  "text": "harjinder-88"
                },
                "userId": "ur211588015"
              },
              "summary": {
                "originalText": "The True Masterpiece And A very Marvelous Experience!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This Movie is as a Raw espionage thriller that blends real-life historical events (Kandahar hijack, 2001 Parliament attack, 26/11) with fictional storytelling. The True Credit goes to The Director Aditya Dhar for his meticulous recreation of Karachi&#39;s Lyari district and the tense, atmospheric world he builds. The use of &quot;chapters&quot; to structure the story is a unique stylistic choice worth noting."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023974/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006993",
              "author": {
                "username": {
                  "text": "SujalS-48"
                },
                "userId": "ur203913056"
              },
              "summary": {
                "originalText": "A Cinematic Triumph Stacked with Star Power"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "With careful pacing and smart storytelling, the film engages from start to finish. Ranveer Singh balances internal conflict and high-stakes action brilliantly, while Sanjay Dutt radiates authority. Akshaye Khanna and R Madhavan give layered, intelligent performances, and Arjun Rampal exudes quiet menace. Sara Arjun&#39;s portrayal adds emotional clarity and gravitas. Aditya Dhar orchestrates a world of tension and strategy, crafting sequences that are both thrilling and meaningful. Cinematography captures both sweeping chaos and subtle emotion, and the musical score complements the story without overwhelming it. The climax unites adrenaline and emotion, leaving a lasting cinematic impression."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006993/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010893",
              "author": {
                "username": {
                  "text": "RiyazD-66"
                },
                "userId": "ur211569074"
              },
              "summary": {
                "originalText": "Drop everything \"must watch\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A visceral, authentic espionage thriller! Ranveer Singh delivers a career-defining, powerhouse performance-feral and brilliant. The action is brutal and real. An exceptional film anchored by phenomenal acting and gritty realism. A must-watch for its intense drama! AK as Rahman Dakait is phenomenal. Ranveer Singh! Ek Number."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010893/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013500",
              "author": {
                "username": {
                  "text": "Abhishek-671"
                },
                "userId": "ur211590879"
              },
              "summary": {
                "originalText": "Good to Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is awesome movie. Every Indian &amp; non Indian shout must watch this Movie. This is showing the real society of Pakistani, Culture of Pakistan and how the terrorist. Music and Action of this movie is too good you cant stop to listen every music again and again. Action, Location and graphics are also very good. So Must watch this movie. Thank You."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013500/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014404",
              "author": {
                "username": {
                  "text": "Ayush-626"
                },
                "userId": "ur211596467"
              },
              "summary": {
                "originalText": "BEST SPY FILM OF BOLYWOOD"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dman,every second of this movie is a perfection. It was 100x better than YRF spy universe and shame o thoose who rated it as 1 thoose people dont deserve theese kind the movies,ALSO the BGM was perfecet. Though it is as long as 3.5 hrs but oh boy let me tell you u will never get bored at any particular point of this movie..Hats off to aditya dhar damn."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014404/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006630",
              "author": {
                "username": {
                  "text": "abhaykumarx-85567"
                },
                "userId": "ur179446684"
              },
              "summary": {
                "originalText": "A Bold Mix of Stars and Intense Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is a film that demands attention, rewarding viewers with a carefully layered story of ambition, loyalty, and moral conflict. Ranveer Singh commands the screen with a performance that blends restraint and intensity, fully inhabiting a character whose choices define the narrative. Dhar&#39;s direction is precise and visionary, balancing tense action with moments of emotional introspection. Action sequences are thrilling, choreographed with narrative purpose, and visually striking. Supporting actors contribute depth and credibility, each adding texture to the world being built. With immersive cinematography, thoughtful editing, and a haunting score, the film stands as a masterclass in blending action, emotion, and political intrigue."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006630/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006560",
              "author": {
                "username": {
                  "text": "imdbfan-8340005650"
                },
                "userId": "ur199123423"
              },
              "summary": {
                "originalText": "High Drama. High Passion. High Impact"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story unfolds with a deliberate intensity, creating a sense of inevitability and suspense that grips the viewer. Ranveer Singh delivers a commanding performance, blending vulnerability with fierce determination. Director Dhar&#39;s vision ensures action sequences are high-stakes and purposeful, while quieter moments explore human emotion. Supporting performances are impactful, enhancing realism and depth. Cinematography captures tension and atmosphere beautifully, with the score providing subtle, compelling reinforcement throughout."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006560/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004639",
              "author": {
                "username": {
                  "text": "manleenme"
                },
                "userId": "ur132846191"
              },
              "summary": {
                "originalText": "The Real Show"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Hardline entertainer! Just tighten your seat belts and get ready for the breathtaking scenes! The cast is to the point no nonsense! The BACKGROUND SCORE IS BANG ON!!! I think a true superhit entertainer, super direction, amazing dialogues just not a minute you would like to miss! And yes the TREND of 3-4hour movies of this class are most welcome #dhurandhar #superhit."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004639/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}