{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6tdzktazcwzy476whvmzqrps4ocj434ndt4hnalo6qebgnesk2dsyoq3fzjch7ck2qaqyjry3p64zjdyghzued4",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11003709",
              "author": {
                "username": {
                  "text": "divineflame06"
                },
                "userId": "ur64356171"
              },
              "summary": {
                "originalText": "Dhurandhar is a beast of a theatrical experience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is raw, ruthless, and absolutely unflinching.<br/><br/>Aditya Dhar has put together a full-blown big-screen assault - the world-building is so immersive and detailed that you feel every shadow, every scream, every drop of blood. Yes, the film is long... very long at 212 minutes. But those 212 minutes are pure madness.<br/><br/>The writing is top-tier, even if the pacing wobbles occasionally. What really surprised me is that Dhar refuses to take the usual espionage-thriller route. There&#39;s no cheap &quot;what&#39;s next?&quot; tension-building. Instead, he goes for a gritty, documentary-style tone ; dark, heavy, and brutally honest. The colour palette is gloomy, the lighting is fascinating, and the cinematography is just wild. Sashwat&#39;s music lifts the film several notches. And the violence? At times, it&#39;s genuinely hard to watch. This is brutality at its peak.<br/><br/>The characters are written with real weight. Akshay Khanna as Rahmat Dakait owns this film. What a performance. Ranveer isn&#39;t far behind either. Maddy, Rampal, Dutt... everyone is rock solid and brings something memorable. Special mention to Rakesh Bedi.<br/><br/>The final stretch sets up Part 2 beautifully; darker, deadlier, and ready to dive deep into Ranveer&#39;s past and whatever chaos comes next.<br/><br/>Dhurandhar is a beast of a theatrical experience. Miss it at your own risk."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003709/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013644",
              "author": {
                "username": {
                  "text": "mohitpandey-26179"
                },
                "userId": "ur150780224"
              },
              "summary": {
                "originalText": "Great experience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerful and ambitious spy thriller that makes for a great big-screen experience. It is a solid entertainer, driven by the sheer intensity of its central performances (especially Singh and Khanna) and raw, well-executed action. For fans of the patriotic spy genre and intense character-driven dramas, it&#39;s considered a must-watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013644/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007178",
              "author": {
                "username": {
                  "text": "ChandanP-991"
                },
                "userId": "ur210718489"
              },
              "summary": {
                "originalText": "A cinematic powerhouse pulsing with unstoppable momentum"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every narrative thread is carefully interwoven, building a sense of foreboding that never lets up. Ranveer Singh&#39;s performance anchors the story, balancing vulnerability with relentless determination. The ensemble cast, including unexpected standouts in smaller roles, brings additional layers to the story&#39;s tension. Director Dhar masterfully fuses action, strategy, and emotional depth, ensuring that spectacle never overshadows character development. The cinematography captures both the grit of urban danger and the intimacy of personal stakes, while the editing maintains a taut rhythm. By the climax, the stakes feel monumental, and the resolution is both shocking and satisfying."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007178/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028828",
              "author": {
                "username": {
                  "text": "SamkitJ-1"
                },
                "userId": "ur211706496"
              },
              "summary": {
                "originalText": "Dhurandhar review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those rare Bollywood films where the craft genuinely rises above everything else. What impressed me most is that the movie is not carried by just one performance. Akshaye, Rampal, Sanjay, Ranveer - everyone comes in with the presence of a lead, and together they hold the film with remarkable balance. Ranveer plays his part exactly the way it should be played, without overshadowing the world the film is trying to create.<br/><br/>The real achievement, though, is how the film rises beyond individual actors. It reminds me of how Pacino in The Godfather or De Niro in Casino and Goodfellas are remembered not just because of their acting but because they were part of films that were masterpieces in themselves. When a movie reaches that level, the film and the performances become inseparable.<br/><br/>Aditya Dhar manages to achieve that with Dhurandhar. The film feels meticulously built, confident in what it wants to say, and bold in how it says it. It shows what happens when Bollywood actually takes risks instead of following formulas. The result is something powerful, memorable and genuinely cinematic."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028828/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021194",
              "author": {
                "username": {
                  "text": "deepanshushandilya"
                },
                "userId": "ur122197967"
              },
              "summary": {
                "originalText": "Awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Amazing. Dhurandhar is a bold and gripping spy thriller that blends political intrigue, smart world-building, and intense performances. Ranveer Singh delivers one of his most controlled and layered roles, bringing both vulnerability and fire to his character. Akshaye Khanna is outstanding as the unpredictable antagonist, adding depth and tension whenever he appears on screen.<br/><br/>The film&#39;s scale is huge - packed with gritty action, strong cinematography, and a soundtrack that elevates the atmosphere. The pacing in the first half can feel stretched, but once the story locks in, it becomes a compelling and immersive ride. By the end, the film sets up its sequel with a strong cliffhanger that leaves you wanting more.<br/><br/>Overall, Dhurandhar is an ambitious and stylish espionage drama that rewards patient viewers with powerful moments, strong performances, and a rich narrative world.<br/><br/>I enjoyed watching dhunrander in theatre\nI recommend it if you&#39;re watching it on big screens."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021194/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020399",
              "author": {
                "username": {
                  "text": "kaskau"
                },
                "userId": "ur193855997"
              },
              "summary": {
                "originalText": "Must Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a masterclass in suspense and action, weaving a complex narrative that keeps you on the edge of your seat. Ranveer Singh shines as the deep-cover RAW agent, bringing depth and nuance to his character. The supporting cast, including Akshaye Khanna and R. Madhavan, deliver standout performances.<br/><br/>Unlike some recent releases in the spy genre with delusional plot, Dhurandhar doesn&#39;t rely on gimmicks or over-the-top action sequences. Instead, it focuses on crafting a believable story with well-developed characters. The film&#39;s pacing is well-balanced, moving seamlessly from intense action scenes to emotional moments.<br/><br/>One of the standout aspects of Dhurandhar is its thoughtful direction. Aditya Dhar&#39;s vision brings a sense of realism to the film, making it feel more grounded than some of its counterparts in the genre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020399/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005125",
              "author": {
                "username": {
                  "text": "ksunny-64520"
                },
                "userId": "ur108310366"
              },
              "summary": {
                "originalText": "Most Realistic Indian SPY movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Most of the fictional spy movies don&#39;t show you how a spy or agent builds trust and sets context. Dhurandhar does this extremely well, holding cards and being patient. The action scenes are way up to the mark and bring in novelty.<br/><br/>Those talking about extreme gore don&#39;t know that the actual reality of Lyari is more brutal than what&#39;s shown.<br/><br/>Only thing I didn&#39;t like was ill placed love story which breaks the flow."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005125/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11077941",
              "author": {
                "username": {
                  "text": "trenergon"
                },
                "userId": "ur194337582"
              },
              "summary": {
                "originalText": "Incredible movie. Return of Bollywood."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I didn&#39;t think Bollywood had any capacity left to make a decent movie, let alone a good one. Dhurandhar proves everyone wrong, and that in fact incredible movies can and will be made, even if they are extremely rare. This movie may be divisive, but it deserves all the flowers. Phenomenal performances by Ranveer, Akshay, and the rest of the cast. The brutality and violence just added another gritty layer. Let&#39;s get to my favorite part, the SOUNDTRACK. I will be listening to these soundtrack for the next decade or so. Instant classic, and I truly hope to see more cohesive, beautiful movies like this. Shoutout to the director, you did excellent."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-31",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11077941/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010537",
              "author": {
                "username": {
                  "text": "bmapuskar"
                },
                "userId": "ur173619129"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I love how the movie remains fictional whilst roping in real events. Each character was played with such finesse. The background music is truly top notch. Not a minute was boring, the story keeps you engaged throughout. The age difference between ranveer and sara was a little uncomfortable but that is also well explained in the film. All in all no complaints. An amazing thriller, cannot wait for the sequel."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010537/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11075950",
              "author": {
                "username": {
                  "text": "guptabhumika-96232"
                },
                "userId": "ur103221595"
              },
              "summary": {
                "originalText": "Superb"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Loved the movie!!<br/><br/>I have watched the movie twice and most probably will be watching one more time in the theater. Thank you Aditya Dhar sir, you are great. And a big thanks to the whole dhurandhar team; Ranveer Singh, Akshay Khanna, Sara Arjun, Somya Tondon, R. Madhavan, Arjun Rampal, Sanjay Dutt, Bedi Sir, Naveen Kaushik, Danish and everyone. Waiting eagerly for the part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-30",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11075950/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018579",
              "author": {
                "username": {
                  "text": "saligujjar"
                },
                "userId": "ur56098549"
              },
              "summary": {
                "originalText": "Blockbuster"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those Bollywood thrillers that pulls you in from the very first frame and doesn&#39;t let go until the end. The film delivers a powerful mix of drama, suspense, and stylish storytelling, supported by outstanding performances from its lead cast.<br/><br/>Akshaye Khanna once again proves why he is one of Bollywood&#39;s most underrated powerhouses. His calm intensity, sharp expressions, and effortless command over emotional scenes make his character unforgettable. Every moment he appears on screen adds weight to the narrative.<br/><br/>Sanjay Dutt is equally impressive, bringing a raw, rugged charm that only he can deliver. His experience shows in every gesture. Whether he is delivering a threatening dialogue or portraying a moment of vulnerability, he keeps the audience glued to his journey.<br/><br/>Ranveer Kapoor gives one of his best performances in recent years. He brings depth, energy, and emotional complexity to his role. His transitions between subtle emotions and explosive moments are handled with remarkable skill. This is the Ranveer audiences love , committed, expressive, and completely immersed in the character.<br/><br/>The music of Dhurandhar is another strong point. The background score is thrilling and adds tremendous tension to the chase sequences and emotional scenes. The songs blend well with the story instead of feeling forced, which is rare in commercial cinema today.<br/><br/>The direction deserves special praise. The filmmaker balances excitement, mystery, and human emotion in a smooth, gripping flow. The visual style, the pacing, and the use of sound effects all contribute to a high-quality cinematic experience. The thrilling effects elevate the movie and make the action scenes feel real and impactful.<br/><br/>Overall, Dhurandhar is a well-crafted entertainer with top-notch acting, great music, and excellent direction. It is a must-watch for fans of intense Bollywood thrillers and for anyone who appreciates strong performances by Akshaye Khanna, Sanjay Dutt, and Ranveer Kapoor."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018579/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011540",
              "author": {
                "username": {
                  "text": "adi-11705"
                },
                "userId": "ur151015843"
              },
              "summary": {
                "originalText": "Good screen play"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Summary, then delve into key aspects like character depth, acting, visuals, music, and themes, explaining why things worked or didn&#39;t, and conclude with your overall recommendation, all while staying focused and providing specific examples to support your opinions, as seen in this sample review of\nThe Empire, directed by is a thrilling corporate drama that plunges audiences into the high-stakes world of finance as young Jake inherits his father&#39;s empire. Starring Lead Actor&#39;s Name, this film promises intrigue, power struggles, and a fight for legacy, setting the stage for a fast-paced ride.<br/><br/>The narrative quickly establishes Jake&#39;s overwhelming challenge: navigating cutthroat politics and protecting his inheritance from vultures. While the plot is packed with twists, keeping you engaged, it&#39;s the nuanced portrayal of Jake&#39;s internal conflict-balancing duty with morality-that truly shines. The supporting cast, particularly the cunning antagonists, adds layers of complexity, making every interaction feel vital.<br/><br/>Visually, the film is stunning, with sleek cinematography and grand production design that perfectly captures the opulent yet cold world of high finance. The score effectively builds tension, driving home the dramatic weight of pivotal scenes. Thematically, The Empire explores ambition, betrayal, and the corrupting nature of wealth, suggesting that power often demands sacrifice. Director irectors Name expertly balances spectacle with character study, avoiding typical action movie cliches by rooting the drama in believable human motivations, despite the grand scale.<br/><br/>While some might find the corporate jargon dense, The Empire delivers a genuinely gripping and well-crafted experience. It&#39;s more than just a business thriller; it&#39;s a compelling character study wrapped in a visually impressive package. I highly recommend it for fans of intricate plots and strong performances, proving that dramas about money can be truly electrifying and keep you on the edge of your seat."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011540/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029638",
              "author": {
                "username": {
                  "text": "anshulgupta-63580"
                },
                "userId": "ur128964358"
              },
              "summary": {
                "originalText": "Absolute Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Everyone worked hard to do the best possible acting in this film and the whole ahra of watching this movie in cinema will be a absolute gift for cinema lovers. Bollywood raising its bar and directors like aditya dhar truly deserve the amount of love for creating such a gripping story and making everyone stick to their seat for 3.5 hours."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029638/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013588",
              "author": {
                "username": {
                  "text": "SATISHK-3256"
                },
                "userId": "ur211590429"
              },
              "summary": {
                "originalText": "Simply Awesome. Must Watch Thriller Movie !!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must-watch movie. Although the total runtime, including the interval, spans over three and a half hours, the engaging narrative and chapterwise story telling ensures you won&#39;t feel the length.<br/><br/>The movie shines with its realistic depiction of events, bringing all characters and plot points to life. It presents a thriller focused on a RAW agent&#39;s mission in Pakistan, showcasing the lifestyle, challenges that intelligence team is facing and its application in such tough significant terrorist schemes.<br/><br/>It effectively weaves in several recent real-life terrorist incidents, anchoring the intense action in actual history. The outstanding acting and the story are comparable to, and often surpass, typical Hollywood spy thrillers.<br/><br/>The creators have truly produced a remarkable film, making it a highly suggested movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013588/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024402",
              "author": {
                "username": {
                  "text": "aretinagpavan"
                },
                "userId": "ur91752156"
              },
              "summary": {
                "originalText": "CONGRATS RANVEER & TO THE DIRECTOR IT'S GOOD 💐JUST WATCH N MUST WATCH !"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "AGREE THAT IT&#39;S BIT LENGTHY BUT BELIEVE ME IT&#39;S NOT AT ALL BORING ! IT&#39;S LITTLE VIOLENT SO, CAN&#39;T GO WITH CHILDREN BUT IS WORTH IT ! SOME PEOPLE SAY IT&#39;S SERIAL TYPE BUT DIRECTOR HAS DEFINITELY JUSTIFIED EVERY SCENE N ACTION SCENES ARE ON PAR LIKE ANY OTHER ACTION MOVIE DUNNO WHAT ELSE PEOPLE WANT ????<br/><br/>JUST GO FOR IT GUYS."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024402/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11038975",
              "author": {
                "username": {
                  "text": "dudheriasubham"
                },
                "userId": "ur126557062"
              },
              "summary": {
                "originalText": "Vengeance got no remedy! PANIC!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is one of those movies where you applaud and appreciate the cinematography, the screenplay, the music and of course, the performance. THIS IS CINEMA. I don&#39;t care for the politics or raw spy espionage, or whatever people are talking in internet. I see this as a movie, and this is the perfect blend of art and commercial cinema, the detailed world building, characters setup to the banger music and the tension building, oof , phenomenal job Mr. Dhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11038975/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010983",
              "author": {
                "username": {
                  "text": "VaibhavC-492"
                },
                "userId": "ur211569894"
              },
              "summary": {
                "originalText": "Better than Stranger Things"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Awesome movie, loving way Aditya Dhar is evolving. Superb acting by everyone and story plot is too good. I watched it two times. Akshay Khanna has stealed the show. He is just too good in his role. Ranveer Singh also done justice to his role. Now so excited for Part 2 releasing in 2026, march will be sure worth waiting. I think Aditya Dhar should make more movies like these."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010983/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11037499",
              "author": {
                "username": {
                  "text": "dalaladalalargha"
                },
                "userId": "ur127357088"
              },
              "summary": {
                "originalText": "Best Spy Flim Ever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s showing how terror activities really works, and it shows the true face of Pakistan, You will attach in the seat from the beginning. There&#39;s no boreness while you watch it. The story adoption and screen play is masterclass. The background score also awesome. Go watch and enjoy the movie. You will like this."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11037499/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007129",
              "author": {
                "username": {
                  "text": "VishakhaS-5"
                },
                "userId": "ur203912208"
              },
              "summary": {
                "originalText": "Crafted to stun, built to mesmerise"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of the best films of the year, thanks to its story, performances, and direction. Ranveer Singh carries the movie effortlessly, while Sanjay Dutt adds his signature power and style. Akshaye Khanna and R Madhavan deliver strong, believable performances, and Arjun Rampal impresses in action sequences. Sara Arjun brings emotion and innocence to the story. Aditya Dhar&#39;s writing and direction make the film easy to follow while keeping it intense and gripping. Action, drama, and humor are balanced perfectly, making it enjoyable for everyone."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007129/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007108",
              "author": {
                "username": {
                  "text": "rainasamay-37829"
                },
                "userId": "ur197605796"
              },
              "summary": {
                "originalText": "Where legends shine and stories erupt"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every frame of Dhurandhar exudes calculated tension, revealing the careful craftsmanship behind its creation. Ranveer Singh anchors the narrative with controlled aggression and subtle emotion, while the supporting cast adds texture to the perilous world they inhabit. Director Dhar orchestrates sequences where action and strategy coexist seamlessly, and the fight choreography feels grounded yet thrilling. The cinematography captures both intimate character moments and chaotic shootouts with equal finesse. The film steadily builds suspense, rewarding patient viewers with moments that shock and mesmerize simultaneously."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007108/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015646",
              "author": {
                "username": {
                  "text": "karmveersneh"
                },
                "userId": "ur152825725"
              },
              "summary": {
                "originalText": "Must Wartch!!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Its Paisawasool in all terms.. yes its an Adult film but this version of patriotism is besttt so far.. Ranveers expression the emotions, each and every character fits exactly what is needed to do the justice to the story!! Aditya Dhar Sir, You are a Brand.. the writing the direction.. the selection 10/10.. The story the portrayal everything just on point! I can watch it again and again and never ever will get bored. The 26/11 scene, nd what not every part of the movie speaks differently 😍 Thankyou for this. Waiting for the next part Eagerly 19/03/26 Bring it on."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015646/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016540",
              "author": {
                "username": {
                  "text": "AniketP-920"
                },
                "userId": "ur211610326"
              },
              "summary": {
                "originalText": "Insane"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch this films shows the reality of terrorism everybody need sto watch it. The action is too class the music is goated and acting is the best part everybody has given there best but I feels like it&#39;s Akshay Khanna and ranveer that stands out although it didn&#39;t felt like ranveer was main character for most of the time."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016540/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006872",
              "author": {
                "username": {
                  "text": "vkjiskik"
                },
                "userId": "ur177078499"
              },
              "summary": {
                "originalText": "A Story Forged in Fire and Feelings"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tension and anticipation are masterfully woven into every frame, creating a film that grips from beginning to end. Ranveer Singh delivers a performance that is both commanding and subtly expressive, anchoring a story filled with intrigue and danger. The supporting cast complements the lead with powerful performances, particularly the antagonists, whose presence heightens every confrontation. Director Dhar&#39;s meticulous attention to narrative structure ensures that action sequences feel purposeful, blending seamlessly with character development. Cinematography captures the stark contrasts of the underworld and personal drama, while editing keeps the story taut and engaging. Sound design and music elevate every dramatic moment, ensuring the audience remains invested. The climax balances emotional depth with high-stakes action, leaving a lasting impression of cinematic mastery."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006872/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011743",
              "author": {
                "username": {
                  "text": "nogodnogood"
                },
                "userId": "ur193444705"
              },
              "summary": {
                "originalText": "Best movie of 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is best unadulterated movie of 2025. You can&#39;t take your eyes off screen. Akshay Knanna you beauty what a acting. Awesome acting by R Madhavan of legend AD. Shows Pakistan in true light and movie is making it one-sided liberals fill up buckets with their tears. LOL.<br/><br/>MUST WATCH IN THEATERS WITHOUT KIDS."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011743/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033471",
              "author": {
                "username": {
                  "text": "SrishtiG-56"
                },
                "userId": "ur211746507"
              },
              "summary": {
                "originalText": "Masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Salute to the makers,Aditya Dhar and team for bringing this outstanding piece of cinema for us ,And hats off to the whole casting man,not even a single character was there who was not suitable for the role. Great movie overall,and I would love to watch it in cinema hall twice,thrice and so on...\nEvery Indian should definitely watch this movie it&#39;s your duty to appreciate the makers who bring out the truth in front of audience about our own Country,great courage they have,and I request request everyone to watch it in cinemas only....\nJai Hind🇮🇳"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033471/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}