{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4vojcrsqyxdo6ia7cvhznzxrpsmuaz33mndx7xfaho6qebgnesk2dk5oqyvzjchallhhtjvzczymh6igfdjb3ffjq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11008419",
              "author": {
                "username": {
                  "text": "psakarwar"
                },
                "userId": "ur132752170"
              },
              "summary": {
                "originalText": "Simply woowwww"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "**&quot;Brother, hats off to Aditya Dhar - what a masterpiece he has made!<br/><br/>No one even realized what kind of &#39;khichadi&#39; he was cooking...\nDhurarandhar is his best work ever.<br/><br/>What amazing casting, just wow!<br/><br/>Akshaye Khanna - boss, bow down to your acting.<br/><br/>I&#39;m not a fan of Ranveer Singh, but dude, awesome... the way he portrayed the character, he is one of those who can inspire a normal person towards patriotism.<br/><br/>Sanju Baba, you are a legend your aura... wow, what can I even say.<br/><br/>R. Madhavan you didn&#39;t get much screen time, but whatever you got, you performed that character beautifully.<br/><br/>I totally enjoyed watching the movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008419/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036632",
              "author": {
                "username": {
                  "text": "pradeepmmohite"
                },
                "userId": "ur26741000"
              },
              "summary": {
                "originalText": "EXCELLENT MOVIE ONLY IN THEATRICAL EXPERIENCE!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched this movie with minimum expectations because I have been watching movies in theatres at the age of 8 now I m 44 now but this movie is One of the Best THEATRICAL EXPERIENCE in my life and every department in this movie is excellent superb Aditya Dhar is a great director and every performance are top notch and Music byShashwat sachadev you can&#39;t escape from the album easily, all songs are addictive and the reality of India is shown in real way with truth just go and watch you will watch it for twice."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036632/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003338",
              "author": {
                "username": {
                  "text": "AmanR-144"
                },
                "userId": "ur211527878"
              },
              "summary": {
                "originalText": "Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is powerful and intense.<br/><br/>The story grips you, the performances feel real.<br/><br/>But the action, violence and abusing go beyond the limit sometimes.<br/><br/>It shakes you - not just emotionally, but visually.<br/><br/>A fully entertaining film, but not made for a soft heart.<br/><br/>Overall it&#39;s worth watching must watc."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003338/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017515",
              "author": {
                "username": {
                  "text": "nirbhaysharma-90901"
                },
                "userId": "ur91904927"
              },
              "summary": {
                "originalText": "A Cinematic Ride That Hits Hard & Stays Long 🎬🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched Dhurandhar and I&#39;m still not getting over it. I left the theatre in awe - this is the movie everyone has been yearning for 🎬🔥<br/><br/>Dhurandhar is not just a film. It&#39;s a thrilling, immersive experience that shakes you, pulls you in, and refuses to let go. It is a long movie, yet it never feels dull or drawn-out; every moment is gripping. The writing is razor-sharp, the screenplay masterful, and the direction fearless, raw, and grounded - creating a world that feels brutally authentic. All credit goes to the visionary genius, Aditya Dhar. You nailed it, man!<br/><br/>The archival footage from the Parliament attack and 26/11 lands profoundly, a stark reminder that behind this spy thriller lies real history, anguish, and memories our nation still carries.<br/><br/>And the performances... 😳🔥🔥\nRanveer Singh is the anchor of the film. He carries it entirely on his shoulders. He doesn&#39;t just play the character - he becomes it. His piercing, expressive eyes convey more than words ever could. Every glance, every silence, every subtle emotion lingers. He brings depth, authenticity, and ferocious intensity to the role of a spy, making you root for him completely. That line, &quot;Ghayal hoon, Isiliye Ghatak hoon&quot; - oh man, chills everywhere.<br/><br/>Akshaye Khanna dominates every frame he&#39;s in. Magnetic, commanding, captivating, and powerful, he elevates the energy and leaves a lasting imprint.<br/><br/>Sanjay Dutt accelerates the pace with his formidable screen presence. R. Madhavan and Arjun Rampal may have limited screen time but their presence is memorable and impactful.<br/><br/>The background music flows seamlessly, enhancing every beat, while the carefully placed old classics add nostalgia, charm, and unexpected emotion. Masterfully executed by Shashwat Sachdev.<br/><br/>Dhurandhar is a must-watch - raw, emotional, gripping, exhilarating, and utterly unforgettable."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017515/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008264",
              "author": {
                "username": {
                  "text": "aasfakhatoon"
                },
                "userId": "ur174384469"
              },
              "summary": {
                "originalText": "love intense political thrillers and strong dialogue-driven cinema."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film opens with an intense and gripping scene - a plane hijack by terrorists. Indian Intelligence Bureau chief goes for negotiation but is captured, and just then the heroic entry sets the tone. From this moment, the story revolves around Hamza, a character whose life takes an extremely difficult turn when he is sent to Pakistan as a spy by the Indian Intelligence.<br/><br/>Hamza lives a brutal life among gang wars and political corruption. He struggles for survival, working at a juice stall while planning to infiltrate the Rehman Balouch gang - the most powerful family in Pakistan. The Balouch family history is dark: one son supporting the rival party, and another son, Rehman, controlling power.<br/><br/>During a wedding organized by Hamza&#39;s juice stall, Rehman Balouch&#39;s elder son arrives, and his stepbrother tries to assassinate him. A younger son suddenly appears, and although Hamza fails to save the elder one, he heroically saves the younger boy. This leads to the powerful entry of Rehman Balouch, played by Akshaye Khanna. His wife&#39;s emotional slap - full of pain and rage - is one of the most satisfying scenes. Her breakdown and Rehman&#39;s silent hug made the moment incredibly real.<br/><br/>Hamza refuses reward money saying, &quot;I am Balouch. I have already lived a tough life. This was my duty.&quot; That dialogue hit hard.<br/><br/>Then enters the political uncle - a perfect depiction of a poisonous politician, like a dark snake. He forces Rehman to wait till elections and not take revenge. But Hamza convinces him that if he stays silent, he has already lost. They strike back, killing the attackers. In a shocking moment, Rehman even kills his own mother when he learns a dark secret of lineage - a brutal scene that changes everything.<br/><br/>The film heavily relies on punchlines, retro background music, and intense emotions of patriotism and betrayal. Then the heroine enters - the politician uncle&#39;s daughter, only 19, while Rehman is in his 40s. Their chemistry is emotional, not physical - not even a single adult scene, only a forehead touch conveying everything.<br/><br/>Rehman joins ISIS for selfish political power, delivering guns and bombs. The film connects to real history by showing 26/11 attacks, reminding audiences never to forget. It portrays ISIS brutality - killing Balouchi people, raping women, murdering kids. These scenes shake the soul.<br/><br/>Then comes Chaudhary Aslam, played by Sanjay Dutt - suspended for 7 years. His entry is full of raw abusive language, pure thrill. Arjun Rampal as ISI agent performs superbly.<br/><br/>Hamza becomes aggressive seeing 26/11 and plans to kill Rehman. Meanwhile betrayal unfolds - a servant involved, fingers cut brutally, and Hamza receives a video proving political conspiracy. To save his career, the politician leaks Chaudhary&#39;s base and attacks happen. Rehman joins politics, becomes powerful, but Hamza hunts him down.<br/><br/>A thrilling car-fight chase scene ends with Rehman shot in the neck. Hamza pretends to save him, sending him to hospital in an auto, but he dies. The ending clearly hints a sequel.<br/><br/>Arjun Rampal is fierce like a storm, the fight scenes, music, everything electrifying. Heroine looks innocent but stunning in party scenes. Typical Bollywood - hero can be father&#39;s age and it&#39;s okay.<br/><br/>R. Madhavan as Intelligence Chief - cold face, brilliant strategy. Before 26/11 he warns government about attacks but ignored. The film shows corruption, fake currency printing, black money, terrorist support and political betrayal.<br/><br/>The movie&#39;s spine is powerful performances:\nAkshaye Khanna, Sanjay Dutt, Arjun Rampal, the politician uncle, and Madhavan - every character sharp and unforgettable.<br/><br/>And the dialogue that stays with you:\n&quot;Ghayal hoon, isliye ghatak hoon.&quot;\nAt the end Madhavan reveals Hamza&#39;s new identity, sending him again into the field:\n&quot;Samay kitna bhi bura ho... acchi baat yeh hai ki badalta hai.&quot;\nThe entire movie structured like chapters - butterfly effect, jinn, destiny. Hard scenes, heavy emotions, patriotism, betrayal - all balanced. Not a bad film at all - actually very good. Powerful. Human. Emotional. Real.<br/><br/>My rating:(4/5)\nA must-watch for those who love intense political thrillers and strong dialogue-driven cinema."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 3
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008264/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013241",
              "author": {
                "username": {
                  "text": "Pankaj-6417"
                },
                "userId": "ur211588484"
              },
              "summary": {
                "originalText": "Baseless n spineless"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Firstly its a fiction movie and not at all based on some martyr.<br/><br/>Secondly all that mindless action just makes you go sleepy.<br/><br/>Akshay Khanna is the saving grace and\nRanveer singh muscles are the good things happening\nWhile defenders argue that the violence is &quot;unflinching&quot; and thematically justified, the sheer volume of executions, gang killings and torture scenes gradually blunts any moral point and turns suffering into spectacle."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 19,
                "downVotes": 232
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013241/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019779",
              "author": {
                "username": {
                  "text": "harshcaharma"
                },
                "userId": "ur150721277"
              },
              "summary": {
                "originalText": "Absolutely loving it"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The roar on the screen was enough, but the noise outside? That&#39;s the real entertainment. Watching the leftists and liberals scramble is pure gold. It&#39;s exactly like splashing ice-cold water on a pack of street dogs-the sudden shock, the chaotic barking, and the total desperation. I&#39;m not just watching a movie; I&#39;m watching a meltdown, and I am absolutely loving every second of it!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019779/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008184",
              "author": {
                "username": {
                  "text": "sandipkabra"
                },
                "userId": "ur77196882"
              },
              "summary": {
                "originalText": "Blockbuster"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; is one of those rare films that manages to keep the audience hooked from the first frame to the last. With a tightly woven storyline, exceptional performances, and brilliant direction, this movie delivers cinema at its finest.<br/><br/>The film&#39;s narrative is long but never once loses grip. Every sequence contributes meaningfully to the plot, keeping the tension high and the curiosity alive. The screenplay is layered, and the twists are intelligently placed-just when you think you&#39;ve understood the game, the film flips the board.<br/><br/>What truly elevates Dhurandhar is its cast. Each actor contributes depth and authenticity to their character. The lead carries the film with commanding presence, while the supporting cast complements him flawlessly. Emotional scenes land powerfully, action scenes look real, and even the quiet moments are impactful.<br/><br/>The direction deserves special applause. The filmmaker has executed a complex plot with absolute clarity and confidence. The setting, pacing, and background score merge perfectly to deliver a cinematic experience that is thrilling and thought-provoking.<br/><br/>The storyline boldly explores the hidden agendas, misinformation networks and anti-national forces, peeling back layers that many movies shy away from. It sheds light on how biased narratives and external propaganda can influence society, and it does so without losing its entertainment value. The way the film handles themes of patriotism, integrity, and national security is intense yet well-researched.<br/><br/>By the time the climax arrives, the entire theatre sits in silence - because the truth the film uncovers hits hard."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008184/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031812",
              "author": {
                "username": {
                  "text": "navreview"
                },
                "userId": "ur120266867"
              },
              "summary": {
                "originalText": "Bloody Indian Espionage Saga"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It has taken Bollywood a long long time to produce something that can be truly labelled as a thrilling espionage and all thanks to Aditya Dhar, can no longer say India produces garbage in the name of thrillers and spy movies and can definitely move from one dimensional and garbage YRF spy universe, which should not be called as a universe. This is what Indian audiences have waited for so long where a superstar is not worshipped but story has been given priority, where one man is not carrying the entire burden of the movie, but all actors whether lead or supporting actors has been portrayed magnificently. In fact Akshay Khanna was supposed to be supporting actor but overshadowed Ranveer Singh completely. What makes this movie work is not just one aspect but everything in this movie clicks at the same whether storytelling, acting or music, all works together perfectly.<br/><br/>Now eagerly waiting for second part with high hopes."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031812/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11042899",
              "author": {
                "username": {
                  "text": "kulbhushanmohit"
                },
                "userId": "ur149584773"
              },
              "summary": {
                "originalText": "A New Benchmark for Indian Political Thrillers"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a masterclass in how to blend &quot;inspired by true events&quot; storytelling with the high-stakes tension of a cinematic thriller. While officially a work of fiction, the film pulses with an authenticity that makes it feel like an undercover documentary.<br/><br/>The Gold Standard of Research\nThe secret sauce of Dhurandhar is clearly its depth of research. With significant inputs from veteran journalist Aditya Raj Kaul, the film avoids the &quot;filmy&quot; tropes usually found in Indian espionage or political dramas. Instead, it offers a granular look at strategic affairs and internal security. This realism is bolstered by character designs-faces and names-that subtly mirror real-world figures, creating an instant, relatable connection for the audience.<br/><br/>Structural Precision: Chapters of Intent\nDespite its significant runtime, the film never wavers in its momentum. This is largely thanks to a chapter-based structure.<br/><br/>Clear Objectives: Each segment has its own mission and payoff.<br/><br/>Pacing: This prevents the narrative from sagging in the middle, ensuring that the audience remains locked into the &quot;how&quot; and &quot;why&quot; of every scene.<br/><br/>Clarity: It breaks down complex political maneuvers into digestible, high-stakes goals.<br/><br/>Atmosphere and Performance\nIt is rare for a long-form movie to maintain pin-drop silence in a theater. This speaks to the immersive direction and the nuanced performances of the cast. Every actor plays their part with a grounded intensity-no one overacts, and no one is wasted. The silence of the audience is a testament to the film&#39;s ability to engage the brain as much as the pulse."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11042899/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007802",
              "author": {
                "username": {
                  "text": "nakulvpathak"
                },
                "userId": "ur78638496"
              },
              "summary": {
                "originalText": "Amazing, must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great direction by Aditya Dhar, Excellent action scenes and cinematography\nGreat acting and amazing music.<br/><br/>Great detailing.<br/><br/>Although a bit lengthy almost upto 3 and half hour , but not a minute boring. Could have been 10 15 minutes short .<br/><br/>What a great casting by the team .<br/><br/>Ranvir Singh rocks and so does akshaye khanna...\nWaiting for part 2.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007802/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003501",
              "author": {
                "username": {
                  "text": "rupalperiwal"
                },
                "userId": "ur77150212"
              },
              "summary": {
                "originalText": "Bollywood's Masterpiece!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Even though a slightly long movie, it keeps the audience engaged through amazing actions scenes, BGM and more importantly the superb acting by Ranveer Singh, Akshaye Khanna. Even supporting roles did a commendable job. Sara Arjun delivers a great performance. A MUST watch, to support the new Indian Cinema which only directors like Aditya Dhar are capable of delivering! Comparing this sort of Patriotic film with the misogynistic views movies like Animal is distasteful."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003501/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006706",
              "author": {
                "username": {
                  "text": "saimasingh-32501"
                },
                "userId": "ur197238137"
              },
              "summary": {
                "originalText": "Stars, Action, and Unforgettable Moments"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s long runtime is justified by its meticulous storytelling. Ranveer Singh&#39;s performance is intense and reflective, Sanjay Dutt&#39;s presence anchors the narrative, and Akshaye Khanna and R Madhavan deliver intelligent support. Arjun Rampal adds understated menace, and Sara Arjun brings poignancy. Aditya Dhar orchestrates suspense, action, and character arcs seamlessly. Cinematography and sound design enhance the immersive experience, and editing maintains tension throughout. By the second half, the story escalates into a thrilling, emotionally resonant crescendo."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006706/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007965",
              "author": {
                "username": {
                  "text": "RishabhS-64"
                },
                "userId": "ur211553489"
              },
              "summary": {
                "originalText": "Honest, Brutal, Engaging"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "All the supporting cast has done a top notch job. It&#39;s not a hero oriented film but rather character oriented film with all characters getting their due. Exceptionally sets up for the finale. The music has raw edge but blends beautifully with screenplay. Old songs reused in the movie are perfect with scene. Akshay Khanna has killed it and his BGM in balochistan is rage all over Social Media. Great casting overall."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007965/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010170",
              "author": {
                "username": {
                  "text": "prakharkrishnatripathi"
                },
                "userId": "ur123698996"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a high-scale espionage-crime thriller that clearly aims to be larger than life. Directed with ambition and packed with powerful faces, the film works strongly in performances and technical detailing, though it slightly stumbles in pacing and certain casting choices.<br/><br/>Ranveer Singh, as the undercover operative, delivers a powerful and intense performance. He balances restraint and aggression well, especially in emotional and action-heavy scenes. While a few patriotic-heavy dialogues feel exaggerated, his physicality and screen control become one of the film&#39;s biggest strengths and keep the narrative engaging.<br/><br/>Akshaye Khanna completely steals the show as the crime lord. His calm menace, controlled dialogue delivery, and psychological dominance make him the most memorable character in the film. He elevates every scene he appears in and is widely regarded as the strongest performance. His role gives Dhurandhar its real psychological depth.<br/><br/>Sanjay Dutt as the SP is where opinions divide. The character itself is very strong-a feared, legendary officer-but the casting feels slightly mismatched. Dutt&#39;s style feels dated for this sharp, grounded role. Actors like Manoj Bajpayee, Pankaj Tripathi, or Nawazuddin Siddiqui would have suited this character better with their natural intensity and realism.<br/><br/>R. Madhavan and Arjun Rampal give solid, dignified support, adding weight to the intelligence and power structures within the story. The child actor adds emotional depth and a strong human connection to the film.<br/><br/>The music and background score are major highlights. They elevate action scenes, emotional moments, and tension beautifully. Several tracks leave a lasting impact even after the film ends. The jump cuts and chapter-style editing work brilliantly in high-energy sequences but feel abrupt during emotional transitions.<br/><br/>The biggest weakness remains the long runtime and uneven pacing, especially in the second half. Still, Dhurandhar stands as a stylish, performance-driven, and powerful big-screen experience.<br/><br/>The film often leans into loud ideological and hyper-dramatic expression instead of subtle psychological tension. This reduces interpretive depth and may disengage viewers who prefer layered, understated thrillers."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010170/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005689",
              "author": {
                "username": {
                  "text": "HollyGolightly123"
                },
                "userId": "ur44660749"
              },
              "summary": {
                "originalText": "Bigger Bolder but not better movie from Dhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A film from the maker of Uri - arguably one of India&#39;s finest war/mission movies - naturally raises sky-high expectations. Sadly, Dhurandhar doesn&#39;t live up to them.<br/><br/>What we get is a full-throttle action spy thriller that&#39;s all muscle and very little heart. It&#39;s so aggressively macho that it often tips into corniness. The characters, loosely inspired by real-life figures, are inherently fascinating, and weaving fictional gang wars, betrayals and political intrigue with actual historical events is a smart touch. Yet the plot itself feels painfully familiar - we&#39;ve seen this cocktail many times before.<br/><br/>The casting is stellar on paper, but the performances remain merely serviceable. The single biggest crime, however, is the bloated 3-hour-32-minute runtime. Huge chunks are spent on sluggish character introductions, pointless chapter breaks, a completely gratuitous item song, and endless slow-motion shots that add zero impact could have been trimmed without losing a thing.<br/><br/>The romantic track neither distracts nor convinces, though it does serve the story to some extent.<br/><br/>With tighter editing and a little more emotional depth, Dhurandhar could have been a gripping thriller. As it stands, it&#39;s a disappointing follow-up. For now, Uri remains the superior film by a wide margin."
                }
              },
              "authorRating": 4,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 6,
                "downVotes": 52
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005689/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11069925",
              "author": {
                "username": {
                  "text": "danishshaikh-05891"
                },
                "userId": "ur85298606"
              },
              "summary": {
                "originalText": "One way to show the terrorism history in india"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Having viewed the film on three occasions, I am consistently impressed by Aditya Dhar&#39;s directorial prowess; I believe he is poised to significantly innovate Indian cinema. The ensemble cast delivers exceptional performances, with each character contributing meaningfully and making a substantial impact on the narrative. The musical score further enhances the overall cinematic experience.<br/><br/>Seriously I cannot wait for the 2nd part."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11069925/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007860",
              "author": {
                "username": {
                  "text": "Apeksha_Shah"
                },
                "userId": "ur163268425"
              },
              "summary": {
                "originalText": "A Cinematic Thunderbolt!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar&#39;s &#39;Dhurandhar&#39; isn&#39;t just a movie, it&#39;s a monumental cinematic event that redefines the spy-thriller genre in Indian cinema. Running at over three and a half hours, it&#39;s a testament to gripping storytelling, where every minute is earned, every plot turn is impactful, and every performance is a masterclass.<br/><br/>Akshaye Khanna as the formidable crime lord, Rehman Baloch, absolutely steals every scene he&#39;s in.<br/><br/>Ranveer Singh delivers the performance of his career as Hamza/Jaskirat. His transformation into a ruthless, deeply conflicted undercover agent is total. He&#39;s feral, electric, and utterly brilliant, inhabiting the role with a level of intensity and physical prowess we&#39;ve never seen from him. His eyes convey the weight of his mission.<br/><br/>R. Madhavan is pitch-perfect as the deeply troubled, Ajit Doval-inspired Intelligence Bureau Chief, Ajay Sanyal, the mastermind behind Operation Dhurandhar.<br/><br/>Sanjay Dutt and Arjun Rampal are phenomenal, bringing grit and menace to their respective roles.<br/><br/>A special mention must go to Rakesh Bedi, whose transformation into a menacing, opportunist politician is a revelation.<br/><br/>Also, The background score of this movie, primarily crafted by Shashwat Sachdev, is nothing short of a sonic marvel and is arguably the best BGM for an Indian action-thriller in years. It functions not just as accompaniment, but as a relentless, pulsating character in the film itself.<br/><br/>Lastly, To Aditya Dhar &amp; the entire cast, and the crew: Thank you for daring to dream this big. This film is a monumental achievement in technical excellence, storytelling ambition, and raw emotional power. You have given Indian cinema a new high-water mark to strive for. The hard work and dedication of every single person involved shines through every frame."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007860/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001509",
              "author": {
                "username": {
                  "text": "RammadhavS"
                },
                "userId": "ur201616567"
              },
              "summary": {
                "originalText": "This is Art"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie was soo damn Marvellous .This is the Real Indian Cinema .The Action Sequences, The Cinematography, The Visuals and One above all was the acting by the cast each and everything was perfect in the movie . Either its Arjun Rampal and Akshay Khanna or Ranveer Singh and R Madhavan each and everyone killed there roles . The way the movie was presented I have become a huge fan of Aditya Dhar and the whole cast .The Glimses they showed of the second part in the end of the movie gave everyone in the theatre Goosebumps the second part is gonna be a massive beast eagerly waiting for it . Now Being a movie enthusiast I must say this movie is a 10/10 Smash."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001509/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006925",
              "author": {
                "username": {
                  "text": "imdbfan-0757377262"
                },
                "userId": "ur198702001"
              },
              "summary": {
                "originalText": "A Movie Full of Heart and Thrills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every sequence in the film is meticulously crafted, combining suspense, action, and emotion. Ranveer Singh delivers a layered, compelling performance, navigating moral dilemmas and high-stakes action. Sanjay Dutt exudes gravitas, while Akshaye Khanna and R Madhavan provide understated yet impactful performances. Arjun Rampal&#39;s menace enhances tension, and Sara Arjun&#39;s emotional depth heightens the stakes. Aditya Dhar&#39;s direction balances plotting, suspense, and thrilling action. Cinematography captures both vast cityscapes and intimate moments, while the score accentuates tension. The second half escalates to a breathtaking finale of adrenaline and emotion."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006925/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007934",
              "author": {
                "username": {
                  "text": "dhavalmehtagst"
                },
                "userId": "ur190638601"
              },
              "summary": {
                "originalText": "Best movie and cast ever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What a movie! This has to be one of the best movies ever produced and delivered in Indian cinema! This movie shows the real resilience of India, as a country, and the constant torture of the most rouge country in the world! Salute and can&#39;t wait do the part two to come out! Amazing performance by everyone including Ranveer Singh, Akshaye Khanna!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007934/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036530",
              "author": {
                "username": {
                  "text": "I_am_Feeling_Good"
                },
                "userId": "ur158468814"
              },
              "summary": {
                "originalText": "The Power of a Director"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is raw, intense, and deeply affecting Powerful performances, tight screenplay, and restrained direction elevate the film.<br/><br/>The cinematography and background score amplify the emotion without overpowering the narrative. A film that stays with you long after it ends - pure, uncompromised cinema.<br/><br/>Had an absolutely delightful experience watching this kind of a beast, thanks Aditya Dhar for this magnum opus."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036530/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006965",
              "author": {
                "username": {
                  "text": "Aarav2191"
                },
                "userId": "ur199122560"
              },
              "summary": {
                "originalText": "Heartfelt Drama Wrapped in Cinematic Chaos"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening frame, the film throws the audience into a meticulously built world of danger and moral ambiguity. Ranveer Singh dominates with a layered performance, showing both vulnerability and calculated aggression, whether in tense negotiation scenes or adrenaline-fueled chases. Sanjay Dutt&#39;s commanding presence adds gravitas, his every line charged with authority and menace. Akshaye Khanna and R Madhavan contribute with intelligence and subtle tension, enhancing the story&#39;s complexity. Arjun Rampal&#39;s quiet menace lingers in every frame he inhabits, while Sara Arjun&#39;s emotive sequences provide the human heart to the narrative. Aditya Dhar&#39;s direction is precise, blending intricate plotting with visually stunning, high-octane action. The cinematography captures both the chaos of Karachi&#39;s underworld and intimate emotional beats, while the score heightens suspense without overwhelming the scenes. Every twist in the second half feels earned, leading to a finale that is both thrilling and deeply resonant, leaving audiences breathless."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006965/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011233",
              "author": {
                "username": {
                  "text": "vikasssaraswat"
                },
                "userId": "ur85199610"
              },
              "summary": {
                "originalText": "Excellent Classic Thriller action movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Factually very close\nCast, acting, background, sets, music, bgm - All excellent<br/><br/>All Indians will love it\nCinema lovers will adore it<br/><br/>Pakistan lovers stay away<br/><br/>Best acting: Akhshay Khanna, Arjun Rampal, Rakesh Bedi.<br/><br/>What a great thriller with great realistic action, no fake heroism, story is well written, could have been little better<br/><br/>You will not realise when 3 and half hours are gone. Eagerly waiting for second part."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011233/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006401",
              "author": {
                "username": {
                  "text": "j-85283"
                },
                "userId": "ur188287936"
              },
              "summary": {
                "originalText": "A Cinematic Rush of Stars and Strong Storytelling"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every second of this story is packed with tension, strategy, and cinematic detail. The lead carries the emotional and physical weight of the film effortlessly, making morally complex decisions feel real and relatable. Action sequences are both thrilling and narratively purposeful, with each movement reinforcing character traits and story beats. Supporting performances add depth, creating a fully realized world that feels alive and dangerous. The screenplay balances intimate human moments with sweeping geopolitical stakes, keeping the audience fully invested. Visuals are meticulously framed, capturing chaos and calm in equal measure. The soundtrack enhances every twist and turn, punctuating suspense without overpowering it. The conclusion is both shocking and inevitable, leaving a lasting impression of a film that challenges expectations while delivering pure cinematic adrenaline."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006401/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}