{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6pcrntazcwzy47wwxfnzvr3rm4aj53endb7pfaxbomqbdf4skydk3oy2f5njyodgsvu3otpu2oenpij3eacyyni6a",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11007641",
              "author": {
                "username": {
                  "text": "viratkohliera"
                },
                "userId": "ur118088155"
              },
              "summary": {
                "originalText": "Stars, Action, and Pure Entertainment"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The tension in this film is palpable from the opening scene, driven by a narrative that rewards patience and attention to detail. Ranveer Singh embodies the lead role with magnetism, his subtle expressions conveying a storm of internal conflict. Direction by Dhar expertly balances sprawling action sequences with intimate character moments, ensuring that no scene feels disposable. The pacing, though deliberate, never sags, and the film&#39;s visual language captures the grit and beauty of urban landscapes in equal measure. Supporting actors contribute memorably, each with motivations that feel lived-in and authentic. The climax delivers both shock and catharsis, reflecting the moral complexities established earlier. Cinematography, editing, and sound design coalesce to create a tense, immersive atmosphere. By the final frame, the story resonates long after leaving the theater, cementing its place as a standout cinematic achievement."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007641/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013813",
              "author": {
                "username": {
                  "text": "VeeV-95"
                },
                "userId": "ur211592083"
              },
              "summary": {
                "originalText": "DHRNDHR"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Top class stuff. Ranveer brilliant. Akshay sensational. Movie feels like a breeze. Doesnt feel like a 3.5 hr film. Totally blown away!<br/><br/>Story is tight, no boring moments.<br/><br/>Acting is top-notch, especially the lead.<br/><br/>Action scenes look real and raw.<br/><br/>Background music gives goosebumps.<br/><br/>Full paisa vasool, highly recommended!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013813/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006909",
              "author": {
                "username": {
                  "text": "vikasrajpoot-36438"
                },
                "userId": "ur135472159"
              },
              "summary": {
                "originalText": "Best spy film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The best spy film ever made in Indian cinema.<br/><br/>Worth watching.<br/><br/>Top notch performances of every actor specially Khanna Sir and Ranveer.<br/><br/>Dont miss it otherwise you will regret.<br/><br/>Dhurandhar roars onto screens like a thunderbolt, blending espionage grit with patriotic fire! Ranveer Singh as the undercover maestro is electric-raw, relentless, channeling Doval&#39;s daring with swagger that chills and thrills. Aditya Dhar&#39;s direction weaves real events (IC-814 hijack, Parliament attack) into a taut narrative, where shadows hide betrayals and every twist punches the gut.<br/><br/>Akshaye Khanna&#39;s steely IB chief and Sanjay Dutt&#39;s gritty Chaudhary Aslam steal scenes, while Sara Arjun&#39;s Yalina adds heart amid the chaos. Action sequences? Viciously visceral-fistfights in Karachi alleys feel bone-crunching real, VFX seamless. Score pulses with suspense, cinematography paints a brooding underworld.<br/><br/>At 3.5 hours, it demands commitment but repays with epic payoff. A landmark thriller that salutes unsung heroes-bold, immersive, unmissable! 10/10. Can&#39;t wait for Part 2!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006909/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007131",
              "author": {
                "username": {
                  "text": "rameshlaad"
                },
                "userId": "ur118086356"
              },
              "summary": {
                "originalText": "Edge-of-Your-Seat Action and Emotion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses audiences in a high-stakes, morally ambiguous universe. Ranveer Singh anchors the narrative with a masterful performance, portraying internal conflict alongside physically demanding action sequences. Sanjay Dutt adds authority and tension, while Akshaye Khanna and R Madhavan enrich the ensemble with subtle, impactful performances. Arjun Rampal&#39;s menace keeps the audience on edge, and Sara Arjun&#39;s emotional portrayal raises the narrative stakes. Aditya Dhar orchestrates suspense, strategy, and visually compelling action seamlessly. Cinematography captures chaos and intimate moments alike, while the score punctuates tension. By the climax, all narrative threads converge in a thrilling, emotionally resonant finale."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007131/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11032514",
              "author": {
                "username": {
                  "text": "vamsikiran-pvh"
                },
                "userId": "ur49542544"
              },
              "summary": {
                "originalText": "Ultimate Spy Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A superb Bollywood movie after a long time. Each and every scene gives high octane. Ranveer and Akshay excelled in their roles. Sanjay Dutt in his limited role performed well. Aditya Dhar&#39;s direction is top notch. He is going to be one of the top directors soon. Flillerachi and other songs were situational and good. Best Bollywood movie of 2025. Must Watch!!"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032514/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012590",
              "author": {
                "username": {
                  "text": "praveenraghav-93129"
                },
                "userId": "ur150677302"
              },
              "summary": {
                "originalText": "Must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The cast, storyline, music, everything is near to perfect. Just go and watch. It will stay with you for a long time. This movie will bind to you to itself from the very beginning and you will try not to miss even a single scene or dialogue. It will be a thrilling journey from beginning till end and you will wish it to never end."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012590/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015976",
              "author": {
                "username": {
                  "text": "Satviks-77"
                },
                "userId": "ur211607093"
              },
              "summary": {
                "originalText": "The best movie of 2025 pure testosterone"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Whoever is reading this go and watch the movie again please. This is the movie I watch for the first time 3 times like my dad watched it he never watches any films go watch damn it this is pure nationalism( completeing the character after this) housing Rossini Rome Rico evil Chevy so fun do Dino did Rubi rai rock bush co coco exotic dish box fix cell vital Vivek buck rib back can boss bus close body best bit kit bluff Biden box."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015976/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006446",
              "author": {
                "username": {
                  "text": "AmitS-1304"
                },
                "userId": "ur203344226"
              },
              "summary": {
                "originalText": "All time best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From start to finish, Dhurandhar keeps you glued to the screen. The director orchestrates a multi-layered story with precision, balancing suspense, politics, and personal drama. The lead actor delivers a nuanced performance, effortlessly portraying moral dilemmas and inner conflict. The female lead adds depth with her subtle expressions, making her character memorable. Supporting actors are given room to breathe, adding richness to the narrative. The action sequences are expertly choreographed, blending intensity with realism. The cinematography captures every emotion, every strategy, and every subtle shift in tension. Music and BGM complement the narrative perfectly. Dhurandhar is not just a film, it&#39;s a masterclass in direction and acting synergy."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006446/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007160",
              "author": {
                "username": {
                  "text": "AjayS-699"
                },
                "userId": "ur203912309"
              },
              "summary": {
                "originalText": "The film that never slows down and never steps back"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Each sequence is crafted to heighten suspense, combining character development, political intrigue, and explosive action. Ranveer Singh delivers a powerhouse performance, embodying moral ambiguity and intense focus with natural ease. The supporting actors provide grounded performances that make the stakes feel tangible and urgent. Director Dhar orchestrates the pacing, action, and tension masterfully, ensuring no moment feels wasted. Cinematography and lighting work in tandem to accentuate both chaos and quiet reflection. The film&#39;s score enhances emotional beats and dramatic sequences alike, leading to a climax that is both breathtaking and deeply satisfying."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007160/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013471",
              "author": {
                "username": {
                  "text": "Akash-9830"
                },
                "userId": "ur211590315"
              },
              "summary": {
                "originalText": "Loved it"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Loved the movie, the actings, directions, and everything..\nEveryone should watch this movie and know the true realities of how bollywood shows the things and what exactly is the actual realities...\nMake it blockbuster for the entire 2025 and we may see more such movies intt tthe comming futures....\nmake it super blockbusters."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013471/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004137",
              "author": {
                "username": {
                  "text": "singhashwni-75946"
                },
                "userId": "ur163354114"
              },
              "summary": {
                "originalText": "BEST SPY ESPIONAGE MOVIE"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "HONESTLY THE BEST SPY ESPIONAGE MOVIE EVER MADE IN INDIA. Aditya dhar really cooked this time 😭💗From the first frame to last frame we can see his vision and indeed he is one of the best director of bollywood. The film is 3hr and 34 minutes long but it won&#39;t bore you for a second and when the movie ends you want more of it ...\nEveryone has given their best in the movie. Arjun rampal ,r madhvan and sanjay dutt have a lesser role in the movie but whenever they come on the screen they made the movie 10 times better and ranveer singh have acted so well throughout the movie but his acting in last 20 min and that 26/11 scene was something else 🔥\nAnd obviously the man who deserve the most credit after Aditya dhar is shashwat sachdev ...those bgm using retro songs and all the songs of the movie are fire especially when akshay khanna go to baloch (I am obsessed with it )<br/><br/>AND FINALLY MY FAV AKSHAY KHANNA JUST NAILED HIS ROLE. WHENEVER HE CAME ON SCREEN HE WAS PURE AURA FARMING .<br/><br/>⭐ 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004137/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010112",
              "author": {
                "username": {
                  "text": "tusharoct"
                },
                "userId": "ur120903840"
              },
              "summary": {
                "originalText": "⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐ 10/10 TITLERaw, Brutal, and Absolutely Unmissable - The \"Godfather\" of Spy Thrillers!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I just walked out of the theater, and I am trembling. If you thought &quot;Uri: The Surgical Strike&quot; was the peak of modern Indian war films, get ready to have your mind blown. &quot;Dhurandhar&quot; is not just a movie; it is an experience that grabs you by the throat in the first minute and doesn&#39;t let go for 3 hours and 34 minutes.<br/><br/>1. Ranveer Singh is a Force of Nature\nForget the flamboyance; this is Ranveer stripped down to raw nerve and grit. He delivers a career-best performance that is haunting, intense, and terrifyingly real. You don&#39;t see the star; you only see the agent. His eyes speak volumes in the silent moments. This performance will be studied in acting schools.<br/><br/>2. The &quot;Avengers&quot; of Acting\nThe casting director deserves an award.<br/><br/>* Akshaye Khanna brings that sharp, intellectual intensity that only he can.<br/><br/>* R. Madhavan is chillingly brilliant.<br/><br/>* Arjun Rampal and Sanjay Dutt add a weight and menace that elevates the stakes.<br/><br/>Every time these titans share the screen, the tension is suffocating.<br/><br/>3. Action That Hurts\nThe &#39;A&#39; rating is completely justified, and thank god for it! The action isn&#39;t the flying-car masala style; it is bone-crunching, bloody, and messy. It feels dangerous. You feel every punch and every bullet. It respects the audience&#39;s intelligence by showing the true cost of war and espionage.<br/><br/>4. A Masterclass in Direction\nAditya Dhar proves he is the best in the business when it comes to high-stakes thrillers. The pacing is miraculous-despite being nearly 3.5 hours long, there is not a single dull moment. The screenplay weaves complex history (IC-814, Parliament attacks) into a narrative that is easy to follow but emotionally heavy.<br/><br/>5. Technical Brilliance\nThe background score is thunderous yet emotional. The cinematography captures the gloom of the underworld and the dust of the battleground with equal beauty.<br/><br/>Verdict:\nDo not wait for OTT. This film demands the biggest screen and the loudest speakers you can find. It is patriotic without being jingoistic, violent without being gratuitous, and emotional without being melodramatic.<br/><br/>Dhurandhar is a masterpiece."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010112/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008686",
              "author": {
                "username": {
                  "text": "shahveer-58252"
                },
                "userId": "ur121993846"
              },
              "summary": {
                "originalText": "Dhar knows how to do spy movies right"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Actual spy drama, showing the struggle of leaving your behind and adopting a fake identity. The struggle of fitting into a life that doesn&#39;t belong to you. Dhar shows the actual cruelty and the reality of the underworld and the political nexus, and the entire terrorism machinery. The movie is absolutely brutal and full of gore, yet it will make you watch all of it. Its a long movie yet no scene feels stretched or slow."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008686/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026746",
              "author": {
                "username": {
                  "text": "BansariP-56"
                },
                "userId": "ur211693963"
              },
              "summary": {
                "originalText": "The best movie I watched after very long time"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched Dhurandhar yesterday, and it&#39;s one of those films that keeps you completely hooked-there&#39;s literally no moment where your attention drifts. The pacing is tight, the tension is constant, and every scene pushes the story forward with purpose.<br/><br/>What really makes Dhurandhar powerful is how openly it links terror attacks on India to political decisions made during the UPA government era. The film presents a clear viewpoint, showing how weak policies, delayed decisions, and compromised national security frameworks created vulnerabilities that were later exploited by terrorist forces. It doesn&#39;t shy away from naming mistakes or questioning accountability, which gives the narrative a bold and unapologetic edge.<br/><br/>The screenplay is sharp and focused, with revelations that feel impactful rather than sensational. The direction ensures the message is delivered clearly while still maintaining the thrill of an espionage drama. Performances are intense and convincing, adding emotional weight to the political and security-related themes.<br/><br/>Overall, Dhurandhar is more than just a thriller it&#39;s a hard-hitting political commentary wrapped in a gripping cinematic experience. It makes you think, question, and reflect long after the film ends. Definitely a must-watch if you appreciate serious films that combine national security, politics, and suspense without playing safe."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026746/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004719",
              "author": {
                "username": {
                  "text": "monark-rathod"
                },
                "userId": "ur55670016"
              },
              "summary": {
                "originalText": "Awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is truly a &quot;Real Spy Thriller.&quot; While the premise is widely known-an Indian spy enters Pakistan and brings them to their knees-the execution is spectacular.<br/><br/>Aside from the slightly long runtime, every department did a fabulous job, from cinematography and acting to dialogue and art direction. Aditya Dhar has proven himself once again; after Uri, he continues to show us what real cinema and true patriotism look like. Ignore the baseless negative reviews spreading online; this film is grounded in realism.<br/><br/>The Performances:\nRanveer Singh is back with a bang, proving his mettle once again. However, Akshaye Khanna, Bollywood&#39;s most underrated actor, completely steals the show. R. Madhavan, Sanjay Dutt, and Arjun Rampal are also at their absolute best.<br/><br/>The Music &amp; Rating:\nThe music is the heart of the film, ensuring it never feels boring despite the length. The movie was released with an &quot;A&quot; certificate, but honestly, it deserves an &quot;A+&quot; for its brutality and strong language-so definitely keep children away.<br/><br/>If you are a fan of serious spy thrillers, go watch this extremely well-directed film. Mission &quot;Dhurandhar&quot; continues from March 19, 2026."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004719/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008818",
              "author": {
                "username": {
                  "text": "SharmilaS-314"
                },
                "userId": "ur208187296"
              },
              "summary": {
                "originalText": "MODERN MASTERPIECE CINEMA"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great movie aura farmer akshay khanna best.<br/><br/>Now we haven&#39;t seen this before , nowdays movies are not like this they are mirch masala movie to masses like pushpa 2 . But this movie is totally different experience .they not only focuses only on main hero but also other characters all have performed well good. Haters will be crushed after this ."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008818/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013754",
              "author": {
                "username": {
                  "text": "Sureshk-2696"
                },
                "userId": "ur211591713"
              },
              "summary": {
                "originalText": "Must & should watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch movie and shame on war2, phatan, tigar etc.<br/><br/>&#39;Dhurandar&#39; is an indian realistic spy movie... What a movie...👏👏👏 Ultimately superb and utmost realistic.<br/><br/>Director took us through the streets of Karachi and depicted the reality of espionage and their sacrifice.<br/><br/>Bollywood should open their eyes and listen the heart beat of indians and what they want really."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013754/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016113",
              "author": {
                "username": {
                  "text": "Ritikm-35"
                },
                "userId": "ur208312084"
              },
              "summary": {
                "originalText": "Superb Masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The Movie Exposed the Real face of Pakistan and beautifully picturized. I really like how the entire movie is divided in several chapters so everyone in the audience who don&#39;t much about the Pakistanis and their terror nexus can easily understand how pakistanis are plotting terror attacks on indians from decade&#39;s."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016113/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011038",
              "author": {
                "username": {
                  "text": "SamarthV-59"
                },
                "userId": "ur211571554"
              },
              "summary": {
                "originalText": "JHAKAASSS!!!, NEXT LEVEL MOVIE"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "New era defining action-thriller movie!, Must watch masterfully made, next level Music, casting, Cinematography, editing, set work, artists, storyboarding, Just cinematic experience, Don&#39;t listen to negative reviews, just watch. Stunning visuals. Must watch. No bakwas no show, as much as realistic as possible."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011038/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007103",
              "author": {
                "username": {
                  "text": "soumyasinghk"
                },
                "userId": "ur196194707"
              },
              "summary": {
                "originalText": "A narrative painted with passion, movement, and might"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar grips the audience through its relentless realism and multi-layered storytelling. Ranveer Singh&#39;s portrayal of Hamza is magnetic, blending inner turmoil with tactical brilliance. Director Dhar exhibits command over pacing, ensuring tension never wanes despite the expansive runtime. The action sequences are meticulously choreographed, balancing brutality with cinematic elegance. Supporting actors provide a believable texture to the criminal underworld, making every interaction consequential. Combined with a suspenseful score and atmospheric cinematography, the film transcends traditional crime dramas to deliver a sophisticated cinematic experience."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007103/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013736",
              "author": {
                "username": {
                  "text": "MithunP-22"
                },
                "userId": "ur211591566"
              },
              "summary": {
                "originalText": "Absolutely Fantastic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar delivers exactly what it promises an intense, well acted drama that holds its ground from start to finish. Despite its long runtime, the film rarely feels stretched; the storytelling stays engaging, and the performances are strong enough to keep you invested throughout. Yes, a couple of unnecessary songs slow the tempo, but they never derail the core narrative.<br/><br/>What truly elevates Dhurandhar is its cast. Every major performer brings weight and conviction to their role, grounding the film&#39;s emotional undercurrent. The characters don&#39;t feel like stock archetypes they feel lived in, shaped by decades of pain, loss, and resilience. That authenticity is the film&#39;s strongest asset.<br/><br/>Beyond craft, Dhurandhar stands out for something larger: its willingness to present an uncompromised Indian perspective on the long history of suffering caused by cross-border terrorism. For decades, the country has witnessed the consequences of Pakistan-backed militant activities, and this film does not shy away from confronting that reality. It brings the narrative back to the victims, the families, the soldiers, and the ordinary people who have paid the price.<br/><br/>India needs more films like this stories that aren&#39;t afraid to articulate our own experiences and trauma, stories that depict our side of history with honesty and emotional clarity. Dhurandhar succeeds not just as cinema but as a statement, one that resonates long after the credits roll."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013736/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11050315",
              "author": {
                "username": {
                  "text": "wahabhbk"
                },
                "userId": "ur84905017"
              },
              "summary": {
                "originalText": "India Is An Ex GF Of Pakistan, Plz Move On 🙏"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Hello Indians, I just watched the movie Dhurandhar. I was curious about what kind of film it would be, so after watching it, I&#39;m writing my review.<br/><br/>(India is like an ex-girlfriend of Pakistan who still hasn&#39;t been able to move on after the breakup.)\nIf this movie is being called &quot;time-pass&quot; or &quot;entertainment,&quot; then Indians should honestly be ashamed of a mentality that takes a completely fictional story as reality. Rehman Dakaith, who was nothing more than a local gangster from Lyari Town in Karachi, is somehow made responsible for the 26/11 attacks 🤣-and on top of that, an entire nation is shown hating Rehman Dakaith for it 👏.<br/><br/>Maybe in India it&#39;s possible for a street criminal to say this to an intelligence officer: &quot;Rehman Dakait ki di huyi maut badi kasayinuma hoti hai.&quot;\nBrother, if anyone said something like that in Pakistan, zabaan se poncha lagwayenge yeh.<br/><br/>We do not wear half-sleeve kameez. There is no gun factory in Lyari Town. I have personally lived in Lyari Town since childhood.<br/><br/>And no-we don&#39;t say &quot;adaab,&quot; brother.<br/><br/>Give Akshaye Khanna an Oscar 🤣🤣🤣.<br/><br/>What a hilariously delusional nation 🤣🤣🤣."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11050315/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010046",
              "author": {
                "username": {
                  "text": "KumarA-1484"
                },
                "userId": "ur211564852"
              },
              "summary": {
                "originalText": "You know who is gonna hate this movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshay is Good in his role, Ranveer Singh&#39;s character demands to hide under the hood of Akshay&#39;s character. Rakesh Sir is a good actor who brings some humor to this serious-toned movie. The age of the female actress is intentionally there. Sanjay Dutt could do better. Arjin&#39;s look and acting are killing. The story is well written, no bogus things are included, and the music is outstanding. Must watch. Please, Bollywood, keep making these kinds of bold and logic movies."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010046/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015064",
              "author": {
                "username": {
                  "text": "ArjunA-1116"
                },
                "userId": "ur208094125"
              },
              "summary": {
                "originalText": "Dhurandar<<<<<<<<Whole Spy univers"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best movie seen from Bollywood in this category. This is kind of movie that will make you feel the real horrific scenes what our Brave spy faces,and the dark side of Indian politics,The roles played by all the actor in favoulas way ,from hero to villan , every character has its own uniqueness. Best movie from Bollywood of the year."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015064/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006533",
              "author": {
                "username": {
                  "text": "rinkirani-53385"
                },
                "userId": "ur185005587"
              },
              "summary": {
                "originalText": "The Roar of Action, The Pulse of Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Each frame of the movie reflects careful craftsmanship, from the meticulous pacing to the atmospheric visuals. Ranveer Singh delivers a performance that is both commanding and subtly vulnerable, bringing layers to the character. Director Dhar orchestrates action with narrative intent, ensuring every fight and chase sequence advances the story. Supporting cast performances add authenticity, making the world feel lived-in. The cinematography and sound design combine to create a cinematic experience that is immersive, intense, and unforgettable."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006533/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}