{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4v6pcjsqyxdo6ic66uhrmzurxqmwarz2iotz67kdpj3qflanes26c26oi2e7w4khz725lwn6in2mrurnb7kq3f4",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11024883",
              "author": {
                "username": {
                  "text": "vasudhachada"
                },
                "userId": "ur123759217"
              },
              "summary": {
                "originalText": "THE DHURANDHAR OF BOLLYWOOD!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "When someone does anything with right intentions, honest and truth. Nature also will help you and everything will fall in right place. This happened with Dhurandhar. The real hero is a Spy who sacrifices everything for a nation. People should understand this and start celebrating them. Nation comes first. The violence, long runtime nothing bores this movie. Still feels movie ended so fast. Ranveer Singh really stole my heart as a spy. Waiting for part 2. The music is top notch. Everyone should watch this movie in theaters. Support this True movie so that others will take more true movies."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024883/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016233",
              "author": {
                "username": {
                  "text": "officialkingayush"
                },
                "userId": "ur175002176"
              },
              "summary": {
                "originalText": "Change for the indian spy cinema scene"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watching Dhurandhar felt like cinematic electricity - exactly the kind of film that reminds you why you go to the movies. The way Ranveer Singh&#39;s character blends into the gritty gang world of Rehman Dakait (as fictionalized in the film) is brilliant - he&#39;s not the flashy hero, but the silent, calculating agent whose quiet presence anchors the entire story. As you said: everything felt &quot;perfect.&quot; That immersive underworld, the tension, the danger - it all felt real.<br/><br/>But the real thunderbolt of the movie is Akshaye Khanna. His portrayal of Rehman Dakait is magnetic. Every time he enters a scene, the energy changes. His aura - from cold menace to unpredictable violence - is so potent that it lifts the film beyond a typical thriller. Critics too called his performance a &quot;masterclass,&quot; and many agree that he steals virtually every moment he&#39;s on screen.<br/><br/>The supporting cast - including veterans like Sanjay Dutt and Rakesh Bedi - also deliver solid performances. Bedi&#39;s character - a crafty politician - adds depth and unpredictability to the underworld-politics game. The side characters, as you felt, are all &quot;dhansu&quot; - they don&#39;t feel like padding but actual players in this dangerous world. Overall, the ensemble works as a tightly-knit gang: each adds flavour, weight, and intensity.<br/><br/>From a technical point of view, the direction by Aditya Dhar deserves huge credit. The world-building - recreating the gang-ridden underbelly, the political machinations, the moral ambiguities - is immersive and textured. The film unfolds like a raw gangster saga rather than a typical glam Bollywood thriller. The background score and music complement the vibe, amplifying every moment of tension, betrayal or brutality.<br/><br/>Of course - and even critics agree - the film isn&#39;t without flaws. At nearly 3.5 hours, it drags slightly in the second half. Some scenes linger a bit too long, and a few subplots seem set up more for future installments than satisfying resolution now. But for you - and clearly many fans - that&#39;s a small price to pay for such a powerful, engrossing ride.<br/><br/>In short: Dhurandhar delivered - and then some. What you described as &quot;every character being dhansu,&quot; the gritty atmosphere, the perfect blend of Ranveer&#39;s undercover calm and Akshaye&#39;s killer aura - all of that came together to create one of the most enthralling Bollywood thrillers in recent years. I&#39;d echo your verdict: 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016233/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044392",
              "author": {
                "username": {
                  "text": "Jerallinyumnam"
                },
                "userId": "ur211840519"
              },
              "summary": {
                "originalText": "Fight"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film is good, watching it is very enjoyable. The action looks very real. The story is also enjoyable. I couldn&#39;t watch the part where Akshay Kumar brutally killed people by holding a stone, because it looked too real. Ranveer&#39;s action is also good. 👍👍👍👍👍 I know that this action will make me feel so uncomfortable about myself that I will close my eyes. Real action."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044392/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023599",
              "author": {
                "username": {
                  "text": "shubhraaggarwal"
                },
                "userId": "ur94793591"
              },
              "summary": {
                "originalText": "Dhurandhar: Naming the Unnamed, Showing the Unshown"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watched Dhurandhar recently - a film I believe was long overdue. It powerfully captures critical events from Indian history, especially those that much of the international media chose to underplay, often avoiding naming the real perpetrators.<br/><br/>What stands out is the way the story unfolds the journey of an Indian officer determined to neutralise some of the deadliest terrorists on their own soil. The narrative is gripping and unapologetic, rooted firmly in the complex geopolitical realities of the subcontinent - realities shaped by proxy wars, cross-border terrorism, and strategic silence on the global stage.<br/><br/>The director has done complete justice to the subject, and the casting director deserves special praise for handpicking actors who fit their roles to perfection. A special mention for the background score - what music! It elevates every scene and adds immense emotional weight to the storytelling.<br/><br/>That said, I do feel this film could be a lot to take in for viewers who are not well-versed with the geopolitical and historical context. Perhaps a full-fledged series would have allowed even deeper exploration. But for someone like me, who follows this subject closely, I lived every bit of it.<br/><br/>Now eagerly waiting for the second chapter in March. Kudos to the makers and the entire cast for telling this story with such conviction and courage."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023599/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008311",
              "author": {
                "username": {
                  "text": "Arpit-358"
                },
                "userId": "ur211555572"
              },
              "summary": {
                "originalText": "Once in a lifetime movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ohh myy god..what did i just watched..the best spy movie made by bollywood and hard hitting facts about corrupt previous govt. Makes you eyes wide open. Aditya Dhar cooked really well when it came to casting..every character was so well written and power pack performance was delivered by every actor."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008311/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006768",
              "author": {
                "username": {
                  "text": "Rijwan23"
                },
                "userId": "ur198244073"
              },
              "summary": {
                "originalText": "Cinematic Fireworks From Start to Finish"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is deliberate, unfolding like a slow-burning fuse that explodes in the second half. Ranveer Singh dominates the screen, delivering a layered performance full of moral complexity and emotional subtlety. Sanjay Dutt&#39;s presence adds a tangible sense of gravitas and danger. Akshaye Khanna and R Madhavan enrich the ensemble, giving the story depth and credibility. Arjun Rampal&#39;s controlled menace creates a constant sense of unease, while Sara Arjun&#39;s scenes are quietly heartbreaking, highlighting the cost of the narrative&#39;s high stakes. Aditya Dhar&#39;s direction expertly balances cerebral tension with visually stunning action sequences. Cinematography captures both grandeur and intimacy, and the score heightens suspense. The climax delivers both emotional payoff and breathtaking intensity."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006768/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023776",
              "author": {
                "username": {
                  "text": "prashantleuva"
                },
                "userId": "ur125715094"
              },
              "summary": {
                "originalText": "EXCELLENCE OF BOLLYWOOD"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is outstanding, extra - ordinary, Top tier acting by each actor/actresses. This is what bollywood cinema should be, this movie deserve all the love it&#39;s getting and more. I loved Ranveer Singh giving it all, and the rehmaan dakait character will become a legendary character of all time due to Akshay Khanna&#39;s acting."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023776/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11065528",
              "author": {
                "username": {
                  "text": "pavanciict"
                },
                "userId": "ur176348876"
              },
              "summary": {
                "originalText": "A perfect spy movie to date. Close to reality."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is a master piece in spy thrillers.<br/><br/>Great work done by the director Mr. Adhitya Dhar. Actually he did a DARING job.<br/><br/>Everything in this movie looks perfect.<br/><br/>All characters including the side characters, dancers etc. Etc. Are at their best.<br/><br/>Until I watched this film, i was a huge admirer of Yami Goutam. After this film, I have become a fan of Adhitya Dhar.<br/><br/>Sorry, Ms. Yami.<br/><br/>Very very happy that our Bharath&#39;s film industry is moving to a great level, internationally.<br/><br/>Movies of all languages are doing good worldwide. I wish this trend continues without a break."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11065528/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11051397",
              "author": {
                "username": {
                  "text": "pravdexter"
                },
                "userId": "ur46893803"
              },
              "summary": {
                "originalText": "Action Packed"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is miles above most of the other Indian movies in terms of storytelling and action packed sequences. Totally engaging throughout.<br/><br/>Acting, direction, screenplay .. everything looks like top notch.<br/><br/>Akshay Khanna steals the show throughout the movie. This is the kind of acting/ direction we have been waiting to see since long!"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-24",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11051397/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026646",
              "author": {
                "username": {
                  "text": "Ashish_3"
                },
                "userId": "ur25324979"
              },
              "summary": {
                "originalText": "Amazing Masterpiece Based on True Events"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerful and gripping cinematic experience that truly lives up to the tag of an &quot;amazing masterpiece.&quot; Inspired by true events, the film keeps you engaged from start to finish with its intense storytelling, strong emotional depth, and realistic portrayal of characters.<br/><br/>Akshaye Khanna delivers a standout performance, proving once again why he is one of the finest actors in Indian cinema. His screen presence, subtle expressions, and controlled intensity add immense depth to the film. He carries his role with remarkable maturity and makes every scene he appears in impactful.<br/><br/>Ranveer Singh also deserves appreciation for his performance. He brings energy and commitment to his character, balancing intensity with emotion, and complements the overall narrative well. His dedication to the role is clearly visible and adds strength to the film&#39;s storytelling.<br/><br/>The direction is confident and focused, making every scene feel purposeful. The background score and cinematography further elevate the impact, perfectly matching the film&#39;s serious and thought-provoking tone.<br/><br/>What makes Dhurandhar special is its honesty. It doesn&#39;t rely on unnecessary exaggeration; instead, it presents the truth with courage and clarity, leaving a lasting impression on the audience. This is not just a film, but an experience that stays with you long after the credits roll.<br/><br/>Highly recommended for anyone who appreciates meaningful cinema based on real-life events."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026646/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006784",
              "author": {
                "username": {
                  "text": "imdbfan-0418868056"
                },
                "userId": "ur198702819"
              },
              "summary": {
                "originalText": "Non-Stop Entertainment with Big Names"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses viewers into a morally complex underworld, where loyalty, strategy, and survival collide. Ranveer Singh delivers a career-defining performance, blending quiet introspection with bursts of explosive intensity during the film&#39;s most thrilling sequences. Sanjay Dutt dominates the screen with his commanding authority and layered menace. Akshaye Khanna and R Madhavan elevate the narrative with subtle performances that add nuance and credibility. Arjun Rampal exudes controlled menace, creating continuous tension, while Sara Arjun adds emotional depth, making the stakes feel real and personal. Aditya Dhar&#39;s direction is meticulous, ensuring that suspense, drama, and action flow seamlessly. Cinematography emphasizes both the vast, chaotic urban environments and intimate emotional beats, while the score heightens every dramatic moment. By the climax, the film combines visceral thrills, emotional payoff, and smart storytelling, leaving a lasting cinematic impression."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006784/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016746",
              "author": {
                "username": {
                  "text": "RxS-522"
                },
                "userId": "ur211613077"
              },
              "summary": {
                "originalText": "BEST MOVIE EVER!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshay Khanna has stolen the show! Aditya Dhar has done a phenomenal job of showing intricacies of Pakistan Gang War, Indian Intelligence operations and inefficiencies of Indian Polity in an Epic 3.5 hour movie but kept the audience hooked throughout. Every character has played their part flawlessly but Akshay Khanna as Gangster Rehman Dakait is the pick of the lot. As an Indian, Pakistan has been shown in a completely different vibe and the Muslim culture has also been shown artistically. Violence is necessary to the character arcs and totally justified. Looking forward to Part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016746/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11066334",
              "author": {
                "username": {
                  "text": "itssaurav_1"
                },
                "userId": "ur211996010"
              },
              "summary": {
                "originalText": "Dhurandhar - Raw, Realistic & Riveting Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Overall Impression:\nDhurandhar is a hard-hitting and engaging film that blends realism with powerful storytelling. It keeps you emotionally invested from start to finish and leaves a lasting impact.<br/><br/>Music Usage Through Scenes:\nThe music is used with great sensitivity. It enhances key moments without overpowering the narrative, making scenes more impactful and emotionally resonant.<br/><br/>Background Music (BGM):\nThe BGM deserves special appreciation. It perfectly matches the mood of the film-intense during action, subtle during emotional moments, and gripping during dramatic turns.<br/><br/>Casting:\nCasting is one of the film&#39;s biggest strengths. Every actor fits their role naturally, adding authenticity and depth to the story.<br/><br/>Direction:\nThe direction is sharp and focused. The director maintains excellent pacing and storytelling control, ensuring the film never feels dragged or disconnected.<br/><br/>Performances:\nPerformances are powerful and convincing. The lead actor delivers a standout performance, while supporting actors contribute strongly to the film&#39;s realism.<br/><br/>Action Sequences:\nAction scenes are realistic, gritty, and well-executed. They feel grounded and meaningful rather than exaggerated, adding to the film&#39;s intensity.<br/><br/>Use of Real Incidents:\nThe incorporation of real-life incidents adds depth, credibility, and emotional weight to the story. It makes the film more relatable and impactful.<br/><br/>Final Verdict:\nDhurandhar is a must-watch for viewers who appreciate realistic cinema, strong performances, and meaningful storytelling. A well-crafted film that balances action, emotion, and reality effectively."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11066334/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010516",
              "author": {
                "username": {
                  "text": "priyac-25"
                },
                "userId": "ur211568023"
              },
              "summary": {
                "originalText": "What a master piece."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must watch movie showing reality of Pakistan. Better than so called Bollywood spy movies like tiger, Pathan. Bollywood always made terrible spy movies, showing Pakistan in a good image. They make anti national movies showing army in a bad manner, just focusing on love story. This movie has footage&#39;s of terror attack which happened in India. If you love India, please watch it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010516/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006531",
              "author": {
                "username": {
                  "text": "AnitaG-978"
                },
                "userId": "ur210345425"
              },
              "summary": {
                "originalText": "All-Star Cast, All-Out Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film excels in balancing action, strategy, and emotion, with each character given space to shine. Ranveer Singh&#39;s performance is a masterclass in portraying internal conflict and courage. Sanjay Dutt provides gravitas, Akshaye Khanna and R Madhavan enrich the ensemble, Arjun Rampal injects menace, and Sara Arjun provides emotional depth. Aditya Dhar&#39;s direction ensures tension escalates naturally while maintaining clarity. Cinematography highlights both scale and intimacy, and the soundtrack emphasizes suspense. By the second half, action, revelation, and emotional arcs converge, delivering a powerful finale."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006531/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11040564",
              "author": {
                "username": {
                  "text": "Rajit_thebingewatcher"
                },
                "userId": "ur47608563"
              },
              "summary": {
                "originalText": "Bollywood has created their version of \" Departed\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It was amazing to read radical reviews where two groups presented extremes in social media. Nothing in between. I thought I would give it a go to this &quot;Sholayish&quot; lengthy movie . The story of a &quot;trojan horse&quot; presented in a crafty way I must say. Kudos to Aditya Dhar for analysing the &quot;Pakistan&quot; Ecosystem through laiyari and bringing lot of events from the past to create high octane in the movie. However, in between it feels mildly propogandist as well (doesn&#39;t cross the line , and may be because of my neutral perspective as well). I must say dhar has created bollywood version of &quot;Departed&quot; Finally. Definitely watch part 2."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11040564/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022190",
              "author": {
                "username": {
                  "text": "Joesatvik1"
                },
                "userId": "ur62110545"
              },
              "summary": {
                "originalText": "90s style storytelling with new faces"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A different kind of Uri style/ Pakistan based boastful story with no real content. Falls flat at the end. OTT level script with decent action. It doesn&#39;t even align with the title itself. I hope they don&#39;t have a plan for a sequel. Move beyond Pakistan, Cricket, Boxing, LGBT, woman crime, politics topics bollywood. I wonder if all the 8+ ratings, reviews here are even genuine."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 9,
                "downVotes": 120
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022190/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006887",
              "author": {
                "username": {
                  "text": "bshaw-25108"
                },
                "userId": "ur115063519"
              },
              "summary": {
                "originalText": "Star-Studded Thrills for Everyone"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s world is meticulously crafted, full of tension, strategy, and high-stakes drama. Ranveer Singh delivers a masterful performance, effortlessly portraying both calculated aggression and emotional vulnerability. Sanjay Dutt commands attention with his presence, while Akshaye Khanna and R Madhavan enrich the ensemble with subtle, intelligent performances. Arjun Rampal maintains suspense with controlled menace, and Sara Arjun&#39;s emotional depth adds humanity to the narrative. Aditya Dhar orchestrates suspense, action, and narrative twists with precision. Cinematography captures the sprawling urban environment and intimate character beats, while the score heightens tension. By the finale, the film&#39;s combination of thrilling action and emotional payoff is fully realized."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006887/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024332",
              "author": {
                "username": {
                  "text": "ssa-73163"
                },
                "userId": "ur135929374"
              },
              "summary": {
                "originalText": "A remarkable movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I have just watched it now. I can say this is the best movie that I have seen this year. Really an good and related to real life incident movie. The makers deserves an appreciation. The real image of a specific community or country should come in front of the world, and the movie shows it perfectly."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024332/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006968",
              "author": {
                "username": {
                  "text": "itachiu-11653"
                },
                "userId": "ur188246052"
              },
              "summary": {
                "originalText": "High-Stakes Action with a Heartfelt Core"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film is an immersive journey through danger, loyalty, and moral conflict. Ranveer Singh portrays his character with layered complexity, while Sanjay Dutt brings commanding gravitas. Akshaye Khanna and R Madhavan elevate the ensemble with compelling performances, and Arjun Rampal&#39;s quiet menace lingers on screen. Sara Arjun provides emotional weight, highlighting the human cost of power struggles. Aditya Dhar&#39;s direction expertly blends suspense, drama, and meticulously staged action. The cinematography captures both explosive chaos and subtle tension, while the musical score enhances every pivotal moment. The story escalates naturally to a climax that delivers both emotional and cinematic satisfaction."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006968/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11048446",
              "author": {
                "username": {
                  "text": "lokeshvt"
                },
                "userId": "ur57827253"
              },
              "summary": {
                "originalText": "Excellent Movie."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Bollywood films usually fall into two extremes: either painfully bad, or so unexpectedly brilliant that they completely floor you. Dhurandhar belongs firmly in the latter category. From start to finish, it keeps you captivated.<br/><br/>The performances are excellent, no over-the-top melodrama, no lazy, half-hearted acting that plagues so many mainstream hindi films. Everything felt balanced. The story unfolds smoothly, the pacing works, and the action is tight and grounded, thankfully none of that exaggerated, cartoonish chaos you&#39;d expect in something like a Rohit Shetty film.<br/><br/>This movie really proves that, in the right hands, Ranveer Singh can absolutely shine and be shaped into a true superstar. And then there&#39;s Akshaye Khanna, legend is the only word that fits that man. He&#39;s Bollywood&#39;s secret weapon: used sparingly, but every time he appears, he elevates the entire film. His presence alone adds weight and credibility.<br/><br/>The supporting cast is equally strong, with every role feeling thoughtfully cast and well performed. No weak links here.<br/><br/>All in all, this is one of those rare films that comes along once in a blue moon and reminds you just how good Bollywood can be when everything clicks. Easily one of the finest films the industry has produced."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11048446/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012892",
              "author": {
                "username": {
                  "text": "MarwinSingh2001"
                },
                "userId": "ur97721990"
              },
              "summary": {
                "originalText": "Raw, Real and Brutal. Dhurandhar is a must watch for everyone.."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I went expecting another spy thriller from Bollywood with over the top action scenes and aura and hype moments, but what I saw on the screen just blew me away.. This film is not like your average Bollywood big budget film where there are slow mo shirtless shots or stupid one liners but this is the best historical spy thriller ever came out of bollywood which is shockingly very real.. I was surprised by the performances of this film, after many years it felt like I&#39;m watching a film of a bollywood actor instead of a bollywood star.. Calm and calculating , Ranveer Singh delivered one of the best performances of his career. But all the praise should go to the Akshay Khanna as Rehman Dacoit he stole the every scene he was in and actually managed to outshadow the main star of this movie, he delivered the greatest performance of his career without any doubt.. Rest of the cast like Sanjay Dutt and Arjun Rampal was great too but I won&#39;t go further into it.. Talking about historical accuracy this film showed us the real face of terrorism and it also included the real clips and recordings of some most famous terrorist attacks happened in India and those scenes actually hits very hard, on other hand it showed us the most realistic deception of our neighborhood country which no Indian film has never shown before... Watch it and you&#39;ll realise it. Talking about technical aspects sometimes films feel too long but some great performances and a realistic story keep things interesting for the audience and it actually sets up the stage for the next half story in the second part, also this film is mostly based on real world events so filmmakers tried to show everything surrounding these events.. But some cringe scenes should&#39;ve been removed and overusing of vulgar language should&#39;ve been toned down too.. Don&#39;t go with thinking about an full blown action movie sure there are some action scenes and especially the final fight scene during the climax which will give the action fans what they want, but action is only here to serve the story instead of vise versa like a typical Bollywood film which is i truly loved about this film, but whatever is shown is raw and very brutal which feels real also most of the action related things are saved for the next part.. At last without saying any spoilers i will say again that Dhurandhar is a must watch for the fans of Spy thrillers and also it is one of the most important and impactful movies I&#39;ve seen from Bollywood in a long time. This is how a real Spy film should be made, instead of showing terrorists as sympathic figures and allies of Indian Spies as in YRF spy universe Dhurandhar showed us the real face of terrorism.. Can&#39;t wait for the second part in Next March where hell breaks loose.."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012892/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013560",
              "author": {
                "username": {
                  "text": "AshishM-99"
                },
                "userId": "ur211540890"
              },
              "summary": {
                "originalText": "\"Spectacular - No Arguments Needed\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film is an absolute cinematic triumph, brilliantly crafted and powerfully acted. Akshay Khanna, Ranveer Singh, Rakesh Bedi, and the entire cast deliver performances packed with emotion, depth, and authenticity. Every scene holds your attention with compelling storytelling and immersive direction. The screenplay strikes a perfect balance between intense drama and subtle humor, making the film appealing and thought-provoking. Even those who love to debate online, including the frequent online liberals, might find themselves pausing to appreciate the artistry and nuance of this movie. It challenges perspectives thoughtfully and respectfully, inviting everyone to experience its brilliance without bias. The supporting cast adds even more vibrancy, and the soundtrack beautifully enhances key moments, making the overall experience unforgettable. With the second part scheduled for release in March 2026, the anticipation is palpable, as the first film leaves viewers craving more. This isn&#39;t just a movie-it&#39;s an unforgettable journey that will resonate long after the credits roll. Whether you&#39;re a film enthusiast or a casual watcher, it&#39;s a must-see cinematic event. Can&#39;t wait for part two!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013560/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022633",
              "author": {
                "username": {
                  "text": "swapnil-908"
                },
                "userId": "ur211660337"
              },
              "summary": {
                "originalText": "Worth the hype"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The portrayal has been finally made closer to reality instead of typical bollywood drama. Content, story telling, picturization, casting and what not, all hit the bulls eye. The movie is capable of engaging The audience for 3.5 hours without even flinching The eye. Got to see such great work after soo long in bellwood.<br/><br/>A must must watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022633/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026525",
              "author": {
                "username": {
                  "text": "PratikM-649"
                },
                "userId": "ur209683975"
              },
              "summary": {
                "originalText": "Dhurandhar has best cinematic experience."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s amazing. A must watch. Just believe me and rush to theater. R madhavan is just too good. Ranveer singh has been brilliant. Arjun Rampal and Sanjay Dutt have given their all. And the best Akshay khanna is just phenomenal. The debutant sara arjun stole the show with the grace with which she carried herself throughout the movie. Aditya Dhar you beauty!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026525/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}