{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6fdzitazcwzy476wh3ojurdtmqbj63qndd6hoalo6qebgnesk2d2yoiyvjjchy2iytov6lfcuobdy6en5dix5hm",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11018396",
              "author": {
                "username": {
                  "text": "akshayy-41124"
                },
                "userId": "ur69546381"
              },
              "summary": {
                "originalText": "Dhurandhar - Indian Spy Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After a long time went to watch a movie in theatre and it was worth it...\nReally enjoyed the movie..\nA must watch..\nExcellent acting..\nMind blowing background music..\nThe direction and cinematography is top notch..\nMovie does not look fake like other indian spy movies.. looks very real.. casting was top notch. Intelligent writing, peak performances, gritty and realistic action."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018396/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018038",
              "author": {
                "username": {
                  "text": "Dilip-891"
                },
                "userId": "ur211623283"
              },
              "summary": {
                "originalText": "Best movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It is the best movie in recent times\nNo words can describe it just go and watch u wont feel regret i promise. Acting was jus top notch All the actors performed excellent the music was stunning visuals were just lit the colour choice the screenplay.just book the tickets and go dont let this movie fail because it just creates a different stage."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018038/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006613",
              "author": {
                "username": {
                  "text": "HarshS-800"
                },
                "userId": "ur206795518"
              },
              "summary": {
                "originalText": "High-Octane Fun with Ranveer & Co."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene in the film feels carefully calibrated, from high-octane action sequences to intimate, tension-filled character interactions. Ranveer Singh commands attention with a performance that balances internal conflict with calculated aggression, creating a protagonist whose depth makes every choice compelling. Sanjay Dutt radiates gravitas in moments of negotiation and confrontation. Akshaye Khanna and R Madhavan provide subtle intelligence that strengthens the ensemble, while Arjun Rampal&#39;s quiet menace injects tension into every frame he occupies. Sara Arjun&#39;s performance adds emotional weight. Aditya Dhar directs with precision, blending strategy, suspense, and action seamlessly. Cinematography captures both scale and intimacy, and the score accentuates tension. By the second half, the stakes escalate dramatically, leading to a finale that is both thrilling and emotionally resonant."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006613/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013969",
              "author": {
                "username": {
                  "text": "PoonamD-07"
                },
                "userId": "ur211593674"
              },
              "summary": {
                "originalText": "Best movie of this year"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film stands out as a powerful blend of storytelling, visual style, and emotional depth. From the very first scene, it pulls the audience into its world with striking imagery and a strong sense of atmosphere. The director shows a clear vision, balancing entertainment with meaningful themes that stay with you long after the credits roll.<br/><br/>One of the biggest strengths of the movie is its cast. Each actor delivers a convincing and heartfelt performance, making the characters feel real and relatable. Whether it&#39;s moments of tension, humor, or vulnerability, the actors handle every emotion with authenticity. Their on-screen chemistry adds even more weight to the story and helps keep the audience engaged throughout.<br/><br/>The writing is equally impressive. The screenplay manages to be sharp, thoughtful, and engaging without ever feeling slow. The dialogues feel natural, and the story moves at a steady pace, revealing just enough at each step to keep viewers curious. Even the quieter moments feel purposeful, helping to build the world and deepen our connection to the characters.<br/><br/>Visually, the film is stunning. The cinematography uses colors, framing, and movement to create scenes that are not just beautiful but also meaningful. The music and background score complement the visuals perfectly, enhancing the mood of every moment without overpowering it.<br/><br/>While no movie is perfect, the strengths of this one easily outweigh its small flaws. Some scenes might feel slightly extended or predictable, but the overall experience remains captivating and memorable.<br/><br/>In the end, the film succeeds in delivering entertainment, emotion, and artistry all at once. It&#39;s the kind of movie that leaves you thinking, feeling, and wanting to revisit it again. A truly impressive piece of cinema that deserves all the praise it receives."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013969/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007035",
              "author": {
                "username": {
                  "text": "Akashdeep5482605"
                },
                "userId": "ur199123523"
              },
              "summary": {
                "originalText": "A Full-Blown Cinematic Rush of Thrill and Emotion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s pacing allows suspense and action to build organically. Ranveer Singh delivers a dynamic performance, portraying a man torn between duty and conscience, while Sanjay Dutt exudes gravitas and authority in every scene. Akshaye Khanna and R Madhavan&#39;s performances are layered and nuanced, providing narrative depth. Arjun Rampal&#39;s menace is understated but omnipresent, and Sara Arjun&#39;s scenes evoke powerful emotional responses. Aditya Dhar orchestrates a masterful balance between strategy, suspense, and high-octane action. Cinematography captures both large-scale chaos and intimate drama, and the score punctuates tension seamlessly. The finale is a thrilling and emotionally resonant culmination of all narrative threads."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007035/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044677",
              "author": {
                "username": {
                  "text": "prathameshshinde-47219"
                },
                "userId": "ur66503441"
              },
              "summary": {
                "originalText": "Engaging"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Paisa Vassol also has lot of repeat value. The set design is awesome. Yrf needs to up their game post this movie. Akshay Khanna ha reinvented himself, Ranveer slipped into his character perfectly.<br/><br/>Rest of the star cast did awesome job. Shaswat Sachdev did brilliant in music department. The background score was mesmerising. The rap by Reble was so cool."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044677/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022338",
              "author": {
                "username": {
                  "text": "abhisheka-727"
                },
                "userId": "ur211658983"
              },
              "summary": {
                "originalText": "Powerful performance"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It was bit different, no unnecessary songs, no farji romance, and moreover no story streching for linking the scenes made chapter wise for that ,nail biting performance by all actors, this time hollywood touch was there as common people other than main characters were unknown/not seen before thats why could connect that we are in different country, superb movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022338/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021263",
              "author": {
                "username": {
                  "text": "samratdeepakprajapati"
                },
                "userId": "ur81254027"
              },
              "summary": {
                "originalText": "Great Movie in Bollywood history"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched it first day show and I loved it, what a great movie.....with truth, fact , evidences. I shocked with real images and recording of terrorist attack (parliament,9/11). Every single actor has it it&#39;s Best, watch it without any hesitation, now I m waiting for its next part ... loading blockbuster....."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021263/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006689",
              "author": {
                "username": {
                  "text": "sanket12"
                },
                "userId": "ur198806996"
              },
              "summary": {
                "originalText": "A Star-Lit Adventure of Intensity and Emotion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the very first frame, Dhurandhar announces itself as a cinematic achievement. The director demonstrates extraordinary control over tone and pace, balancing intense action, political drama, and emotional storytelling. The actors rise to the challenge, with the protagonist delivering a nuanced performance that captures both vulnerability and strength. The supporting cast enhances the story with subtle expressions and timing, proving that every role, no matter how small, matters. The film&#39;s layering of real-world events with fiction is handled intelligently, showcasing the director&#39;s storytelling prowess. Each fight scene and dialogue-heavy moment feels purposeful. The result is a film where direction and acting work hand-in-hand to create a truly immersive experience."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006689/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010593",
              "author": {
                "username": {
                  "text": "pandeyankita-71038"
                },
                "userId": "ur158125139"
              },
              "summary": {
                "originalText": "Bollywood must make this kind of movies for a comeback."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie literally deserves Oscar. Akshay Khanna literally nailed it with his acting. The entry at the Baloch Camp and the dance was my favourite. I never expected that I could praise a villain for so good acting. Sanjay Dutt and Ranveer Singh were overshadowed for me bcz of Akshay&#39;s acting. It&#39;s a must watch movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010593/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011219",
              "author": {
                "username": {
                  "text": "ketanbhandari-34881"
                },
                "userId": "ur150778048"
              },
              "summary": {
                "originalText": "Spyfire"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A slick, high octane spy thriller packed with stunning action and gripping real world tension. It&#39;s a pulse pounding blockbuster that turns classified history into pure cinematic adrenaline🔥. Drawing from declassified operations and long buried intelligence files, the film transform shadowy history into hear pounding spectacle. A must watch movie👌"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011219/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014137",
              "author": {
                "username": {
                  "text": "mishrakavita-01395"
                },
                "userId": "ur190866279"
              },
              "summary": {
                "originalText": "INDIAN CINEMA AT IT'S PEAK"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A film with runtime morethan 3n half hours might sound a little doubtful to watch but no this one i must say this hails our unsung hero of country who work for this country and how the director shows it is mind-boggling ADITYA DHAR your are a genius. And the actor akshay ranveer sanjay and the most dangerous arjun rampal they have done their peak to entertain us."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014137/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006558",
              "author": {
                "username": {
                  "text": "asishcma"
                },
                "userId": "ur166746921"
              },
              "summary": {
                "originalText": "Drama That Grips from the First Frame"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film excels in blending gripping action with profound character exploration. Ranveer Singh&#39;s performance anchors the story, his portrayal of moral conflict resonating deeply. Director Dhar&#39;s meticulous craftsmanship is evident in every scene, whether it&#39;s a tense negotiation or a high-octane chase. The ensemble cast elevates the narrative, providing emotional resonance that complements the action. Cinematography captures both beauty and brutality, and the soundtrack heightens suspense while enhancing emotional depth. Every scene serves the story, building toward a climax that is as emotionally charged as it is visually spectacular."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006558/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007719",
              "author": {
                "username": {
                  "text": "er-sujithnair"
                },
                "userId": "ur39081362"
              },
              "summary": {
                "originalText": "Truth is brutal"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Truth is brutal and show the way it is .<br/><br/>One off the best movies of 2025.<br/><br/>Actors has done fabulous work especially Akshay Khanna , r madhavan and ranvir singh !!<br/><br/>Action is realistic , gritty ,bgm ,direction and cinematography all on point . Movie is a beast ..a must watch.<br/><br/>Can&#39;t waith for part to be released."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007719/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013399",
              "author": {
                "username": {
                  "text": "Sachin-620"
                },
                "userId": "ur211588893"
              },
              "summary": {
                "originalText": "Best movie of Spy verse"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurander isn&#39;t just another spy film filled with flashy gadgets and over-the-top action-it&#39;s a gripping portrayal of intelligence work as it truly unfolds in the shadows. What makes the movie stand out is its raw honesty. Instead of glorifying agents as invincible heroes, it shows the emotional strain, sacrifice, and constant pressure that comes with operating in a world where every step is a risk.<br/><br/>The narrative moves with purpose: no unnecessary drama, no exaggerated heroics. The screenplay beautifully blends patriotism with practicality, showing that real espionage isn&#39;t about glamorous chases but about information, strategy, psychological endurance, and moral dilemmas.<br/><br/>The performances are tight and believable. The lead actor delivers intensity without theatrics, portraying a spy who is human first-vulnerable, flawed, and deeply committed to duty. The supporting cast complements the story without overshadowing the core mission.<br/><br/>Technically too, Dhurander impresses. The cinematography captures tension without noise, the background score elevates the suspense rather than overpowering it, and the dialogues feel grounded and sharp.<br/><br/>In a genre often dominated by fantasy-driven spy spectacles, Dhurander is a refreshing shift-a film that respects intelligence work and presents it with authenticity. It&#39;s not just a movie based on espionage; it&#39;s a mirror to the unseen lives of those who protect from the shadows."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013399/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11046306",
              "author": {
                "username": {
                  "text": "AdarshS-111"
                },
                "userId": "ur211853577"
              },
              "summary": {
                "originalText": "Great movie everything is perfect"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Much recommended. Its a great movie all casts are super great and specially ranveer did absolute best in this movie as well as his physique is super great and looked absolutely beast in every outfit and the movie also very good\nMuch recommended. Its a great movie all casts are super great and specially ranveer did absolute best in this movie as well as his physique is super great and looked absolutely beast in every outfit and the movie also very good."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11046306/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010730",
              "author": {
                "username": {
                  "text": "rachit-93"
                },
                "userId": "ur211569133"
              },
              "summary": {
                "originalText": "The Best Spy thriller After Baby!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Big big big shout for the director and his team.<br/><br/>One of the best spy thriller movie watched today.<br/><br/>After movie baby ...my eyes were waiting for bollywood to come with something patriotic spy thriller...and yes today I am really really happy... Tomorrow again I m going to book the seat..\nJab tak man nhi bhare ga tab tak dekhu ga.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010730/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015941",
              "author": {
                "username": {
                  "text": "SkA-019"
                },
                "userId": "ur211606383"
              },
              "summary": {
                "originalText": "Op"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolutely amazing movie. The actors in movie have give there best potential. From the main character to villain everyone give their best effort. The movie tell us about the Late Major Mohit Sharma who go inside Pakistan, spy on them become their part and then destroy there system single handly . You should definitely watch it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015941/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006589",
              "author": {
                "username": {
                  "text": "imdbfan-7365359455"
                },
                "userId": "ur198195761"
              },
              "summary": {
                "originalText": "Feel the Punch, Live the Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerhouse of storytelling and performance. The lead actor carries the film with incredible depth, seamlessly portraying a character torn between loyalty, ambition, and morality. Supporting actors bring their roles to life with authenticity, giving each subplot significant weight. The director&#39;s craft is apparent in the intricate layering of political, personal, and action-driven narratives. Scenes flow organically, allowing suspense to build naturally, while the action sequences remain grounded and impactful. The blending of real news footage and historical references adds authenticity and tension, making the stakes feel immediate and real. The background score is subtle but effective, emphasizing emotion rather than overpowering it. Every frame is carefully composed, and the attention to detail-from costume design to setting-enhances the storytelling. Dhurandhar is a film that resonates on multiple levels, showcasing brilliance in acting, directing, and cinematic vision."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006589/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031086",
              "author": {
                "username": {
                  "text": "imdbfan-929681"
                },
                "userId": "ur211567968"
              },
              "summary": {
                "originalText": "Must watch bollywood spy thriller..."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie like dhrundhar is 1st of its type spy action movie in bollywood, not like other commercial spy movies. It will definitely changes concept of spy movies in bollywood.<br/><br/>Talking about movie, action, direction, acting, music, bgm, cinematography, editing everything looks perfect. We can literally feels angry and anxious in some scenes of movie as an indian.<br/><br/>Must watch for an indian...."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031086/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017926",
              "author": {
                "username": {
                  "text": "AnantC-046"
                },
                "userId": "ur211622910"
              },
              "summary": {
                "originalText": "A must watch movie for India's"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolutely banger of a movie. Shows the real struggle of our spies and the work done by our intelligence agency to protect us.<br/><br/>Also highlights how our external enemies are supported by the internal one&#39;s.<br/><br/>Aditya Dhar is a great director.<br/><br/>Ranveer&#39;s emotions in a particular scene is absolutely amazing.<br/><br/>This makes your blood boiled for the harm our enemies are constantly trying to do to us and our nation.<br/><br/>Would suggest everyone to watch it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017926/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010430",
              "author": {
                "username": {
                  "text": "prashantnagar-26949"
                },
                "userId": "ur122087201"
              },
              "summary": {
                "originalText": "Absolute masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "5/5 - Dhurandhar Review<br/><br/>Dhurandhar is a solid film from start to finish. The story is simple but the impact is strong. Every scene carries a raw energy that keeps you engaged. The characters are well-written, and their attitude is what gives the movie its real charm.<br/><br/>The hero&#39;s screen presence is powerful - calm, sharp, and truly &quot;dhurandhar.&quot; The villain matches that intensity, which makes their clash even more gripping. The dialogues are short, tight, and memorable. Action scenes are clean, realistic, and never overdone.<br/><br/>The background music supports the mood without becoming too loud. The pacing is quick, and the movie never feels slow at any point.<br/><br/>Overall, it&#39;s a complete paisa-vasool entertainer stylish, strong, and totally worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010430/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020133",
              "author": {
                "username": {
                  "text": "earthlingx"
                },
                "userId": "ur100779450"
              },
              "summary": {
                "originalText": "Dhurandhar : Best Indian Spy movie ever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If you love spy or thriller movies, must watch.<br/><br/>This movie is like an onion have so many layers, you need to watch second time to get the details.<br/><br/>And Please watch this in Dolby sound, the BGM and background songs Just WOW.<br/><br/>I already watched with my family, My wife does not like movies that much she liked the movie so much she watched like 10 stories about this on YouTube &amp; I am going to watch in again this time in IMAX this Sunday with friends."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020133/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028234",
              "author": {
                "username": {
                  "text": "TanishJ-68"
                },
                "userId": "ur211704109"
              },
              "summary": {
                "originalText": "Had fun watching a Bollywood film after a longggg time!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just watched &quot;Dhurandhar&quot; and couldn&#39;t hold myself... this is by far the best Indian Spy Thriller of not only this year, but of the decade. Raw, Brutal, brilliant, and truly savage. The technical brilliance of the film shines throughout the running minutes and the pure love for the nation, the itch to finally let it out hard and real- the paining facts about the older India&#39;s helplessness due to older helpless government, wins your heart! Paxtaan is shown, no- rather stripped as it should be, but apart from the master craft this movie showcases, what other element you truly admire other than the hardcore hitting music album and solid performances and couldn&#39;t rave about enough is the Director and his guts to showcase what never has been showcased in Indian cinema yet, and to pack it up in a way which Indian cinema couldn&#39;t! Aditya Dhar- you out of all the team of shining brave artists, has my utmost respect!<br/><br/>Dying for part 2!!!!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028234/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023209",
              "author": {
                "username": {
                  "text": "anshumanjhagmailcom"
                },
                "userId": "ur211664992"
              },
              "summary": {
                "originalText": "Great performances and Good casting"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great performances and Good casting.<br/><br/>Along with performances the background scores were too good , the 3 hr 30 mins movie is gripping and tells the tail well.<br/><br/>Although with a touch of political bias the movie does capture a lot of events with some degree of accuracy.<br/><br/>Casting is on point.<br/><br/>Action is on point and so is the screen play."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023209/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}