{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xobdzltazcwzy472xxrnztr7r4oabt34ktz6xfade6mqbdf4skydk3oy4vzmryoaziksgmkbehxbeghcf4ufmgeosa",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11058418",
              "author": {
                "username": {
                  "text": "karunyaguptaweasd"
                },
                "userId": "ur168580657"
              },
              "summary": {
                "originalText": "best movie of the year 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is phenomenal with excellent acting, great music, and everything else, surpassing KGF and Pushpa. Ranveer Singh looks to be in his prime, and all the underrated characters are brilliantly brought to life.<br/><br/>The music placement is just perfect, and the fighting scene storyline is on point. This movie deserves indian espect."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11058418/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013416",
              "author": {
                "username": {
                  "text": "rupam-07128"
                },
                "userId": "ur145187187"
              },
              "summary": {
                "originalText": "Best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "In my puspetive spy thriller and action packed syllabus. In the end of the year i should recommend someone who&#39;s love cinema, also importantance of threatical experience that should consider it to watch it.<br/><br/>At the end movies hits pick testosterone and masculinity if, you&#39;re young it self. Then go for it 🍿👍"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013416/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010575",
              "author": {
                "username": {
                  "text": "AviralM-0"
                },
                "userId": "ur211568022"
              },
              "summary": {
                "originalText": "Dhurandhar. A 3.5 Hour Goosebump Marathon That India Deserves"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is the first time in my life that I&#39;m writing a review on IMDb, and Dhurandhar is the reason I finally had to. Not because it&#39;s just another big film, but because I&#39;m seeing too many people casually label it as &quot;propaganda&quot; without even watching it, without even attempting to understand the cinematic art that has gone into every frame.<br/><br/>For me, Dhurandhar is much more than a film. It&#39;s a powerful reminder of my country, of the sacrifices India has made, and of the countless unsung heroes who live and die so that we can carry on with our normal lives. The way this movie weaves together national security, emotion, and history is nothing short of brilliant.<br/><br/>Let&#39;s talk cinema.<br/><br/>The cinematic beauty, the action, the absolutely mesmerising music, the wonderful production design, the elegant dialogues, the breathtaking screenplay, and a stellar star cast, all of this made every single minute of the 3 hour 30 minute runtime worth it. Not once did I look at my watch. In fact, this is one of those very rare films that I genuinely want to watch again in the theatre.<br/><br/>Some sequences hit like a punch to the gut.<br/><br/>The recreations of 26/11, the Parliament attack, and the Kandahar hijacking truly pump nationalism into your veins. There were moments where I could literally feel a surge of adrenaline and patriotism rushing through my body. It&#39;s raw, it&#39;s intense, and at times uncomfortably real, and that&#39;s exactly why it works.<br/><br/>Every character in Dhurandhar is written in a way that you instantly relate to them. They&#39;re not just &quot;filmy heroes&quot;, they feel like people you might actually know, or at least have heard of. Their dilemmas and sacrifices feel personal.<br/><br/>The bike chase with Ranveer is, for me, one of the standout action pieces in recent Indian cinema. That sequence, combined with that pulsating BGM, genuinely felt like I was watching an Indian answer to Fast &amp; Furious, but with a soul rooted in our soil.<br/><br/>And then there&#39;s the background score. The way the BGM has been used throughout the film is simply captivating. There&#39;s one moment in particular that refuses to leave my mind: when Akshaye Khanna and Ranveer Singh face off in their final encounter, and the BGM slowly builds into the &quot;Asato Ma&quot; track, almost like a spiritual echo of The Matrix. That gave me pure goosebumps in the theatre.<br/><br/>Special shoutout to Akshaye Khanna&#39;s entry music, I&#39;m still dancing to it in my head. It&#39;s stylish, powerful, and unforgettable, just like his presence in the film.<br/><br/>In brief, if you:\nhave a good taste in music,\nare a true cinema lover who respects craft,\nand know even a little bit about India&#39;s modern history,\n...then you are not walking out of this film easily. The &quot;Dhurandhar hangover&quot; is real.<br/><br/>To the entire team of Dhurandhar: Thank you for giving us this experience.<br/><br/>I&#39;m eagerly waiting for the second part and until then, I&#39;ll happily carry this film in my heart... and that entry BGM of Akshaye Khanna in my playlist and mind."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010575/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013805",
              "author": {
                "username": {
                  "text": "SupradipD-5"
                },
                "userId": "ur211591794"
              },
              "summary": {
                "originalText": "This is how Bollywood film should be"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is exactly the kind of Bollywood movie we need - bold, unapologetic, and fact-based. It fearlessly exposes Pakistani terror influence and breaks the usual left-leaning propaganda we often see in films. With powerful performances, gritty realism, and a strong patriotic tone, it&#39;s a solid slap to biased narratives. Bollywood should definitely make more movies like this."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013805/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011708",
              "author": {
                "username": {
                  "text": "kunalsahayks"
                },
                "userId": "ur151002820"
              },
              "summary": {
                "originalText": "Loved the movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshaye Khanna ate and kept eating. When you cant be killed by the main protagonist and Sanju baba.. thats aura. Ranveer did great and Sanju baba&#39;s entry was superb!! Incredible fun ride! The story is well written and no CGIs during action scenes was a welcome break. Loved the hues and dark shades in scenes."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011708/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029480",
              "author": {
                "username": {
                  "text": "naikharshal"
                },
                "userId": "ur61467366"
              },
              "summary": {
                "originalText": "Dhurandhar naturally forced me to write"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I can&#39;t believe how bold, clear &amp; truthful this film is! Hindi movie watchers has never expected something so straight in the India-Paxtan storylines. Dhurandhar is based on almost all real incidents and all the efforts of the makers can clearly be seen throughout the length of the film and hence the long screentime of this film is absolutely not a problem.<br/><br/>I am dreaming that Paxtani people will also be able to watch this movie soon as it is equally important for them to understand the full reality.<br/><br/>Most importantly, director Aditya Dhar has teared down, exposed the fake YRF spy universe, Pathan, War, Jawan, Bajrangi Bhaijan etc. Because none of these big budget movies were inline to the truth &amp; these movies were more of a matchmaking and not the real Spy stuff. And none of them dared to expose Paxtan&#39;s real side.<br/><br/>Dhurandhar movie has naturally forced me to write this review."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029480/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010921",
              "author": {
                "username": {
                  "text": "mayanksarda-38146"
                },
                "userId": "ur82545212"
              },
              "summary": {
                "originalText": "Great Screenplay"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Excellent acting by all stars. Doesn&#39;t feel like a 3.5 hour movie at all. Realistic.<br/><br/>Hi Bengali movie ke baad btata I am so freeeee to the next one is it possible to get a chance 😁😁😉 I am a consultant to be successful in a fun 😊 I am a fresher and looking forward to seeing everyone smiles in his life."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010921/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010482",
              "author": {
                "username": {
                  "text": "pawanrajpr-06713"
                },
                "userId": "ur150729259"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhirandhar is one of those rare films that never lets you feel bored, sleepy, or distracted-not even for a moment. From start to finish, it keeps you firmly gripped to your seat, constantly excited and curious about what&#39;s coming next.<br/><br/>The long runtime actually becomes a bonus. Instead of feeling stretched, it makes you even happier, giving you more time to enjoy the film&#39;s powerful storytelling, engaging sequences, and brilliant execution.<br/><br/>Every scene feels purposeful, every moment keeps you hooked, and the overall experience is simply outstanding.<br/><br/>This film is not just good-it&#39;s so, so good. And with the kind of audience response it&#39;s generating, Dhirandhar is undoubtedly on its way to creating massive records.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010482/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029595",
              "author": {
                "username": {
                  "text": "theatomicdestroyer"
                },
                "userId": "ur146077836"
              },
              "summary": {
                "originalText": "Blockbuster fs!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolutely amazing , not only akshay khanna but each and every actor did their best ! The reality has been showcased . I recommend everyone to go and watch Dhurandhar in theatres. If you love India , you&#39;ll surely love it !!<br/><br/>Eagerly waiting for part 2\nWell done Aditya dhar and all the cast members.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029595/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11042683",
              "author": {
                "username": {
                  "text": "Rutuja-966"
                },
                "userId": "ur211825009"
              },
              "summary": {
                "originalText": "Good"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Excellent. Very nice movie love it. &quot;A must-see,&quot; &quot;well worth seeing,&quot; &quot;definitely recommend this film to everybody&quot;. &quot;Intelligent writing,&quot; &quot;peak performances,&quot; &quot;masterpiece,&quot; &quot;truly great filmmaking,&quot; &quot;skillful,&quot; &quot;authentic charm&quot;. &quot;A moving production,&quot; &quot;emotionally strong,&quot; &quot;feel so angry in such a long time&quot; (in a powerful way)."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11042683/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026268",
              "author": {
                "username": {
                  "text": "HasnainS-35"
                },
                "userId": "ur206152898"
              },
              "summary": {
                "originalText": "Rating"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Good action liked the movie but of course propaganda against Pakistan. But overall good if you don&#39;t take the story seriously.<br/><br/>Because more then half of the stuff in the movie was not true at all but again it&#39;s a movie so can&#39;t say much. Overall good movie good acting good characters good action...."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026268/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006714",
              "author": {
                "username": {
                  "text": "swastik124"
                },
                "userId": "ur199256397"
              },
              "summary": {
                "originalText": "Action That Blows Your Mind, Drama That Touches Your Heart"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative slowly tightens its grip, combining suspense, action, and moral ambiguity. The lead performance is intense, subtle, and commanding, anchoring the story. Fight sequences are realistic and choreographed with narrative purpose, never gratuitous. Cinematography captures both the tension of confined spaces and the expanse of chaotic environments. Supporting roles are carefully constructed, enriching the narrative with depth and texture. The screenplay gradually escalates stakes, weaving personal and political conflict seamlessly. By the second half, tension explodes into a thrilling, emotionally resonant climax. This is cinema that is intelligent, visceral, and unforgettable."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006714/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013595",
              "author": {
                "username": {
                  "text": "Mallika-376"
                },
                "userId": "ur211589825"
              },
              "summary": {
                "originalText": "When u create an account..."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "So u know a movie is good when you create an account just to give it- it&#39;s well deserved 10. The casting and background score is par excellence. Each character perfectly fleshed out. I would watch it again in theater in a heartbeat. Do go watch so we can have more quality cinema.<br/><br/>Screw the trolls and naysayers."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013595/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010611",
              "author": {
                "username": {
                  "text": "kumkumbarik"
                },
                "userId": "ur127846411"
              },
              "summary": {
                "originalText": "Best movie of the Spy Universe"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A very well-written concept. The action sequences and music are top notch. Fantastic screenplay and exceptional acting by each and every cast of the film made it a must watch. Aditya Dhar yet again proved why he&#39;s the best in what he does. The power packed starcast like Ranveer Singh, Akshaye Khanna, Arjun Rampal, R Madhavan and Sanjay Dutt carried the movie with their phenomenal performance. Kudos and congratulations to the whole team for making such type of Indian cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010611/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015572",
              "author": {
                "username": {
                  "text": "Agrim-44"
                },
                "userId": "ur207873734"
              },
              "summary": {
                "originalText": "best movie of the decade for me"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story telling... the songs.... the art of making people still feel like what&#39;s gonna happen next... everything was perfect\nbollywood or i may say india need to make more movies like this...\ngot out of the theaters having an adrenaline rush\nthe kind of story it conatined was actually missing from the past or recent spy movies...\na must watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015572/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020870",
              "author": {
                "username": {
                  "text": "nilesh-68303"
                },
                "userId": "ur88029062"
              },
              "summary": {
                "originalText": "Just wow"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar isn&#39;t just another spy film - it&#39;s a full-on cinematic experience that grabs you by the collar and refuses to let go. Anchored by Ranveer Singh&#39;s powerhouse performance, this movie proves that Bollywood can still deliver intense, character-driven thrillers that feel both visceral and grounded."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020870/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006553",
              "author": {
                "username": {
                  "text": "imdbfan-1334580816"
                },
                "userId": "ur198195937"
              },
              "summary": {
                "originalText": "The Magic of Stars & Power of Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film offers a taut exploration of loyalty, morality, and power, unfolding with precise pacing and high tension. Ranveer Singh captivates with a performance that oscillates between quiet calculation and explosive action. Dhar&#39;s direction ensures narrative clarity, seamlessly integrating thrilling sequences with emotional depth. Supporting cast members provide layered portrayals that enhance authenticity. Cinematography captures both expansive and intimate moments, while the score heightens suspense, delivering an unforgettable cinematic experience."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006553/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015547",
              "author": {
                "username": {
                  "text": "makhijamini"
                },
                "userId": "ur155599528"
              },
              "summary": {
                "originalText": "Must watch movie .. that too minimum 2-3 times in hall"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch movie.. it shows the actual way the neighbours are behaving with India .. but this is new India .. andar ghus kar marega. Everyone should watch this movie minimum 2-3 times in hall.. Akshya khanna is the best.. waiting for 2nd part of the movie .. every actual indian should definitely watch and should be shown to GEn Z too .. so that they also know actually what happened with us in our recent history."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015547/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017980",
              "author": {
                "username": {
                  "text": "Sourya06"
                },
                "userId": "ur190395536"
              },
              "summary": {
                "originalText": "Banger Beauty"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the starting of the film it grips you to the seat and show a glimpse of how dark and bloody this world will be, the setting of films feels almost real like you are in Lyari and watching all these events unfold the team did a great job im designing the set<br/><br/>The casting director deserve a great credit, all the cast fitted so well in their character that it felt like they were really the characters they were playing, from Sir R. Madhavan to Sir Arjun Ram Pal, all fitted so well that it felt like they were real, Rehman Dakait&#39;s soul had possed Akshay Khanna I am sure of that, the intensity and charisma he brought<br/><br/>Arjun Ram Pal too fitted in the villainous character, from the moment he appeared on the screen he let us feel his presence, she showed us his presence by subtle but powerfull gesture like the moment when I tap of Sir Ranveer Singh&#39;s shoulder, he let us know that he is keeping an eye on<br/><br/>Sir Sanjay Dutt&#39;s character was too on point, when I did my research around his character, SP Aslam Chaudhary felt like Sanjay Dutt, but I think Sanjay Dutt played himself in this film, nothing new, his energetic vibe, his slants felt on point, but nothing new<br/><br/>R. Madhavan was unrecognizable in the role of Ajay Sanyal (Sir Ajit Doval) he was simply one of the strong hold of the movie<br/><br/>Ranveer Singh as Hamza was well written as a spy character who infiltrate and then will slowly take over the gang, less dialogues, less screen presence just like a spy movie should but Ranveer Singh did a really good job whenever shown, at last after the climax when he reached his home, you can see the exhaustion in his eyes and in the trembling of his hand<br/><br/>Sara Arjun, the girl I have been watching as a child actress when I too was a child, now have debut in Bollywood, her presence gave some light and warmth in this dark world<br/><br/>The makeup team the great job with the makeup and also the costume designers, never thought Pakistani wear can go this hard if worn right<br/><br/>The the beautiful banger music given by Shashwat Sachdev was the most strong point in this film in my opinion, the music he gave from energetic banger like Run Down the City, Ramba Ho to soft beauty like Gehra Hua, the music was on point<br/><br/>But in my opinion I guess sometimes the film doesnt utilize the music rightly, like it was put in random places, but in some other parts like thr climax car scene the Title track played in time<br/><br/>Great film\nGreat Casting\nGreat Acting\nGreat Story\nGreat Music\nMust watch (if you can then watch it in theater)"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017980/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009836",
              "author": {
                "username": {
                  "text": "kunalmatani"
                },
                "userId": "ur153304439"
              },
              "summary": {
                "originalText": "Best movie 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhruandhar is a high-octane action thriller that follows Dhruv, an ex-military intelligence officer forced out of retirement when a covert crime network threatens the city he once vowed to protect. Known for his unmatched precision and unbreakable moral code, Dhruv becomes the only obstacle between a ruthless syndicate and their plan to trigger chaos across the nation. As he dives deeper, he discovers the fight is no longer just against criminals-but against someone from his own past.<br/><br/>Packed with intense action sequences, emotional depth, and a gripping background score, Dhruandhar was praised in 2025 as one of the most powerful and engaging Indian action films of the year."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009836/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018571",
              "author": {
                "username": {
                  "text": "AnkitaS-565"
                },
                "userId": "ur211628035"
              },
              "summary": {
                "originalText": "Not just the best of this year, but the finest Bollywood film so far!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an outstanding film that keeps you engaged from start to finish. The story is gripping, the screenplay is tight, and every character is beautifully written. The performances are powerful, and the direction is top-notch. The balance of drama, action, and emotions makes the film a complete cinematic experience. The background score elevates the impact even more. Overall, Dhurandhar is a well-executed and highly entertaining film that truly deserves its high IMDb rating. For anyone who enjoys strong storytelling and impactful performances, this movie is a must-watch masterpiece."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018571/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006637",
              "author": {
                "username": {
                  "text": "kishorimarch"
                },
                "userId": "ur175104705"
              },
              "summary": {
                "originalText": "Power-Packed Action for Everyone"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The opening sequences establish an underworld pulsing with danger, with Ranveer Singh immediately immersing viewers in Hamza&#39;s morally complex journey. Each scene demonstrates his mastery of internal conflict: quiet deliberation in strategy rooms, explosive intensity in confrontations, and reflective vulnerability in personal moments. Sanjay Dutt dominates with gravitas and menace, while Akshaye Khanna and R Madhavan contribute intellectual tension that elevates even secondary plots. Arjun Rampal&#39;s subtle, simmering threat keeps viewers on edge, and Sara Arjun&#39;s emotional clarity underscores the stakes. Aditya Dhar&#39;s direction fuses narrative tension with dynamic action seamlessly. Cinematography captures sprawling cityscapes, narrow alleys, and intimate human moments alike, while the score punctuates every beat, building suspense toward a climactic resolution that is as satisfying emotionally as it is thrilling physically."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006637/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021070",
              "author": {
                "username": {
                  "text": "muzaffarsayyad-35621"
                },
                "userId": "ur185729816"
              },
              "summary": {
                "originalText": "Dhurandhar !!!!!!!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Hardly we see a spy movie like this where you see someone like Ranveer who keeps on knocking the door even he is so talented, very well written script with such a phenomenal cast and direction with so much dedication which can be seen in their acting. Each &amp; every character is the movie is so well written even like Donga &amp; Alam, everyone proved their characters worthy, the best mass movie I have seen until now, Sanjay Dutt, Akshaye Khanna, R Madhavan, Arjun Rampal, the characters they played are so challenging yet they proved worthy that the casting of the movie was perfectly plotted with their acting, such a nice script &amp; what a direction with the good old songs presence everywhere, you will surprise after each &amp; every chapter &amp; just keep on raising your eyebrows, worth watching !!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021070/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11060035",
              "author": {
                "username": {
                  "text": "drrajeevshukla"
                },
                "userId": "ur67848488"
              },
              "summary": {
                "originalText": "Surprisingly good - from a sceptic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I am usually a sceptic when it comes to movies like Dhurandhar only for it&#39;s over the top relentlessness. Went to watch with wife in 3rd week. It&#39;s fresh, cutting edge &amp; well executed. My wife liked it more than me. Ranveer Singh, Rakesh Bedi, Gaurav Gera &amp; Danish Pandor were my favourites along Akshay, Sanjay, Arjun Rampal &amp; others. Looking forwards to part 2. Pakistan is capital of terrorism &amp; this movie may be anti Pakistan &amp; not anti Muslim, which many left leaners got confused. So, looking forwards to part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11060035/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006814",
              "author": {
                "username": {
                  "text": "Jishankhan66"
                },
                "userId": "ur198244213"
              },
              "summary": {
                "originalText": "Unmatched Action, Unforgettable Stories"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s meticulous construction makes each scene feel intentional and impactful. Ranveer Singh delivers a compelling performance, balancing action with deep emotional nuance. Sanjay Dutt&#39;s presence is both formidable and magnetic, while Akshaye Khanna and R Madhavan enrich the story&#39;s complexity. Arjun Rampal brings quiet menace, and Sara Arjun adds emotional depth. Aditya Dhar&#39;s direction ensures suspense, pacing, and action are perfectly orchestrated. Cinematography captures both sprawling cityscapes and intimate character interactions, while the soundtrack accentuates tension. The second half escalates dramatically, culminating in a finale that is thrilling, emotional, and unforgettable."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006814/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}