{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xojdjotazcwzy472vhfojqrttm6bj73eodt7xoado6qebgnesk2d27o4yf3jchzk4j433n76ffy742necmzotani",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11023490",
              "author": {
                "username": {
                  "text": "akshayyr"
                },
                "userId": "ur86640639"
              },
              "summary": {
                "originalText": "The Movie Is A Blast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Most of the negative reviews around Dhurandhar feel forced and barely genuine. I watched the film with my friends a few days ago, and honestly, this is exactly what I want Bollywood to move towards. The film delivers solid action without turning mindless, performances that feel committed rather than lazy, and direction that knows what it wants to say. The pacing keeps you engaged, the atmosphere is gritty, and the execution feels confident. It doesn&#39;t insult the audience&#39;s intelligence and doesn&#39;t rely on unnecessary gimmicks. Overall, Dhurandhar is a well-made, engaging film that proves Bollywood can still deliver strong cinema when intent and craft come together."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023490/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006860",
              "author": {
                "username": {
                  "text": "imdbfan-5473096648"
                },
                "userId": "ur199124706"
              },
              "summary": {
                "originalText": "A Bold Story Fueled by Passion and Power"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story&#39;s gradual buildup makes each revelation and action set piece feel earned and impactful. Ranveer Singh anchors the narrative with a powerful performance, portraying both vulnerability and steely resolve. Sanjay Dutt&#39;s presence adds weight to the narrative, while Akshaye Khanna, R Madhavan, and Arjun Rampal create a dynamic ensemble whose interactions feel authentic and layered. Sara Arjun&#39;s performance brings emotional clarity amidst the chaos. Under Aditya Dhar&#39;s direction, suspense, political tension, and raw action coexist seamlessly. The cinematography captures the underworld&#39;s harshness, while the soundtrack complements both quiet and explosive sequences. By the second half, the tension and emotional stakes reach a peak that makes the film both thrilling and deeply affecting."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006860/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012668",
              "author": {
                "username": {
                  "text": "upamaroy2007"
                },
                "userId": "ur53070949"
              },
              "summary": {
                "originalText": "This film is a masterpiece. All low ratings are unwarranted & propagated."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "While the film runs well over three and a half hours, I still found myself wanting more even after the credits finished rolling.<br/><br/>Every actor delivers their role with absolute precision, the director brings brilliance to every frame, the cinematography is pure chef&#39;s kiss, and the music feels both refreshing and nostalgic. Pure perfection. An absolute masterpiece.<br/><br/>It is disappointing to see a smear campaign surrounding this movie, and I do not agree with people calling it &quot;toxic,&quot; &quot;masculine,&quot; or &quot;violent.&quot; The subject matter demands rawness, grit, gore, violence and a certain kind of masculinity because of the characters and world it portrays. I wish more people would actually watch the film, understand its plot points, and see the vision behind delivering an espionage spy thriller, something truly new for Indian cinema.<br/><br/>I cannot wait for 19 March 2026!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012668/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028690",
              "author": {
                "username": {
                  "text": "nancyyadav-35818"
                },
                "userId": "ur126056308"
              },
              "summary": {
                "originalText": "Hooked from 1st scene!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I had no expectations from this movie but all my doubts vanished when i watched it yesterday. I don&#39;t usually pay attention to Indian fighting or spy movies but this one has really got my attention.<br/><br/>Ranveer&#39;s acting was top notch, the plot was magnificent, the music, locations, cast everything was up to the mark. Akshay khanna gave remarkable performance as well, overall a 10/10 movie.<br/><br/>P. S- Not for faint-hearted as it consists of lots of graphic scenes.<br/><br/>Leet&#39;s see what part 2 will unfold. :)"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028690/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015911",
              "author": {
                "username": {
                  "text": "mahendrakumarpali"
                },
                "userId": "ur194864246"
              },
              "summary": {
                "originalText": "Solid movie 🔥🔥🔥💯"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Worth watching movie for movie lovers\nAnd Akshay Khanna character is very powerful and his skilll of acting are also a extraordinary fantabulous movie. And action securities are also very good in movie\nAnd movie are action stnays aree very good\nMusic bgm also very good old songs are use are very perfectly in this movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015911/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11041719",
              "author": {
                "username": {
                  "text": "sagarkarur"
                },
                "userId": "ur62638512"
              },
              "summary": {
                "originalText": "Near Perfect Espionage Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Saw this movie recently and I was mind blown by the storytelling, screenplay and the acting by all the members of the team.<br/><br/>As a person who has been an avid current affairs reader since the last 2 decades, and having watched a lot of spy/espionage movies and series on top the the books I read on Indian security related stories, I can say with confidence that this is a great movie. The director has done a great job and deserves huge credit for it.<br/><br/>Waiting for part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11041719/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016671",
              "author": {
                "username": {
                  "text": "KunalS-8842"
                },
                "userId": "ur211612422"
              },
              "summary": {
                "originalText": "Hats off to person choose akshay khanna fir that role"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshay khanna steel the movie with his performance and the style he attires. He is the man of the ceremony.<br/><br/>Excellent performance sir bows down.<br/><br/>Many makers should consider akshay for roles, he is an extraordinary actor, don&#39;t stick to these names, actors are different and names are different.<br/><br/>If you need acting for roles consider akshay khanna type actors."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016671/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020617",
              "author": {
                "username": {
                  "text": "parmarviraludesang"
                },
                "userId": "ur166066599"
              },
              "summary": {
                "originalText": "Excellent work By Aditya Dhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every Characters Matched so perfectly that for a while, I think I had been there, Not in Theatre. Based On True Events, Shows real Face of Terror Funding. Ranveer Singh did a Great Great Job, but Akshay khanna Stole the show with his brilliant acting skill. Arjun Rampal, R. Madhavan, Sanjay Dutt and others Co actors won our Hearts. This Film don&#39;t biased to any religion, country, Caste and ideology. It is Based on Truth that is hidden for so long.<br/><br/>Salute to Aditya Dhar. And Whatttt a BGM 😮"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020617/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015982",
              "author": {
                "username": {
                  "text": "Saubhgya-2"
                },
                "userId": "ur211606584"
              },
              "summary": {
                "originalText": "Good film for 16+"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It is one of the best movie of 2025. It shows reality and violence both not only meaningless violence like other movies.<br/><br/>Dhurandhar is a compelling and masterful espionage thriller that delivers an unforgettable cinematic experience. Director Aditya Dhar has crafted an ambitious, well-made film that stands out from the typical fare in the genre, offering a raw, brutal, and unapologetic look into the world of covert operations. The movie is a triumph of technical craft, meticulous world-building, and some truly outstanding performances that keep the audience invested despite its extensive runtime.<br/><br/>Overall, Dhurandhar is a powerful, big-screen experience filled with patriotism, courage, and power-packed performances that make it a must-watch for anyone who appreciates a well-made, character-driven espionage saga."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015982/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015578",
              "author": {
                "username": {
                  "text": "Parth-5126"
                },
                "userId": "ur211603574"
              },
              "summary": {
                "originalText": "What Action, what dialogues, overall a great film."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The play time is 3.5 hrs approx, but hooked for each and every ~3.5*60*60*60 millisecond.<br/><br/>The level of action was very unique and felt real, the dialogues are raw and relates to real life.<br/><br/>And no extra romantic scenes, pure action thriller. Great stoy writing and cinematics. This is totally a worth watch.<br/><br/>This movie has set standards for the bollywood, and should be released globally."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015578/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015138",
              "author": {
                "username": {
                  "text": "shivambhatnagar74"
                },
                "userId": "ur126566277"
              },
              "summary": {
                "originalText": "Most Realistic Spy Flim From Bollywood."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best written and real spy flim ever made in India. Definitely deserves a theatre watch for it&#39;s engrossing story although it&#39;s running time is 3 hours &amp; 34 mins but won&#39;t even realise where the time went and every Indian should watch this movie see what R&amp;AW and IB in India actually does unlike what&#39;s shown in over the top &quot;spy universe&quot; flims from other production houses like YRF. And what our &quot;peaceful&quot; neighbour Pakistan does is supported by their state."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015138/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017825",
              "author": {
                "username": {
                  "text": "Saurav-30"
                },
                "userId": "ur211620553"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar&quot; is the kind of movie that surprises you in the best way. I went in without big expectations, but the film pulled me in almost immediately. It has that rare mix of fun, excitement, and emotion that keeps you watching without ever checking the time. What I liked most is how natural everything feels - the story doesn&#39;t try too hard, the humour doesn&#39;t feel forced, and the emotional moments actually hit.<br/><br/>The lead actor carries the movie really well. He has this easy screen presence that makes you connect with him instantly, and you actually care about what happens to his character. The supporting cast also does a solid job. Even the smaller roles feel important, and everyone gets at least one moment that stays with you. Their chemistry makes the movie feel grounded and real.<br/><br/>The visual style is another big plus. The movie looks clean, colourful, and well-shot. The timing of the cuts, the way scenes are framed, and even the simple moments all feel thoughtfully done. The music also plays a big part - the background score lifts the energy, and some scenes feel more impactful because of it.<br/><br/>What I appreciated most is the heart of the movie. Behind all the fun and entertainment, &quot;Dhurandhar&quot; has something to say about loyalty, courage, and believing in yourself. It&#39;s not preachy, but the message lands naturally through the characters and their choices. That&#39;s what makes the film stick with you even after it ends.<br/><br/>Overall, &quot;Dhurandhar&quot; is a refreshing watch - entertaining, meaningful, and memorable. It&#39;s one of those movies that make you feel good, make you think a little, and leave you satisfied. Definitely worth appreciating."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017825/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011172",
              "author": {
                "username": {
                  "text": "dharmesh-53"
                },
                "userId": "ur211572450"
              },
              "summary": {
                "originalText": "A Surprisingly Engaging Thriller with Strong Performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I didn&#39;t expect Dhurandhar to hit this hard. The story is raw, the emotions feel real, and the film builds tension in a way that keeps you thinking long after it ends. The lead&#39;s performance is honest and relatable. A few scenes are slow, but the payoff is strong.<br/><br/>Highly recommended for anyone who loves meaningful cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011172/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012489",
              "author": {
                "username": {
                  "text": "Manoj-4086"
                },
                "userId": "ur207884369"
              },
              "summary": {
                "originalText": "Great movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those movies that doesn&#39;t try to be overly stylish or preachy - it just tells its story in a raw, honest way. From the very first scene, you can feel the dusty town vibe, the tension in the streets, and the constant push-and-pull between power and survival. It feels real, like something you could actually witness in any small town where politics and personal ego clash every day.<br/><br/>The first half moves really well. Characters are introduced smoothly, and you actually start caring about them without even realising it. The lead actor carries the film with a mix of calm intensity and emotion that feels natural, not forced. The action scenes are not over-the-top; they look like real fights, messy and unpredictable, which makes them way more engaging."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012489/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006716",
              "author": {
                "username": {
                  "text": "HeenaK-631"
                },
                "userId": "ur210345456"
              },
              "summary": {
                "originalText": "Drama That Keeps You on the Edge"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The pacing of the film ensures that tension, suspense, and emotion all coexist perfectly. Ranveer Singh delivers a nuanced performance, while Sanjay Dutt&#39;s authority is palpable. Akshaye Khanna and R Madhavan provide layered supporting roles, and Arjun Rampal&#39;s menace contrasts with Sara Arjun&#39;s vulnerability. Aditya Dhar&#39;s direction balances intense action with narrative strategy, and the cinematography captures both expansive cityscapes and intimate character beats. The score heightens suspense, and by the finale, the narrative delivers both emotional and adrenaline-fueled satisfaction."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006716/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022857",
              "author": {
                "username": {
                  "text": "biologyaktn"
                },
                "userId": "ur157943002"
              },
              "summary": {
                "originalText": "Please make more like this!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Story.. amazing.<br/><br/>Background track.. amazing\nActing amazing<br/><br/>Sunjay dutts part was a bit boring. But else it&#39;s amazing.<br/><br/>I hope the trend changes and becomes of movies like this.<br/><br/>Really loved Akshay Khanna&#39;s acting.<br/><br/>Definitely gonna rewatch it.<br/><br/>Ramba ho with Ranveers hair flip is amazing.<br/><br/>Kahrach majja ali.<br/><br/>Make more please."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022857/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027131",
              "author": {
                "username": {
                  "text": "rishabhmishra-85066"
                },
                "userId": "ur133161532"
              },
              "summary": {
                "originalText": "Real spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The actings of all the stars in the film is phenomenal but I liked akshaye khanna and ranveer singh most in the film...the reality is phenomenal....\nAkshaye khanna as a rehman dakait is phenomenal and classy....&amp; The spy action ,,romance,living in the Pakistan with truly admirable...all the scenes in the movie hits me hard ."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027131/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11032478",
              "author": {
                "username": {
                  "text": "sonianujmohit"
                },
                "userId": "ur115981700"
              },
              "summary": {
                "originalText": "Undoubtedly! most realistic spy-thriller movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Why its a must-watch:\n1. Extremely well paced, you won&#39;t feel the time throughout the movie, only time I felt bored was during ad breaks in PVR.<br/><br/>2. IMAX movies are always pleasing to eyes, do take middle seats and scenes and bass will give you chills.<br/><br/>3. It shows true colors of pakistan, not just a hindu-muslim concept, but gangs/politicians working for money and power.<br/><br/>4. Top notch acting by Ranveer Singh, Akshay Khanna, Sanjay Dutt, R. Madhvan, Arjun Rampal. Even actress and side actors were brilliant.<br/><br/>5. Amazing screenplay, you will start to belive you are in Pakistan, and many times feel sad for the nation.<br/><br/>6. Build-up and explaination was amazing, from the beginning they made us understand requirment for the plan Dhurandar.<br/><br/>Not so good aspects:\n1. Too many dialogues to convey hatered for current government(i.e Congress) and a build-up for the new government(i.e Modi Govt.)\n2. Not many wow/claps/hooting moments, theatre was almost silent\n3. Too much Gore, somewhat was required to show brutality, but making it a Final Destination death was not needed.<br/><br/>4. Just one dialogue that should have been corrected, terrorist says, &quot;Hindu darpok kom hai&quot;, should have said &quot;Bhartiya darpok log hai&quot;. This may make some communal tensions, other that this scene/dialogue no other, not even single scene shows hindu-muslim divide."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032478/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11043674",
              "author": {
                "username": {
                  "text": "marlonbrando-77112"
                },
                "userId": "ur158637260"
              },
              "summary": {
                "originalText": "Best spy film in recent year"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best spy film in recent years. It shows what Bollywood has been missing for a long time. And after seeing the meltdown, it proves some of the points shown in the movies.<br/><br/>It has such good and melodious songs, and all the music fits the scene. I&#39;m waiting for the 2nd part eagerly. Hoping that it could stand up on the hype."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11043674/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010680",
              "author": {
                "username": {
                  "text": "Abhishek-7134"
                },
                "userId": "ur211569153"
              },
              "summary": {
                "originalText": "Reality Check-In Into the Espionage world"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Skip Dhurandhar if you&#39;re craving YRF&#39;s glossy spy fantasies. No sleek cars, no bikini-clad bombshells, no cheesy RAW-ISI romance crap. Dhurandhar slams you with the brutal, blood-soaked reality of espionage. It&#39;s a kickass beast that doesn&#39;t pull punches.<br/><br/>Clocking in at a massive 3 hours 30 minutes, it still flies by without a single dull second. The relentless pace hooks you and keeps you glued to the edge of your seat. That background score? Pure adrenaline fuel that ramps up the chaos. Some scenes are so raw and visceral that they twist your insides. And those 26/11 audio clips? They ignite a firestorm of fury you will never forget."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010680/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11076160",
              "author": {
                "username": {
                  "text": "animesh-singh"
                },
                "userId": "ur24624752"
              },
              "summary": {
                "originalText": "One of greatest movie by bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This time bollywood (hindi cinema) has cracked it. I liked it in all perspectives and has become one of the greatest movies that bollywood (hindi cinema) has made in contrast to the headless movies made in hindi cinema lately. Bollywood (hindi cinema) has been failing in making good movies, congratulations to the makers, keep doing the same."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-30",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11076160/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018363",
              "author": {
                "username": {
                  "text": "aaravsaxena-89907"
                },
                "userId": "ur187709225"
              },
              "summary": {
                "originalText": "Excellent movie after a long from Bollywood."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "An excellent movie with masterful cinematography. The character of Rehman dakait was phenomenal and all the actors did a very good job. Soundtracks used were amazing. Each and every scene was very engaging. Their way of narration via chapters was also very good. Make sure to watch it in cinemas only because the cinematography deserves a big screen."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018363/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016398",
              "author": {
                "username": {
                  "text": "BiswajitM-717"
                },
                "userId": "ur211608685"
              },
              "summary": {
                "originalText": "Fantastic..."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is awesome...Curiosity is hidden in every minute..And Ranveer acting made it perfect...Also Aditya Dhar make this movie just fantastic..Watch it I hope all of you are gonna like this movie...All of actors are act perfect...And biggest part in this movie shown how Indian Spy transfer Pakistan&#39;s secret information."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016398/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007362",
              "author": {
                "username": {
                  "text": "senn-83866"
                },
                "userId": "ur154427352"
              },
              "summary": {
                "originalText": "Fast-Paced Action and Heartfelt Moments"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene feels meticulously crafted, with tension simmering beneath the surface until it erupts in moments of shocking intensity. Ranveer Singh dominates the screen with a performance that is both restrained and powerful, capturing the psychological toll of navigating a dangerous world. The supporting cast is equally compelling, adding nuance to the political and criminal machinations. Director Dhar balances suspense, action, and emotion flawlessly, making each sequence feel purposeful. The cinematography highlights the stark contrasts of Karachi&#39;s streets, while the soundtrack complements the narrative, resulting in a gripping, immersive experience that lingers long after the theater lights come up."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007362/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024710",
              "author": {
                "username": {
                  "text": "amartyapandey"
                },
                "userId": "ur126841675"
              },
              "summary": {
                "originalText": "Redefines Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar delivers a pulse-pounding spy thriller that redefines Bollywood action with raw intensity and a stellar ensemble. Ranveer Singh transforms into the undercover operative Hamza, blending vulnerability with volcanic fury in a career-best performance. Director Aditya Dhar crafts a labyrinth of gang wars, terror networks, and geopolitical intrigue inspired by real RAW operations. Standout Performances Akshaye Khanna rules as the sly antagonist Rehman Dacait, stealing scenes with understated menace. Sanjay Dutt brings gravelly authority, Arjun Rampal delivers chills, and R. Madhavan adds sharp intellect. Technical Brilliance The nearly 3.5-hour runtime flies by with panoramic cinematography capturing gritty Karachi streets and a score remixing classics into adrenaline anthems. Action sequences erupt with strategic choreography, from chases to brutal combat. Why It&#39;s a Must-WatchThis Part 1 masterpiece balances drama, edge, and tension, leaving you hungry for the sequel. Despite minor pacing hiccups, its epic scope earns a 9.5/10-catch it in theaters."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024710/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}