{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xohcrotazcwzy472vxfojtr3smwab73iod77peato6qebgnesk2d23oq2vvjch6k23tgxchn7gejg3pd3qign4oe",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11020217",
              "author": {
                "username": {
                  "text": "adityajat-04152"
                },
                "userId": "ur185468619"
              },
              "summary": {
                "originalText": "A Crowd-Pleaser with Heart, Humor, and Heroics"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar plants itself squarely in that satisfying zone where a film knows exactly what it wants to be: energetic, emotional, and larger than life. The story leans into familiar archetypes, but the execution is lively enough that the familiar becomes fun rather than predictable.<br/><br/>The film orbits around Dhurandhar, the kind of protagonist who seems carved out of the same rock as classic folk heroes. He is equal parts stubborn, clever, and tender-hearted. His defining trait is an odd mix of bravado and vulnerability; he charges into trouble like a bull but quietly wrestles with doubts when it comes to the people he loves. The film wisely lets these contradictions breathe, giving the audience someone who feels human rather than mythic.<br/><br/>Opposite him is Gauri, a sharp-tongued, free-thinking character whose presence adds both emotional depth and comedic combustion. Her role isn&#39;t limited to being a romantic foil; she is a catalyst who pushes Dhurandhar to examine his own values. Their chemistry works not because they are perfect for each other but because they genuinely irritate, challenge, and inspire one another.<br/><br/>Then there&#39;s Mama Saheb, the antagonist who steals more scenes than he deserves. He&#39;s crafty instead of cartoonish, and his schemes give the film its momentum. His dynamic with Dhurandhar becomes a playful chess match-a recurring tension between brute improvisation and polished manipulation.<br/><br/>The film&#39;s most popular moments tend to be the ones where its tone snaps into high gear. Audiences keep talking about the chaotic marketplace showdown, where Dhurandhar turns a simple argument into a hilariously escalating spectacle, complete with improvised weapons, brilliant one-liners, and a sense of physical comedy that never tips into slapstick. Another scene that struck a chord is the quiet nighttime conversation between Dhurandhar and Gauri on the village bridge, where the film lets its emotional spine show without melodrama. It&#39;s the kind of moment that softens everything around it.<br/><br/>The soundtrack works like narrative seasoning-each song sharpens the film&#39;s flavor. &quot;Sher Maza Zindabad&quot; became the defacto anthem of Dhurandhar&#39;s swagger, a rhythmic, percussion-heavy piece that urges the audience to thump along. &quot;Manaachi Gani&quot; is the heart&#39;s counterweight to the heroics; it blends folk instrumentation with mellow vocals, turning Gauri&#39;s inner world into something audible. The festival number &quot;Rang Bari Dhurandhar&quot; is pure spectacle: color, choreography, and a jubilant crowd sequence that&#39;s practically engineered for repeat viewing.<br/><br/>In short, Dhurandhar doesn&#39;t reinvent the cinematic wheel, yet it rolls with such gusto that resisting its charm becomes difficult. It&#39;s a film that swings between mischief and sincerity and manages to carry the audience along for the ride. The characters are memorable not because they&#39;re flawless, but because they stumble and roar and blunder with the kind of energy that keeps the story alive well after the credits.<br/><br/>Exploring how modern regional cinema blends classic folk-hero storytelling with contemporary tone offers fertile ground for further discussion."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020217/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025684",
              "author": {
                "username": {
                  "text": "maddygabhane"
                },
                "userId": "ur62170306"
              },
              "summary": {
                "originalText": "Masterpiece by Aditya Dhar, great casting and story telling."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Masterpiece by Aditya Dhar, great casting and story telling...<br/><br/>Inspired by true events , the characters and their performance is top class, gripping acting and performance , Akshaye khanna is comeback king for 2025, after chhava.<br/><br/>Character of Rehman Dakait is players really well, he outshines amongst all the actors."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025684/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025679",
              "author": {
                "username": {
                  "text": "citemail"
                },
                "userId": "ur108240954"
              },
              "summary": {
                "originalText": "A Rare Bollywood Epic Where Time Simply Disappears"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After ages, Bollywood delivers a film driven by story, not noise.<br/><br/>It opens a window into history, sparks genuine curiosity, and keeps you hooked about what comes next. A must-watch.<br/><br/>You walk out of the theatre genuinely surprised that it&#39;s a three-and-a-half-hour film. It flows like a single, continuous moment that captures everything without dragging.<br/><br/>Highly rewatchable. Timeless in the way RRR and Baahubali are. Rare, confident filmmaking that respects the audience&#39;s intelligence."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025679/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007071",
              "author": {
                "username": {
                  "text": "mainihalsinghhu"
                },
                "userId": "ur196196721"
              },
              "summary": {
                "originalText": "A saga that roars from its opening moment"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands out for its seamless blend of suspense, action, and emotion. Ranveer Singh portrays a character torn between ambition and conscience with remarkable authenticity. Director Dhar ensures that every scene, from intimate exchanges to large-scale confrontations, carries significance and weight. Action sequences are choreographed with meticulous detail, heightening realism without sacrificing cinematic flair. The supporting cast delivers compelling performances, adding texture to the story&#39;s moral landscape. Cinematography and background score complement the storytelling perfectly, making the film a tense, immersive journey from start to finish."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007071/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016212",
              "author": {
                "username": {
                  "text": "SaujyendraD"
                },
                "userId": "ur211608413"
              },
              "summary": {
                "originalText": "Best Bollywood Movie 🎥 till now watch it carefully ✨ and enjoy every small detail was perfect 💯"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is so good 👍 huge respect to makers of the Movie keep making this kind of movie worth watching ✨🔥The lead actor delivers a powerful performance, portraying strength, vulnerability, and intelligence with remarkable ease. His screen presence keeps you hooked, and every scene featuring him feels impactful. The supporting cast also shines, offering strong performances that elevate the film even further. Their interactions feel natural and engaging, adding layers to the overall storyline.<br/><br/>The direction deserves special appreciation. The filmmaker handles complex themes with clarity and confidence. The transitions, dialogues, and emotional beats are all placed perfectly, which keeps the viewer fully invested. The movie&#39;s cinematography is visually appealing, with well-shot scenes that enhance both the drama and the thrill. The background score amplifies the mood without overpowering it, especially during the more intense moments.<br/><br/>What makes Dhurandhar stand out is its ability to keep the audience guessing. Just when you feel you know what will happen next, the movie introduces a twist that shifts the entire tone. This unpredictability makes the film exciting and memorable.<br/><br/>Overall, Dhurandhar is a must-watch. It&#39;s engaging, stylish, emotional, and incredibly well-crafted. For me, it stands out as one of the best films I&#39;ve watched recently. It leaves you thinking about its message long after it ends, and that&#39;s the mark of a truly impactful movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016212/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008927",
              "author": {
                "username": {
                  "text": "jatinjio-96998"
                },
                "userId": "ur158582451"
              },
              "summary": {
                "originalText": "A Must-Watch Experience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A gripping and well-crafted film with strong performances and engaging direction. The story holds your attention throughout, and the visuals enhance every moment. Though a few scenes feel slower, the overall impact is powerful and worth watching. A gripping and well-crafted film with strong performances and engaging direction. The story holds your attention throughout, and the visuals enhance every moment. A few scenes dip in pace, but the emotional depth and impactful execution make it a memorable and worthwhile watch."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008927/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012693",
              "author": {
                "username": {
                  "text": "pcbtechnicalsonic"
                },
                "userId": "ur150799113"
              },
              "summary": {
                "originalText": "Best movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "⭐ Movie Review: DHURANDHAR - 10/10 ⭐\n&quot;Pure mass, pure energy, pure entertainment. Dhurandhar delivers on every level.&quot;<br/><br/>Dhurandhar is the kind of film that grabs your attention from the first scene and keeps you hooked till the very end. The lead actor absolutely dominates the screen with strong dialogue delivery, powerful expressions and whistle-worthy action moments. The story is simple but executed in a tight, engaging way with zero dull moments.<br/><br/>🎬 Acting:\nEvery actor plays their part perfectly. The protagonist shines the most - intense when needed, funny when needed, and always confident on screen.<br/><br/>🔥 Action &amp; BGM:\nThe action scenes are high-energy and full paisa-vasool. The background music boosts every moment and gives the film a larger-than-life feel.<br/><br/>📸 Direction &amp; Cinematography:\nThe visuals are stylish and clean. The direction keeps the pacing sharp, emotions balanced, and excitement high throughout the movie.<br/><br/>👍 Verdict:\nDhurandhar is a complete blockbuster entertainer - a perfect mix of action, drama and mass moments.<br/><br/>If you love high-energy cinema, this one is a must-watch.<br/><br/>⭐ Rating: 10/10 - Highly Recommended! ⭐"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012693/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017054",
              "author": {
                "username": {
                  "text": "PrachiS-703"
                },
                "userId": "ur211616092"
              },
              "summary": {
                "originalText": "Must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch Dhurandhar...Movies like Pathan and the Tiger series should learn from Dhurandar. I mean, Dhurandar is so grounded - they have truly stuck to reality when it comes to the story. Frankly, SRK and Salman could consider taking some acting lessons from the actors in Dhurandar. I don&#39;t think I will watch any more spy movies by YRF that present such plain lie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017054/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013625",
              "author": {
                "username": {
                  "text": "parthapratimsaha-91152"
                },
                "userId": "ur128379224"
              },
              "summary": {
                "originalText": "Awesome acting, awesome direction and music wallah"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Awesome acting, awesome direction and music wallah!!!!<br/><br/>Akshay Khanna you own the film.<br/><br/>Thank Dharma ji for showing unfiltered truth.<br/><br/>Every songs are beauty to the ears.<br/><br/>The start with Bhagavad Gita surely one thing stand out. Eagerly waiting for the next part. All the best team. 10 start from me."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013625/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010266",
              "author": {
                "username": {
                  "text": "ollinone"
                },
                "userId": "ur187445712"
              },
              "summary": {
                "originalText": "excellent"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I am a huge Ranveer Singh fan, and he has delivered a powerful performance once again, fully energetic and completely into his character. But honestly, Akshay Khanna stole the show. His screen presence, intensity, and calm dominance make every scene memorable.<br/><br/>A big shout-out to Aditya Dhar - what a brilliant filmmaker! His vision, detailing, and direction clearly show how superb he is. The film is a full-on spy thriller, packed with tension, twists, and smart storytelling.<br/><br/>Also, if you enjoy spy-style films, Siddharth&#39;s Majnu was another very good watch - gripping and well-made."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010266/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007206",
              "author": {
                "username": {
                  "text": "SanaK-395"
                },
                "userId": "ur211547470"
              },
              "summary": {
                "originalText": "Non-Stop Action with Star Power"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film excels at weaving narrative, suspense, and action into a coherent cinematic experience. Ranveer Singh delivers a complex performance, combining tactical intelligence, emotional depth, and physicality. Sanjay Dutt adds authority and menace, while Akshaye Khanna and R Madhavan elevate the ensemble. Arjun Rampal&#39;s understated menace keeps viewers on edge, and Sara Arjun&#39;s performance humanizes the stakes. Aditya Dhar&#39;s direction ensures pacing, suspense, and action sequences coexist seamlessly. Cinematography captures chaos and intimacy, and the score amplifies every dramatic beat. The second half escalates into a thrilling, emotionally resonant climax."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007206/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026316",
              "author": {
                "username": {
                  "text": "Kavita-740"
                },
                "userId": "ur211689155"
              },
              "summary": {
                "originalText": "Engaging, spine chilling confidence revealing!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Overall this is a very zabardast movie which is my favorite and perfect in all the ways whether it is action, thriller, brutality, comic timings and so on from my side 10 on 10 to this masterpiece.<br/><br/>Aditya dhar deserves an Oscar for showing everyone the reality of Pakistan.. Salute to all the actors and the spy for representing our country."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026316/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010371",
              "author": {
                "username": {
                  "text": "LaxmiR-265"
                },
                "userId": "ur206405982"
              },
              "summary": {
                "originalText": "Best Indian Spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie has great story telling. Too good actors, too good songs. You will enjoy the movie its worth watching in theatre. I don&#39;t see any movie coming close in comparison. Women even for a second in movie has very impact scene, you will remember them. Not like movies who only keep main actor all scenes. All characters are super important."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010371/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010356",
              "author": {
                "username": {
                  "text": "rakesh-46266"
                },
                "userId": "ur113049044"
              },
              "summary": {
                "originalText": "Finally I understood what Masterpiece is all about"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar,\nSuperbly awesome.<br/><br/>Action, direction, screenplay, bgm, Brilliance of highest order..<br/><br/>Besides the star-studded cast, How one can visualize forgotten actors like Rakesh bedi, soumya tandon, arjun rampal to perform the fabulous acts they all have delivered, is unimaginable. Casting is supremely impressive..<br/><br/>I kept wondering where all theses scenes were shot which are strickingly similar to that of pakistan. The whole market, people with islamic clads roaming all around &amp; this whole exercise of recreating a small town of Karachi called lyria.<br/><br/>For examaple, a scene wherein Such a huge crowd gathered when Mr. Zardari, the husband of then late prime minister of Pakistan benazir bhutto was giving a speech. Creating such scenes which indeed makes you feel like being one of them in pakistan.<br/><br/>Kudos to the makers<br/><br/>This is sort of once in a lifetime flick that one gives such strong reaction/reviews for.<br/><br/>A spoiler: if you are wondering, after watching the movie, who were those indian politicians who sold our currency impression plates of 500&amp;1000 legal tenders to khannani brothers or ISI, then here is the revelation.<br/><br/>Chidambram &amp; his son."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010356/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006699",
              "author": {
                "username": {
                  "text": "kunuiam"
                },
                "userId": "ur166745858"
              },
              "summary": {
                "originalText": "High-Octane Scenes You'll Remember"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every moment of the film feels deliberate and charged with meaning, offering a blend of thrilling action and nuanced storytelling. Ranveer Singh delivers an electrifying performance, embodying both intensity and emotional depth, while the supporting actors provide rich, layered portrayals. Director Dhar masterfully navigates complex themes of loyalty, power, and morality, crafting a narrative that is both gripping and reflective. Action sequences are executed with breathtaking precision, while cinematography captures both grandeur and subtle emotional beats with elegance. Editing ensures that tension is sustained without overwhelming the viewer, and the musical score underlines the drama and suspense with subtlety. By the end, the film leaves a profound impact, balancing spectacle, emotion, and intelligence to create an unforgettable cinematic journey."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006699/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029827",
              "author": {
                "username": {
                  "text": "Arvinds-196"
                },
                "userId": "ur211715823"
              },
              "summary": {
                "originalText": "A Casting Thought on Dhurandhar: Why Sidharth Malhotra Feels Like a Natural Fit"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a film that carries the weight of bravery, sacrifice, and realism on its shoulders. Everything about the narrative, the treatment, and the emotional core works well, yet one aspect that invites personal reflection is the casting choice for the character of Major Mohit Sharma. While Ranveer Singh is undeniably a powerful performer, there is a lingering thought that Sidharth Malhotra might have been a more fitting choice for this role.<br/><br/>The resemblance between Sidharth Malhotra and Major Mohit Sharma is striking. Beyond physical similarity, there is a quiet intensity in Sidharth&#39;s screen presence that aligns naturally with the disciplined, grounded aura of an Indian Army officer. Major Mohit Sharma was known for his calm courage, sharp focus, and restrained strength qualities that demand subtlety more than flamboyance. This is where Sidharth Malhotra excels.<br/><br/>His performance in Shershaah stands as strong evidence. As Captain Vikram Batra, Sidharth portrayed bravery not through loud heroism, but through emotional control, sincerity, and inner fire. He understood the silence behind the uniform-the weight of duty, the personal cost of service, and the unspoken fear that coexists with courage. That same emotional maturity would have translated beautifully into the character of Major Mohit Sharma in Dhurandhar.<br/><br/>Ranveer Singh brings immense energy and transformative dedication to his roles, but his style often leans toward expressive intensity. For a character rooted in realism and tactical intelligence, a more understated approach might have enhanced authenticity. Sidharth&#39;s restrained performance style could have allowed the story to breathe, keeping the focus firmly on the mission, the man, and the meaning of sacrifice.<br/><br/>Ultimately, Dhurandhar remains impactful, but imagining Sidharth Malhotra in the role of Major Mohit Sharma opens an interesting discussion on casting, realism, and emotional alignment-one that highlights how sometimes, quiet strength speaks louder than dramatic flair."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029827/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009398",
              "author": {
                "username": {
                  "text": "reshmark-62200"
                },
                "userId": "ur176669154"
              },
              "summary": {
                "originalText": "Indian Cinema at Its Finest"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I just watched Dhurandhar, and I&#39;m truly blown away. The film is spectacular in every sense. Bow down to the director. Every single frame felt like something Bollywood hasn&#39;t delivered before. At this point, it doesn&#39;t even feel right to compare Indian cinema to Hollywood; our films are already operating on their own level. But Dhurandhar stands out even within that; its filmmaking is top-tier.<br/><br/>Despite being 3 hours and 30 minutes long, the movie never once felt stretched. The pacing was tight, the editing was crisp, and the colour grading was stunning. Every frame was crafted with intention. Every frame was classy and impactful. The music was beautiful, and the BGM in the second half was especially outstanding.<br/><br/>Akshaye Khanna.. what a beautiful actor. His style, his presence, his impact... impeccable. Every time he appeared on screen, he elevated the moment. He deserves a bow.<br/><br/>And then there&#39;s Ranveer Singh. The way he commanded the screen, even in silence, was extraordinary. He continues to prove his versatility film after film: Padmaavat, Gully Boy, Rocky Aur Rani Ki Beti, Bajirao Mastani, Ram-Leela, Dil Dhadakne Do, 83, and now Dhurandhar. Truly spectacular. At this point, I&#39;m not sure if he can even be compared to any actor of his generation. He is in his own league. People can say whatever they want, but they cannot take away the fact that Ranveer Singh is a brilliant, versatile, audacious performer. He absolutely nailed this role and cannot wait for part 2.<br/><br/>The rest of the cast- R. Madhavan, Arjun Rampal, Sanjay Dutt, Rakesh Bedi, Sara Arjun and others were all powerful contributors to this cinematic experience. Each of them delivered exactly what the film needed. What a casting.<br/><br/>Overall, Dhurandhar is a masterclass in filmmaking, performance, and storytelling..<br/><br/>Take a bow, team."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009398/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001961",
              "author": {
                "username": {
                  "text": "kongk-9"
                },
                "userId": "ur201779003"
              },
              "summary": {
                "originalText": "Everything was on point. just the female lead actress didn't work. the age gap was visible."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Everything was good. Untill female lead show up. All actors did good job. And story was on point. Specially i enjoyed Akshay Khanna a lot. But it have some bad side too. As teenagers watch this movies and they can learn much history from it. Movie should not have those vulgar and adult angle.overal i enjoyed. But the female lead didn&#39;t fit. And also the dress of her."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001961/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020112",
              "author": {
                "username": {
                  "text": "user-836-558382"
                },
                "userId": "ur47849069"
              },
              "summary": {
                "originalText": "A gripping story with powerful performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar surprised me in a good way. The story is tight, the performances are strong, and the film keeps you hooked till the end. The pacing is good, and the emotional moments hit well. Overall it&#39;s a gripping and well-made movie. Definitely worth watching. The background score and cinematography add to the overall experience, enhancing both the mood and the pace of the film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020112/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11061807",
              "author": {
                "username": {
                  "text": "bobbydevgan"
                },
                "userId": "ur103652412"
              },
              "summary": {
                "originalText": "Blockbuster"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerful and engaging movie with a strong storyline and impactful performances. The direction keeps you hooked from start to finish, and the action sequences are well-executed without losing emotional depth. The background score perfectly matches the intensity of the scenes. Overall, it&#39;s a gripping watch and definitely worth your time. Highly recommended for action-drama lovers."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11061807/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11030875",
              "author": {
                "username": {
                  "text": "Gaurav-203"
                },
                "userId": "ur211661674"
              },
              "summary": {
                "originalText": "Must Watch for Akshay Khanna"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "An outstanding, no-nonsense film with exceptional performances by Akshaye Khanna, Ranveer Singh, R. Madhavan, Sanjay Dutt, and Arjun Rampal. This movie will be remembered for decades, much like Sholay. I&#39;ve become a fan of Aditya Dhar-earlier, I would watch a film only if it was directed by Sanjay Leela Bhansali, and now I feel the same about Aditya Dhar. Thank you for creating such a masterpiece."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11030875/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007337",
              "author": {
                "username": {
                  "text": "abeertaneja"
                },
                "userId": "ur132254856"
              },
              "summary": {
                "originalText": "Best Movie of the year- MUST WATCH"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an absolute blast! Ranveer Singh delivers one of his most energetic and engaging performances, while Akshaye Khanna shines with his trademark intensity and effortless screen presence. Their chemistry alone makes the film worth watching.<br/><br/>The direction is sharp, stylish, and keeps the story moving at a perfect pace. The writing is tight, entertaining, and full of moments that genuinely surprise and delight.<br/><br/>A must-watch-brilliant acting, great story, and top-notch direction!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007337/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010517",
              "author": {
                "username": {
                  "text": "mmkmisc"
                },
                "userId": "ur106624752"
              },
              "summary": {
                "originalText": "Fantastic cinematic experience!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Yes. It&#39;s long. Yes. It&#39;s got blood n gore. Loads of it.<br/><br/>BUT it&#39;s one of the most watchable movies of recent times! Each character stands out, brilliantly! Akshaye Khanna gets his hands on his best role ever, and does full justice to it. Ranveer..has an enviable filmography, and this just adds to it. He&#39;s very good! But his shades will come out in part 2. The music is as strong as character as the actors. Very different n impactful use of tracks! The dialogues, the editing, the fight sequences, the make up...basically each of the tech department has given its best. Loved it. Stayed glued throughout! The movie stays with you, long after you&#39;ve left the theatre!"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010517/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011390",
              "author": {
                "username": {
                  "text": "kanavmittal-33646"
                },
                "userId": "ur154209224"
              },
              "summary": {
                "originalText": "Amazing movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watched it on 2nd day of release absolutely amazing movie must watch. From soundtracks to cinematography everything is amazing including the performance of actors especially Akshay Khanna 🛐 absolute goat his role as Rehman Dakait was so perfect like he was born for it. Definitely watching the the 2nd part cinema also."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011390/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020447",
              "author": {
                "username": {
                  "text": "nagareaishwarya"
                },
                "userId": "ur134450842"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It may have come late to the screen, but the truth remains the truth. We can&#39;t stop some things from happening, but we can progress. Never forget 26/11. Hats off to our brave soldiers and their family members.<br/><br/>A must-watch-powerful story, superb action, and impressive direction. Truly impactful. 👍👍👍👍👍"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020447/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}