{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6lbbitazcwzy476vhhnrqrxumqcjy3akdz7plb3ep4tttfjrkydc3oezfrmblb4du6ja2cketrq3ltprvlmc6tn7q4",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11006866",
              "author": {
                "username": {
                  "text": "tckhvapp"
                },
                "userId": "ur177078474"
              },
              "summary": {
                "originalText": "The Ultimate Collision of Hearts and Heroics"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s strength lies in its ability to balance intense action with emotional resonance. Ranveer Singh anchors the story with a compelling performance that conveys both inner conflict and unflinching resolve. Supporting actors bring authenticity to their roles, each character thoughtfully developed and integral to the plot. Director Dhar&#39;s vision shines through in sequences that merge kinetic energy with narrative clarity, ensuring that each moment serves the story. The cinematography captures both sweeping cityscapes and intimate character beats, while the soundscape amplifies tension and excitement. Action sequences are choreographed with precision, and the pacing allows for suspense to build organically. With a layered script and meticulous execution, the film delivers a cinematic experience that lingers long after the credits roll."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006866/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027321",
              "author": {
                "username": {
                  "text": "priyanshu281994"
                },
                "userId": "ur50652432"
              },
              "summary": {
                "originalText": "All kinds of good"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best well made spy thriller in India till date. No extra drama, no one hero does it all, everyone gets to play their roles to perfection. Nothing like these useless war, ek tha tiger etc. Like spy verse. Amazing cinematography, great acting, brilliant action. It had everything. Ranveer Singh is a standout as usual. Baba is, well baba!! Akshay Khanna is just wow! Watch it in theatres I would say for an amazing experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027321/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023903",
              "author": {
                "username": {
                  "text": "aadeshmahajan"
                },
                "userId": "ur107986444"
              },
              "summary": {
                "originalText": "Movie taste - Decoit Bravery Patriotism Mission Heroism Sacrifice Courage , and conflict"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie cast, team, backend operations, directors, writers, singers all team of Movie is itself dhurandhara.<br/><br/>A 2025 Hindi action-drama by Aditya Dhar, inspired by true events, featuring espionage, betrayal, and patriotism.<br/><br/>And last but not least, Akshaye Khanna&#39;s performance, in particular, has been lauded by critics as one of his sharpest and most emotionally calibrated to date, a &quot;career-defining&quot; role."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023903/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012241",
              "author": {
                "username": {
                  "text": "tshashankkini"
                },
                "userId": "ur169458935"
              },
              "summary": {
                "originalText": "Absolute Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is the espionage cinema we deserve: bold, intelligent, and full of heart. Dhurandhar gives you a thrilling ride through a series of secrets and sacrifices. The story grips you from the very first frame itself and never lets go. Great story, layered with political tension and emotional depth, it stands as one of the finest spy thrillers in recent years. Epic music elevates every twist, adding power and intensity to each reveal. The background score keeps your pulse racing while the cinematography paints every chase and confrontation beautifully. The acting is nothing short of fantastic. Every performer brings authenticity and fire to their roles, with moments that live long after the credits roll. Keep your thoughts on Ranveer aside, watch him here purely as the character, and you&#39;ll see one of his most nuanced performances to date. His transformation, both physical and emotional, anchors the entire film. The climax sets up even greater stakes, leaving audiences eagerly waiting for Part 2. This isn&#39;t just another spy movie; it is a complete cinematic experience which deserves to be celebrated upon the big screen. Dhurandhar is definitely a must-watch in theaters for anyone who loves smart storytelling, powerful music, and performances commanding attention."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012241/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033263",
              "author": {
                "username": {
                  "text": "pritammishra-82133"
                },
                "userId": "ur118945205"
              },
              "summary": {
                "originalText": "Believable spy thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best spy thriller (movie wise) in recent times. Its not extrapolated with bikini dances and slow mo unbelievable action stunts. Grounded fight sequences. You might not like if u glaze over the top movies which makes doesn&#39;t make sense. Like pushpa surviving in container for 2 months by suppressingg his BOWEL movement."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033263/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006593",
              "author": {
                "username": {
                  "text": "imdbfan-8448147166"
                },
                "userId": "ur198243803"
              },
              "summary": {
                "originalText": "A Story Told in Fire & Feelings"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film is a perfect example of how strong direction and stellar performances can elevate a story. The lead&#39;s performance in Dhurandhar is magnetic, filled with quiet intensity and bursts of controlled anger, making his character both relatable and formidable. The supporting cast excels in creating memorable moments, with each actor given space to shine. The director orchestrates the narrative with precision, ensuring that complex political themes and underworld conflicts are accessible without losing depth. The cinematography captures both chaos and intimacy, creating a visual language that complements the narrative. The screenplay is carefully structured, blending suspense, drama, and occasional levity, keeping the audience engaged throughout. Action scenes are meticulously planned and executed, while dialogue and subtle character beats make the story emotionally resonant. Dhurandhar is a cinematic achievement that blends intense performances, visionary direction, and compelling storytelling into a seamless, unforgettable experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006593/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018520",
              "author": {
                "username": {
                  "text": "ChaitanyaR-467"
                },
                "userId": "ur211628102"
              },
              "summary": {
                "originalText": "The best spy movie there is"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie shows spy as a spy and not as a super man who does impossible things has 6 packs and etc\nThe movie talks about real things like Kandahar Aeroplane Hijack, 2001 Parliament attacks, and shows 26/11 from Terrorist POV, the best scenes for me is the aura farming of Akshaye Khanna and the red screen makes you uncomfortable but is necessary to be seen and also the R. Madhavan&#39;s character is given less screen time but every time he comes to screen, it is a lesson for India to how to be really, I felt that the movie was short even though it&#39;s length is nearly 3½ hours."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018520/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007587",
              "author": {
                "username": {
                  "text": "rameshhvermaa"
                },
                "userId": "ur154427237"
              },
              "summary": {
                "originalText": "Thrills, Stars, and Big Screen Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tension and atmosphere dominate the film, slowly escalating until the narrative reaches a climactic crescendo that is both shocking and inevitable. Ranveer Singh anchors the story with a powerful and restrained performance, while the supporting cast brings depth and credibility to the underworld and political intrigue. Action scenes are meticulously choreographed and feel grounded, never gratuitous. Director Dhar&#39;s storytelling is precise, balancing character development, plot intricacies, and emotional resonance. Cinematography and score work in tandem to amplify every moment, making the film a thrilling, thought-provoking, and immersive experience."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007587/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018985",
              "author": {
                "username": {
                  "text": "MayookhM"
                },
                "userId": "ur211631257"
              },
              "summary": {
                "originalText": "MUST WATCH"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If u love your country and want to know what it takes to keep its head always up . Watch it , no compromise.it gives us the view in whicg our agents whose name would also never be made public work in the shadows to protect and keep us safe. This movies is a must watch movie because it gives us this sense of responsibility."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018985/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009996",
              "author": {
                "username": {
                  "text": "Abhinav_Sumeet_Kombra"
                },
                "userId": "ur121923036"
              },
              "summary": {
                "originalText": "Aditya Dhar has done it again with a stellar star cast!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "<ul><li>Dhurandhar directed by Aditya Dhar starring an ensemble cast ft, Ranveer Singh, Akshaye Khanna, Sanjay Dutt, Arjun Rampal and Madhavan is a great spy thriller that is engaging throughout despite the 3hr plus runtime. Never felt bored or lag while watching the film personally.</li></ul><br/><br/><ul><li>What I loved the most about the film is the way it is made, the technical aspects are top notch, the music and scores by Shashwat Sachdev, great cinematography, excellent camera work and great action scenes. Also loved the integration of retro music in the film, it was such a vibe.</li></ul><br/><br/><ul><li>Another main highlight of the film is it&#39;s casting, almost everyone is perfectly casted, such an excellent ensemble cast. Ranveer Singh and Akshaye Khanna stole the show with their screen presence and performances.</li></ul><br/><br/><ul><li>This felt fresh especially during a time when Bollywood constantly puts out mediocre spy films. Aditya Dhar has done it again and he has done a fabulous job. Great theatrical watch. Waiting for Part 2. It is an extremely violent one too, may unsettle some but I felt it enhanced the action scenes and brought shock value to those scenes.</li></ul>"
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009996/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006763",
              "author": {
                "username": {
                  "text": "imdbfan-4329883445"
                },
                "userId": "ur198702546"
              },
              "summary": {
                "originalText": "Superstar Performances in Action Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening sequence, the film establishes a palpable sense of danger and intrigue. Ranveer Singh&#39;s performance is both intense and nuanced, portraying the inner conflict of a man torn between duty and morality while executing high-stakes action sequences with precision. Sanjay Dutt&#39;s commanding presence adds gravitas, and every line he delivers carries weight and threat. Akshaye Khanna and R Madhavan provide understated yet essential support, portraying characters whose intelligence and subtlety influence every pivotal moment. Arjun Rampal&#39;s quiet menace serves as a constant tension point, while Sara Arjun&#39;s performances bring emotional stakes and humanity to the narrative. Aditya Dhar&#39;s direction expertly balances strategic plotting, suspenseful build-up, and large-scale action sequences. Cinematography captures both the sprawling cityscapes and intimate character moments, while the score punctuates every twist with intensity. By the second half, the tension crescendos into a gripping, high-octane finale, combining emotional weight with cinematic spectacle."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006763/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011335",
              "author": {
                "username": {
                  "text": "ektaj-089"
                },
                "userId": "ur211573750"
              },
              "summary": {
                "originalText": "A remarkable film and an absolute masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a remarkable film and an absolute must-watch. It showcases a level of depth and intensity that reflects Aditya Dhar&#39;s powerful storytelling.<br/><br/>Only someone like Aditya Dhar who comes from the Kashmiri Pandit community that has witnessed horrific violence could bring such stark reality to Dhurandhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011335/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007230",
              "author": {
                "username": {
                  "text": "ravatarjun"
                },
                "userId": "ur118094105"
              },
              "summary": {
                "originalText": "Thrills, Drama, and Unforgettable Stars"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story slowly tightens its grip on the audience, revealing a labyrinth of political intrigue, betrayal, and underworld strategy. Ranveer Singh&#39;s performance is layered and immersive, balancing physical intensity with emotional nuance, making his journey relatable yet extraordinary. Sanjay Dutt&#39;s commanding presence provides a strong anchor to the narrative, while Akshaye Khanna and R Madhavan offer intelligent, understated performances that enrich the story&#39;s depth. Arjun Rampal&#39;s quiet menace keeps suspense high, and Sara Arjun&#39;s emotional moments provide heart and humanity. Director Aditya Dhar seamlessly integrates action, strategy, and psychological tension, orchestrating breathtaking sequences that feel both realistic and cinematic. Cinematography captures sweeping city landscapes, intimate interior moments, and high-stakes action with equal mastery. The music elevates suspense, accentuating the tension in both quiet and explosive scenes. The final sequences deliver a masterful blend of action, emotional resonance, and narrative closure, leaving a lingering impact."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007230/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11098078",
              "author": {
                "username": {
                  "text": "surbhi-80"
                },
                "userId": "ur212206327"
              },
              "summary": {
                "originalText": "Evoking past emotions of terror attacks"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watching Dhurandhar was far more than a three-hour ride on a popular filmi rollercoaster where Akshaye Khanna&#39;s dancing or violence takes the spotlight. It was an emotional, heartfelt journey through three decades of terror incidents that anyone born in India in the 1980s has grown up witnessing. I was fortunate to have never been directly in harm&#39;s way-or, when I was, to have escaped unscathed-but the shadow of those attacks left deep, invisible scars, a constant undercurrent of fear that you never know when tragedy might strike.<br/><br/>The opening scene transported me straight back to the 1990s, to the Air India flight hijacking that ended at Kandahar. The hijackers demanded the release of terrorists, and the nation watched helplessly as Home Minister Jaswant Singh escorted them to comply. The tragedy of Ripin Katyal, a husband returning from his honeymoon, slashed and left to die in front of his wife, flashed vividly in my mind. Those moments, seen through the lens of news channels, left an entire nation frustrated, powerless, and questioning its ability to confront the unimaginable.<br/><br/>The IC 814 hijacking instilled in me a lifelong fear of flying. I later read the account by Captain Devi Sharan, whose description of what unfolds during a hijack cemented my unease. Since then, airports feel less like gateways to adventure and more like spaces where vigilance outweighs excitement; more than my passport, I scan my surroundings; more than the thrill of takeoff, I feel the anxious pull of &quot;what if?&quot;<br/><br/>The attack on the Indian Parliament was another stark reminder that safety is never guaranteed. While Dhurandhar doesn&#39;t attempt to depict every bomb blast that Delhi or Mumbai endured, it evokes the terror of those days. I recall leaving Sarojini Nagar market when a blast ripped through the crowded streets at peak hour. My mother&#39;s voice, trembling with fear upon seeing the news, still echoes in my memory. Simultaneously, a blast struck Karol Bagh, where my father usually spent his evenings. Phones went unanswered; my brother dashed through streets on his scooter. By sheer luck, my father returned home unharmed.<br/><br/>The film moves on to the Mumbai attacks of 26/11, recreating two harrowing days of terror broadcast live on Indian television. Pools of blood at Chhatrapati Shivaji Terminus, bullets tearing through innocent lives, explosions in the Taj Mahal Palace Hotel-the horror played out in real-time, with media coverage sometimes inadvertently guiding the terrorists. Watching these scenes unfold on screen is chilling, not as fiction, but as a haunting echo of lived reality.<br/><br/>Perhaps Dhurandhar resonates so deeply not only because of its powerful performances but because it strikes a nerve with those of us who have lived through these moments. It reminds us of fear, loss, and the desperate hope that terror might one day be over. For many, it is more than a film; it is a mirror reflecting decades of collective trauma and the resilience to carry on with life."
                }
              },
              "authorRating": 9,
              "submissionDate": "2026-01-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11098078/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013130",
              "author": {
                "username": {
                  "text": "anuragrastogi-33342"
                },
                "userId": "ur168085453"
              },
              "summary": {
                "originalText": "Banger - Eveyone should watch..🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Everyone should watch this, no sugar coating, no fakeness..Every cinema craver need this. Everyone done great job!! Specially Ranveer, and akshaye ufff!!! These two are damn good. Ranveer character is quiet stealth character, so everyone not gonna love it but his Performance is top notch. A best spy film i ever watched.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013130/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017509",
              "author": {
                "username": {
                  "text": "nikitadas-89312"
                },
                "userId": "ur127493740"
              },
              "summary": {
                "originalText": "Amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar was an absolute delight to watch. The story is tight, the performances are strong, and not a single moment feels dull. Surprised me in the best way possible. Genuinely loved it.....everyyyyy bit of it! Well-made, and engaging from start to finish.<br/><br/>Haven&#39;t watched it yet??? Goooo noww!!!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017509/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009620",
              "author": {
                "username": {
                  "text": "akshayrainakp"
                },
                "userId": "ur150801656"
              },
              "summary": {
                "originalText": "Bold, Blunt and full of facts"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Probably one of the few ones, Aditya Dhar who has thd balls to show the truth RAW, and on its face.<br/><br/>Thanks for the movie.<br/><br/>Now waiting for 16th march 2026 for the se ond part and i have no doubt in my mind that aditya has absolutely cooked all the idiots who are trying to threaten him.<br/><br/>He has cooked an of them."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009620/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006605",
              "author": {
                "username": {
                  "text": "imdbfan-9395063320"
                },
                "userId": "ur198243889"
              },
              "summary": {
                "originalText": "Big Scenes, Bigger Emotions"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From a directorial perspective, Dhurandhar is masterful. The director balances multiple narratives-personal, political, and criminal-without ever feeling chaotic or confusing. The lead actor anchors the film with an intense yet nuanced performance, while the supporting cast brings richness and authenticity to the story. Every action sequence, dialogue, and quiet moment is carefully crafted, reflecting a deep understanding of pacing and audience engagement. The film&#39;s use of geopolitical references and real-world events gives the story additional layers of tension and intrigue. Cinematography, sound design, and music all complement the performances, creating an immersive experience. The screenplay allows the characters to breathe, and the emotional stakes are as high as the physical ones. Dhurandhar is a cinematic event that combines acting brilliance, directorial vision, and storytelling sophistication."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006605/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008796",
              "author": {
                "username": {
                  "text": "amishra-27827"
                },
                "userId": "ur121707016"
              },
              "summary": {
                "originalText": "The best Indian ever film in the spy genre."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Saw #Dhurandhar today. Exceptional is the word. Easily the best Indian ever film in this genre.<br/><br/>The tight edits, parallel high octane events and the music .... All top class.<br/><br/>The attention to detail; the story line that depicts the long arc of real world espionage and what it takes to achieve it..... the craft is evident in the fact that even at end of 3:30 hrs, yeh audience was wanting more.<br/><br/>Great work\n@AdityaDharFilms\nand team."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008796/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023949",
              "author": {
                "username": {
                  "text": "ManishK-519"
                },
                "userId": "ur211669704"
              },
              "summary": {
                "originalText": "Has repeat watch value..."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The overall music is a treat for the audience. Has different taste for different situations in the movie.<br/><br/>Some action scenes have fantastic scores which will blow your mind. This is what cinema should be.<br/><br/>Superb story, Good casting of experienced actors &amp; not stars.<br/><br/>No bakwaas, only class...<br/><br/>A well executed film.. Kudos to the whole team of Dhurandhar..Keep it up."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023949/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007127",
              "author": {
                "username": {
                  "text": "DileepM-97"
                },
                "userId": "ur203910847"
              },
              "summary": {
                "originalText": "High stakes, heavy hearts, and unstoppable energy"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The energy in Dhurandhar is unmatched. Ranveer Singh shines in every scene, showing both intensity and vulnerability. Sanjay Dutt gives the film weight and charm, while Akshaye Khanna, R Madhavan, and Arjun Rampal elevate the story with strong performances. Sara Arjun&#39;s scenes are touching and memorable. Aditya Dhar&#39;s direction keeps the story moving at a great pace, making complicated politics and action easy to understand. The movie mixes emotions, thrilling action, and clever humor seamlessly, making it a movie you can&#39;t miss."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007127/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011900",
              "author": {
                "username": {
                  "text": "mihir-50799"
                },
                "userId": "ur150861302"
              },
              "summary": {
                "originalText": "THE BEST espionage thriller to come out of India"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Amazing movie artistically. For people who don&#39;t know much about the real life incidents covered in the movie, it is still an objectively well made film.<br/><br/>For those who have been witness to some of these gruesome events, it speaks to you and shakes you for a bit. Perfect casting, set design, use of sound.<br/><br/>Ranveer Singh is an amazing vehicle to help us feel what an Indian would feel in that situation. He&#39;s done a beautiful job in the restraint that his role demanded.<br/><br/>Akshaye Khanna has OWNED the screen and almost the movie itself. A haunting, evil, yet charismatic gangster with character depth.<br/><br/>Shows us the real faces of instances of terrorism in India, and doesn&#39;t shy away from it at all."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011900/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007277",
              "author": {
                "username": {
                  "text": "rajvijay-12024"
                },
                "userId": "ur123096731"
              },
              "summary": {
                "originalText": "A Blockbuster Ride with Big Stars"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every sequence in the film is carefully constructed to maximize suspense, emotional weight, and cinematic spectacle. Ranveer Singh delivers a nuanced performance, conveying inner conflict, intelligence, and physical courage. Sanjay Dutt commands the screen with gravitas and menace, while Akshaye Khanna and R Madhavan provide subtle, intelligent support. Arjun Rampal&#39;s understated menace maintains tension, and Sara Arjun&#39;s emotional authenticity adds a human dimension to the story. Director Aditya Dhar orchestrates suspenseful plotting, explosive action, and narrative twists with precision. Cinematography captures both sprawling urban chaos and intimate character beats, while the score punctuates tension and emotion. By the finale, the film delivers both adrenaline and cathartic emotional resolution."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007277/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007077",
              "author": {
                "username": {
                  "text": "ivyrai"
                },
                "userId": "ur123189692"
              },
              "summary": {
                "originalText": "Action, Emotion, and Superstar Magic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s pacing, suspense, and visual storytelling are exceptional. Ranveer Singh dominates the narrative with layered performances, portraying both vulnerability and strategic acumen. Sanjay Dutt commands attention with gravitas, while Akshaye Khanna and R Madhavan provide subtle, impactful support. Arjun Rampal&#39;s quiet menace maintains tension, and Sara Arjun&#39;s emotional authenticity amplifies stakes. Aditya Dhar&#39;s direction balances intricate plotting with explosive action sequences. Cinematography captures sprawling environments and intimate details, while the score heightens both suspense and emotion. The finale combines thrilling action with deep narrative payoff."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007077/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013561",
              "author": {
                "username": {
                  "text": "ArpitG-64"
                },
                "userId": "ur211591308"
              },
              "summary": {
                "originalText": "Hitting where it hurts best!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Reality cannot be disguised for long, sometimes movies like these uncover reality which helps setting our minds to realism rather on movie masala. This Indian movies is fully cooked with all realistic ingredients which gives it a real flavour about our strength and courage. I personally liked this content and would like to see such kind of content on realism in future. No more dilemma of masala in spy movies, we love to see actual content. Music was nice, screenplay was amazing, brutality looked real."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013561/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}