{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4v6fbjsqyxdo6id7kwh3nzqrxs4wbjt3ykdb67idpj3qflanes2ycctoayu7wzf2kpfb3qxd3adak37cp3p4reg",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11007838",
              "author": {
                "username": {
                  "text": "arindam-97289"
                },
                "userId": "ur102890923"
              },
              "summary": {
                "originalText": "Finally, a Spy Film That Feels Real - Dhundhkar Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhundhkar is raw, unapologetic, and right in your face-but that&#39;s exactly why it works. The film is incredibly engaging from start to finish, and the political backdrop feels strikingly real because it&#39;s rooted in actual events. This is a real spy movie-gritty, grounded, and atmospheric-not the glossy &quot;spy universe&quot; style we&#39;re used to seeing from YRF.<br/><br/>The performances are exceptional across the board. Sanjay Dutt still delivers his usual style of acting, but the director uses him so smartly that he fits perfectly into the film&#39;s tone. Akshaye Khanna and Ranveer are absolute standouts; both bring intensity and nuance that elevate the entire narrative. By the end, I was genuinely excited for the next installment. Overall, this is a solid 8/10.<br/><br/>As for the propaganda angle-yes, the film definitely leans into certain political messaging. It openly criticizes previous governments and positions the 2014 (present-day) administration as the turning point in India&#39;s fight against terrorism. But surprisingly, this doesn&#39;t hurt the story. If anything, it heightens the stakes and makes the film more entertaining and impactful.<br/><br/>Dhundhkar is bold, gripping, and absolutely worth a watch."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007838/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004563",
              "author": {
                "username": {
                  "text": "Feel-the-truth"
                },
                "userId": "ur9364327"
              },
              "summary": {
                "originalText": "Dhurander.... Explains everything!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurander, the expert, as the name suggests is a pretty extraordinary movie. It&#39;s not just a very good spy thriller, but it shows the way a true spy works. Gathering intelligence from here and there.<br/><br/>Best part of this movie, is that it&#39;s entire story is about Pakistan, you forget that this is a Bollywood movie, you realise its the same shit on both sides of the border, there is a dialogue in the movie that Indias biggest enemy is India, so true.<br/><br/>Acting wise, Akshay was standout, and every actor played their role to the letter, let&#39;s not forget Dhurander himself, Ranveer played his role to the letter, he isn&#39;t meant to be the front man, he is the man in shadows, listening, watching... He is brilliant.<br/><br/>Great movie, who cares about the running time."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004563/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025137",
              "author": {
                "username": {
                  "text": "yashhraaj"
                },
                "userId": "ur31793060"
              },
              "summary": {
                "originalText": "A Relentless Spy Thriller That Holds Its Nerve Till the End"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar arrives as a fully loaded, large-scale spy action thriller that knows exactly what it wants to be and commits to it with confidence. Written, directed, and co-produced by Aditya Dhar, the film unfolds as a dark underworld saga where criminals, informants, and covert operatives move through a world defined by secrecy, shifting loyalties, and high-stakes betrayals.<br/><br/>From its very first scene, the film is magnetically gripping. There is no indulgent buildup or unnecessary hand-holding. Instead, the narrative pulls the viewer straight into its tense atmosphere and maintains that grip across its ambitious 3-hour-and-32-minute runtime. Remarkably, despite the length, the film never feels bloated. Each chapter is sharply executed, flowing into the next with seamless transitions that keep the momentum intact.<br/><br/>The ensemble cast is one of the film&#39;s strongest assets. Ranveer Singh delivers a controlled and commanding performance, anchoring the film with intensity and presence. Akshaye Khanna, R. Madhavan, Arjun Rampal, and Sanjay Dutt bring depth and gravitas to their roles, each adding distinct layers to the interconnected world of espionage and crime. The supporting cast is equally effective, ensuring that even smaller roles feel purposeful and well-etched rather than ornamental.<br/><br/>A special mention must be made for the background score, which stands out as truly exceptional. It heightens tension without overpowering scenes and plays a crucial role in sustaining the film&#39;s brooding, high-stakes tone. The technical departments work in impressive harmony. The cinematography captures both scale and intimacy with finesse, while the editing ensures smooth scene-to-scene transitions that enhance narrative clarity rather than disrupt it.<br/><br/>Aditya Dhar&#39;s direction reflects confidence and maturity. The storytelling, dialogues, and screenplay are tightly aligned, allowing the film to balance action, intrigue, and emotional undercurrents without losing focus. The world of Dhurandhar feels dense, lived-in, and convincingly dangerous.<br/><br/>Overall, Dhurandhar is an excellent example of contemporary Hindi cinema aiming high and delivering with precision. It is stylish, intense, and consistently engaging, making it a standout entry in the spy action thriller genre.<br/><br/>Rating: 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025137/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006919",
              "author": {
                "username": {
                  "text": "karthiksonowal"
                },
                "userId": "ur151424378"
              },
              "summary": {
                "originalText": "Action That Makes You Jump"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses viewers in a morally complex, high-stakes underworld. Ranveer Singh delivers an intense, multi-dimensional performance, while Sanjay Dutt commands the screen with authority and menace. Akshaye Khanna and R Madhavan provide subtle, intelligent performances, and Arjun Rampal&#39;s quiet menace keeps suspense taut. Sara Arjun adds heartfelt emotional depth, grounding the story in human stakes. Aditya Dhar directs with precision, blending cerebral plotting, high-stakes action, and emotional storytelling. Cinematography captures both sprawling urban chaos and intimate moments, and the score heightens tension. By the finale, the film delivers thrilling action, narrative resolution, and emotional payoff."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006919/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003873",
              "author": {
                "username": {
                  "text": "darshit-99526"
                },
                "userId": "ur94468080"
              },
              "summary": {
                "originalText": "10/10 Banger"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A 10/10 film. From the dialogues, to cast, and the cinematography, everything was perfect. Loved how different events were connected very carefully and depicted. Akshaye Khanna has yet again proven that he is such a versatile actor. Each and every actor is so engraved in their character that it feels like you are a part of the movie.<br/><br/>Definitely a must watch!<br/><br/>FYI - 3.5 Hr run time and action heavy."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003873/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007451",
              "author": {
                "username": {
                  "text": "shubhamsinha-62568"
                },
                "userId": "ur92886340"
              },
              "summary": {
                "originalText": "Entertaining Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I want more content. The duration of film is on spot. Songs and BGM use in movie is good. Good mix of reality and fiction. Action is very engaging. Colors in movie are quite beautiful. Waiting for Part 2. Akshay Khanna has done extremely good job. Also Arjun Rampal has become completely engrossed in his character. Overall must watch."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007451/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006500",
              "author": {
                "username": {
                  "text": "itsmeatharv"
                },
                "userId": "ur188347004"
              },
              "summary": {
                "originalText": "A Multi-Star Spectacle of Thrills and Tears"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every chapter of this film unspools with tension, intrigue, and cinematic flair. The lead actor delivers a mesmerizing performance, effortlessly oscillating between moral conflict and decisive action. Fight sequences and action choreography are not only visually spectacular but narratively consequential. Supporting roles are rich and fully realized, each adding depth to the story. Cinematography frames both action and introspection with finesse. The score accentuates suspense and emotional beats seamlessly. Political and criminal dynamics give authenticity to the narrative. By the finale, the interwoven threads of tension, emotion, and spectacle converge in a deeply satisfying cinematic experience."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006500/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003119",
              "author": {
                "username": {
                  "text": "amazonprime-60986"
                },
                "userId": "ur120663514"
              },
              "summary": {
                "originalText": "Film with guts"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar 🙏 actor actionfacts all top notch movie with guts, RS is great as well and so are all the actors. Defiant way to show what goes on in Pak and India&#39;s valor and guts and must watch for the daring theme and execution\nMusic is apt not for the faint hearted with lot of blood and gore. Go qnd encourage film makers like aditya."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003119/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007962",
              "author": {
                "username": {
                  "text": "subhash-33123"
                },
                "userId": "ur101838964"
              },
              "summary": {
                "originalText": "Can't Get Over Dhurandhar - What a Movie!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just finished watching Dhurandhar, and I&#39;m honestly still processing how gripping and relentlessly engaging the entire experience was. From the opening scene, the film grabs you by the collar and refuses to let go. The background score deserves a special standing ovation-it&#39;s not just &quot;good,&quot; it&#39;s electrifying. The BGM pulses through every high-tension moment, amplifies every emotional beat, and keeps you hooked scene after scene.<br/><br/>What surprised me the most is how effortlessly the film sustains its momentum over a massive 3 hours and 30 minutes. In an age where even two-hour movies feel stretched, Dhurandhar turns its long runtime into a strength. Not once does your attention wander. There isn&#39;t a single dull frame, and the pacing is so sharp that you barely register how much time has passed.<br/><br/>Another bold move by the filmmakers is the unapologetically graphic violence-something you rarely see executed with such rawness and intensity in Hindi cinema. The action sequences have weight, brutality, and a kind of grim authenticity that lingers long after the scene cuts. It&#39;s not violence for shock value; it&#39;s woven into the very fabric of the story, heightening both the stakes and the emotional payoff.<br/><br/>And the audience reaction? That, in itself, was an experience. Even after the final scene ended, people simply refused to leave. Everyone just sat there, stunned, excited, whispering theories, soaking in the impact of what they had just witnessed. You could feel the anticipation in the air.<br/><br/>Now the countdown begins-for March 19, 2026, when the second installment drops. If the title &quot;REVENGE&quot; is anything to go by, we&#39;re in for something even more explosive. Bring it on."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007962/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003379",
              "author": {
                "username": {
                  "text": "ajaydtt-83498"
                },
                "userId": "ur97245623"
              },
              "summary": {
                "originalText": "Awesome Spy Thriller! A Must Watch!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I was simply blown away by this movie. Everything from the direction, story, set designs, action, background music, cinematography and acting is brilliant. This is not your run of the mill brainless action movie. This is an extremely clever action spy thriller with a solid story which has clearly been very well researched. Take a bow Aditya Dhar for daring to try something new. The way you combined the real life incidents in the movie was really interesting. The action is gritty and raw and the performances are brilliant. It also has a few twists and turns. The whole star cast performed really well including the supporting actors. But for me personally Akshay Khanna and Ranveer Singh were the two standout performances. Yes the film is long but it&#39;s never boring and it&#39;s worth waiting for the climax. I could write a lot more but then I would give away spoilers which would ruin it for others. Don&#39;t listen to or read the negative reviews. BELIEVE THE HYPE AND WATCH IT ON THE BIG SCREEN. YOU WILL NOT BE DISAPPOINTED."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003379/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11089494",
              "author": {
                "username": {
                  "text": "arshsalmani-31531"
                },
                "userId": "ur173886817"
              },
              "summary": {
                "originalText": "18 plus"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Why dhurandre is 18 plus because that was not have any sexual scenes why it is. Please do not give 18 plus to dhurandre 2 please. I want to see dhurandre 2 in theatre and why is it 18 plus every kids was watching in home also I am 13 and I watched it but that&#39;s not right please I want to watch it in theatre. I want the theatre review please 🙏."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-02",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11089494/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11042355",
              "author": {
                "username": {
                  "text": "rupyaaco"
                },
                "userId": "ur117087315"
              },
              "summary": {
                "originalText": "Dhurandhar: Bold, Unapologetic, and Technically Impressive"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping watch that stands out for its fearless storytelling. The film unapologetically exposes Pakistan&#39;s role in exporting terrorism without resorting to diplomatic dilution, giving the narrative a strong and confident edge. The background score is impactful and heightens the intensity of key scenes, while the music complements the overall mood effectively. Backed by excellent production quality, sharp visuals, and a polished cinematic scale, Dhurandhar delivers both substance and style. A bold film and unquestionably a must-watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11042355/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007273",
              "author": {
                "username": {
                  "text": "patelsumit-29418"
                },
                "userId": "ur123097036"
              },
              "summary": {
                "originalText": "Star-Studded Spectacle for Everyone"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses audiences into a meticulously constructed world of danger, loyalty, and moral ambiguity. Ranveer Singh delivers a layered, emotionally charged performance, while Sanjay Dutt exudes authority, menace, and charisma. Akshaye Khanna and R Madhavan enrich the ensemble with subtle, intelligent performances, and Arjun Rampal&#39;s quiet menace sustains tension throughout. Sara Arjun&#39;s emotional presence grounds the narrative in humanity. Aditya Dhar&#39;s direction choreographs suspense, strategic plot developments, and thrilling action sequences flawlessly. Cinematography captures urban chaos, intimate interactions, and high-stakes confrontations with precision. The score heightens tension and emotion, creating an immersive cinematic experience that culminates in a thrilling, emotionally resonant climax."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007273/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006530",
              "author": {
                "username": {
                  "text": "naziyashiakh"
                },
                "userId": "ur192027194"
              },
              "summary": {
                "originalText": "A Powerful Ride Designed for Big Screens"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening scene, tension is palpable as the narrative plunges into the dangerous crossroads of crime and politics. Performances are layered, with the lead portraying moral ambiguity with precision. The action is visceral, intense, and impactful, never feeling gratuitous. Cinematic framing captures both chaos and introspection, allowing the audience to feel the stakes intimately. Editing and pacing ensure that every twist lands with maximum effect, while the score subtly enhances suspense. The supporting cast adds texture, making the story world feel lived-in and authentic. By the second half, the film escalates into an edge-of-the-seat spectacle, merging personal stakes with larger societal consequences. This film is an immersive, intelligent, and thrilling cinematic experience."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006530/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010515",
              "author": {
                "username": {
                  "text": "Priya-127"
                },
                "userId": "ur211568519"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar sets a new benchmark for Indian spy movies.....\nThe performances are phenomenal, every actor fits perfectly into their role. The background score and songs elevate every scene, especially the high-voltage action moments. The story keeps you hooked from start to finish. Truly a must-watch!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010515/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007069",
              "author": {
                "username": {
                  "text": "YashR-44"
                },
                "userId": "ur203859611"
              },
              "summary": {
                "originalText": "Deep Emotions Paired with Pulse-Pounding Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is meticulous, ensuring every action, dialogue, and character moment matters. Ranveer Singh portrays internal conflict and bold decision-making with brilliance, while Sanjay Dutt&#39;s commanding performance elevates tension. Akshaye Khanna and R Madhavan provide strong, layered support, and Arjun Rampal&#39;s understated menace lingers. Sara Arjun adds heart to the narrative, emphasizing stakes. Aditya Dhar&#39;s direction merges suspense, political tension, and action seamlessly. Cinematography captures both chaos and intimacy, and the score heightens tension and emotion. The second half delivers thrilling action and emotional resonance, culminating in a memorable finale."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007069/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018666",
              "author": {
                "username": {
                  "text": "rahul-36510"
                },
                "userId": "ur133639711"
              },
              "summary": {
                "originalText": "One of the BEST movie."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie say something you don&#39;t know. But how we can save our country from inner villain? This is very important issue today&#39;s India. Every actor acting so nice. Akshay Khanna is best performance in this movie. We can&#39;t wait for 2nd part. I know it&#39;s more informative and more logical tropic of 2nd part we can watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018666/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026959",
              "author": {
                "username": {
                  "text": "shuklaabhi-47514"
                },
                "userId": "ur80212309"
              },
              "summary": {
                "originalText": "True Indians please please dedicate 3 hrs"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Hi viewers,<br/><br/>This movie is largely inspired by real events. It highlights how threats can exist all around us and emphasizes the importance of strong, patriotic leadership at the central government level to tackle terrorism and protect national security.<br/><br/>The screenplay is decent-nothing extraordinary-but it could have been sharper in certain areas. Since the film is based on a true story, it&#39;s understandable that not every detail could be revealed. Still, the narrative feels believable, and I trust the intent behind the storytelling.<br/><br/>As for the performances, everyone has done justice to their roles. There are no over-the-top star moments or attempts to overshadow the story-no flashy Akshay, Ranveer, or Sanjay moments. Instead, every actor fits naturally into the film, and that collective effort works well for the kind of story being told.<br/><br/>Overall, it&#39;s a sincere film with a serious theme, driven more by realism than cinematic hype."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026959/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027042",
              "author": {
                "username": {
                  "text": "bsangramsing"
                },
                "userId": "ur151051401"
              },
              "summary": {
                "originalText": "Dhurandhar: A Fearless Spy Thriller Exposing Weak Politics and Celebrating National Strength"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands out as a bold, high-impact spy-action drama that combines powerful performances, gripping action, and strong nationalist emotion, making it highly effective on the big screen.<br/><br/>One of its most talked-about aspects is how the film&#39;s narrative portrays Congress-led governments in a sharply negative light, depicting them as politically weak, compromised, and willing to sacrifice national interest for power, including appeasement of Pakistan, erosion of India&#39;s global reputation, and weakening of the country&#39;s strategic strength-all shown within the film&#39;s storyline. This political angle gives the movie an extra layer of intensity and controversy, which many viewers find courageous and refreshing.<br/><br/>Alongside this, the film excels in performances (especially Akshaye Khanna and Ranveer Singh), realistic action, tense dialogues, strong background score, and large-scale storytelling that keeps the audience emotionally invested. Though the runtime is long and a few sections feel stretched, the film&#39;s conviction, scale, and unapologetic stance outweigh its flaws.<br/><br/>Overall, Dhurandhar is a must-watch for viewers who enjoy intense spy thrillers, strong nationalist themes, and politically charged storytelling that doesn&#39;t hold back."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027042/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010347",
              "author": {
                "username": {
                  "text": "Gajendra_mahar"
                },
                "userId": "ur153758828"
              },
              "summary": {
                "originalText": "🔥 Akshaye Khanna: The Scene-Stealer as Rehman Dakait"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "While Ranveer Singh leads the film, it is Akshaye Khanna who has unanimously emerged as the film&#39;s true MVP and biggest selling point.<br/><br/>As the ruthless Pakistani crime lord, Rehman Dakait, Khanna delivers a performance that critics are calling his career-best.<br/><br/>Menace and Understatement: Khanna&#39;s portrayal is hauntingly understated. He conveys immense menace and danger with subtle expressions-a smile, a glance, or just the stillness of his posture. He&#39;s an intense, family-man gangster who, according to some reviews, nearly overshadows the protagonist with his terrifying screen presence.<br/><br/>The Viral Entry Scene: His introduction scene, featuring the viral track &quot;FA9LA&quot; by Flipperachi, is a cinema moment that has captivated audiences. Khanna&#39;s sheer &#39;aura&#39; and effortless swagger in this sequence are described as magnetic and an absolute &#39;banger.&#39;"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010347/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008804",
              "author": {
                "username": {
                  "text": "dishantshukla-86123"
                },
                "userId": "ur167904658"
              },
              "summary": {
                "originalText": "Blockbuster movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar showed why he is best director since JP Dutta, thanks for burying down the ghost of YRF.<br/><br/>Ensemble Cast alongwith supporting cast did their job superbly and the placement and choice of songs is too good, when Ranveer Singh is going to betray Akshay Khanna and he realises he&#39;s getting betrayed they put the song, &quot;Na de dil Pardesi nu tainu nit da rona pai jauga&quot; is too apt for the situation and for their chemistry."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008804/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016302",
              "author": {
                "username": {
                  "text": "Rupeshk-8124"
                },
                "userId": "ur211608172"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Go and watch if you love to know real cinema actually spy movie i know pak lover don love this movie pr jo real h wo wahi dikhaya h is movie m...every actor work superb in this movie spacially oscar winner actor 😂....3 hrs long pr bore nhi hoge etni intrest band kar rakhthe h is movie me you will enjoy."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016302/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015906",
              "author": {
                "username": {
                  "text": "krishna-99555"
                },
                "userId": "ur178700086"
              },
              "summary": {
                "originalText": "Best movie Bollywood had given"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie stands out as one of the most realistic and engaging action films Bollywood has produced in recent years. From the very beginning, the story pulls you in with its strong emotional foundation, making every scene feel meaningful and connected. What truly makes this film impressive is the balance between action and storytelling. The action sequences are intense without being overdone, and each moment serves a purpose in moving the story forward. Nothing feels forced or unnecessary, which is rare in many commercial action movies.<br/><br/>The performances are another major highlight. Every actor delivers their role with sincerity, giving the film a sense of depth and authenticity. You can feel the emotions, the struggles, and the motivations of the characters. The direction is tight and focused, keeping the pace steady while still allowing room for the story to breathe. The cinematography adds to the realism, capturing both quiet moments and high-energy scenes with equal skill.<br/><br/>Overall, this movie is not just an action entertainer but a complete cinematic experience. It offers a powerful storyline, believable characters, and thoughtful execution. In my opinion, it is one of the finest and most realistically crafted action films Bollywood has ever given."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015906/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018576",
              "author": {
                "username": {
                  "text": "AkashR-816"
                },
                "userId": "ur211629023"
              },
              "summary": {
                "originalText": "Bollywood's Finest Spy Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is the type of movies India needs. It not only raises the bar high for others but also educated the audience about India and its interests considering its hostile neighbours.<br/><br/>Also in this movie there is no fantasy stuff that we generally see in this genre or any cringe and forced romance which is a refreshing change."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018576/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015800",
              "author": {
                "username": {
                  "text": "svalecha-77763"
                },
                "userId": "ur132181981"
              },
              "summary": {
                "originalText": "Best Spy movie ever produced by Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched Dhurandhar last night, and it might be the most gripping spy film Bollywood has produced so far The performances by the entire cast are outstanding, and Aditya Dhar&#39;s storytelling keeps the tension high while grounding the plot in real events and intelligence operations Some of the action and torture sequences are quite graphic, which may not be everyone&#39;s cup of tea, but they add to the raw, realistic portrayal of how intelligence agencies and undercover spies actually function. For me, this film feels far more grounded and hard hitting than the overrated YRF Spy Universe movies like Tiger, Pathaan and War 2, which often prioritise style and fantasy action over believable espionage drama."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015800/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}