{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6lcjftazcwzy476uh3ojtrpr46bz53imd36xma7d6mqbdf4skydk3o42frmzyobdrewwsfgvbo3dsacwph5bo32ya",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11029060",
              "author": {
                "username": {
                  "text": "daveshboodhoo-07294"
                },
                "userId": "ur112810019"
              },
              "summary": {
                "originalText": "Bollywood Cinematic Gem!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It was a pure pleasure sitting in a cinema hall and be proud watching a bollywood movie worth the applause. The direction, powerhouse acting, music, pacing, chapter approach, a very well rounded entertainer!<br/><br/>I had a blast and never lost grip even with its runtime! The killing scenes were original and the cinematography refreshing.<br/><br/>Waiting for Part 2."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029060/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017373",
              "author": {
                "username": {
                  "text": "DhruvishB-2"
                },
                "userId": "ur211617297"
              },
              "summary": {
                "originalText": "Outstanding Movies"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar stands out as one of the year&#39;s strongest films. The story is gripping, the characters are beautifully written, and the performances are top-notch. The film strikes a perfect balance between emotion, intensity, and entertainment. The action sequences are powerful, the background score enhances every moment, and the direction keeps the narrative tight and engaging. Dhurandhar doesn&#39;t just entertain it leaves an impact. A highly recommended watch!&quot;"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017373/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016114",
              "author": {
                "username": {
                  "text": "anirudhverma-31739"
                },
                "userId": "ur192951402"
              },
              "summary": {
                "originalText": "Bold take on reality of terrorism"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie shows a hard hitting reality for every Indian about how terrorism operates in. Very organic acting which portrays how espionage actually works. Not another &quot;masala&#39;&quot;movie. Action is very well choreographed and the best part is the use of music. Music elevates every aspect of this movie. Exceptional performance by each and every character, even the ones in side role."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016114/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006501",
              "author": {
                "username": {
                  "text": "mihikaiyer"
                },
                "userId": "ur123184582"
              },
              "summary": {
                "originalText": "A Blockbuster with Big Names"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film constructs a morally complex, high-stakes world, giving each character a distinct arc. Ranveer Singh shines in action and reflective scenes, Sanjay Dutt exudes authority, Akshaye Khanna and R Madhavan elevate narrative intelligence, Arjun Rampal adds menace, and Sara Arjun provides emotional clarity. Aditya Dhar orchestrates suspense, strategy, and action seamlessly. Cinematography captures scale and subtlety, and the score heightens tension. By the climax, the narrative delivers a thrilling, emotionally resonant, and satisfying payoff."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006501/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11083988",
              "author": {
                "username": {
                  "text": "piyushpadwale"
                },
                "userId": "ur86076648"
              },
              "summary": {
                "originalText": "Powerful Performances Drive This Hard-Hitting Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Finally, I got to watch this film after its glorious run, and without getting into any socio-political commentary, let&#39;s just stick to its cinematic qualities, which absolutely make for an entertaining time in the cinema halls.<br/><br/>Intense from the get-go, really well-written dialogues and powerful performances by the starcast, with Akshaye Khanna being a clear standout.<br/><br/>Splitting the entire storyline into chapters, complemented with a great soundtrack and sound design, especially the integration of popular retro songs and giving them a contemporary touch, makes it a very engaging watch and a great directorial move that keeps the screentime balanced and doesn&#39;t feel rushed.<br/><br/>Several of the action scenes prove to be extremely gory, brutal, and violent. You would really have to shut your eyes and look away from the screen.<br/><br/>Sprinkled with a few lighthearted moments that lighten the rather intense story. The romantic subplot slows down the story. Even if it is somewhat integral in taking it forward, I found it to be the weakest link in the narrative.<br/><br/>The story also delves into some gut-wrenchingly painful real-life footage that is bound to break you in ways you can&#39;t imagine, and leaves you in awe of how it was able to be filmed, given its sensitive and traumatic nature.<br/><br/>The climax is exhilaratingly thrilling, which keeps you hooked to your seats until the penultimate scene. It immediately hooks you and eagerly anticipates the next part.<br/><br/>Given the excitement, I shall definitely find myself in the cinema hall at the time of its release."
                }
              },
              "authorRating": 8,
              "submissionDate": "2026-01-01",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11083988/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018699",
              "author": {
                "username": {
                  "text": "KrishnamK-7"
                },
                "userId": "ur211630399"
              },
              "summary": {
                "originalText": "A Fun, Fast-Paced Entertainer with Heart"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar delivers exactly what it promises-a lively mix of comedy, drama, and action wrapped in a massy, feel-good package. The film centers around a quirky yet determined protagonist whose chaotic life spirals into a hilarious adventure filled with twists and unexpected emotional moments.<br/><br/>The first half is light, humorous, and engaging, with sharp dialogues and fun character interactions that keep you hooked. The pacing rarely dips, and the director balances comedy and sentiment well.<br/><br/>The lead actor shines with an energetic performance, making even the silliest situations feel enjoyable. Supporting characters add spice, especially in the comedic segments. The cinematography and music match the film&#39;s tone-vibrant, colorful, and upbeat.<br/><br/>The second half leans a bit more into drama, but the emotional payoff works. While the plot may not be groundbreaking, Dhurandhar succeeds because of its charm, performances, and its ability to entertain without overcomplicating itself."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018699/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015165",
              "author": {
                "username": {
                  "text": "alexs-3272"
                },
                "userId": "ur211602769"
              },
              "summary": {
                "originalText": "Akshay khanna , Aditya dhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshay khanna is op, all cast , direction, everything is above par, go watch in cinema.<br/><br/>Action sequences all small big characters , that real mumbai attacks audio add life to movie\nEagerly waiting for second part.<br/><br/>If u r light hearted person, be careful of action sequences\nU may feel uncomfortable."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015165/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025767",
              "author": {
                "username": {
                  "text": "divakrkumarp"
                },
                "userId": "ur132245507"
              },
              "summary": {
                "originalText": "One of the Best \"True-Event-Inspired\" Movies with a Powerful Star Cast, Outstanding Performances, and Exceptional Sound & BGM"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of the finest films of recent times and easily stands out as one of the best movies of 2025. Bollywood has rarely attempted storytelling at this scale or depth. The way the film blends real-life-inspired events-such as the Parliament attack and 26/11 Mumbai attacks-into a gripping narrative is both bold and impactful.<br/><br/>The movie powerfully portrays how terror networks operate across borders, showing the interconnections between Pakistan-based terror groups, local criminal gangs, and the alleged involvement of intelligence networks like the ISI, as represented in the film. It also highlights how masterminds operate from across the border while maintaining layers of deniability-an angle that mainstream cinema often avoids or softens.<br/><br/>The second major theme explored in the movie-the circulation of fake currency through routes like Nepal and Bangladesh and the expansion of hawala networks-adds another chilling layer to the story. The film depicts how these underground financial systems helped sustain terror operations for years. It also raises uncomfortable questions about systemic failures and how such networks managed to thrive even as financial systems evolved-points that have been discussed in documentaries and eyewitness accounts over time.<br/><br/>Director Aditya Dhar deserves immense credit for crafting a true cinematic masterpiece. The way he connects every scene, character, and event with precision shows exceptional vision and storytelling maturity. Each sequence feels purposeful, intense, and rooted in realism, making the narrative both engaging and thought-provoking.<br/><br/>The performances elevate the film to another level.<br/><br/>Akshaye Khanna delivers a controlled yet powerful performance.<br/><br/>Ranveer Singh brings intensity and depth to his role.<br/><br/>Arjun Rampal, Sanjay Dutt, and Rakesh Bedi contribute strong, memorable performances that leave a lasting impact.<br/><br/>The sound design and background score perfectly complement the tension and emotional weight of the story, enhancing the cinematic experience throughout.<br/><br/>Final Verdict<br/><br/>Dhurandhar is undoubtedly one of the best films in Indian cinema in recent years-a bold, intense, and must-watch movie for anyone who appreciates powerful storytelling rooted in real-world events.<br/><br/>⭐ Highly recommended. Must watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025767/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11038413",
              "author": {
                "username": {
                  "text": "rajesh-02463"
                },
                "userId": "ur151052059"
              },
              "summary": {
                "originalText": "Fabulous movie. Must watch."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must Watch. Ranveer Singh&#39;s powerful and intense acting, often highlighting it as one of the film&#39;s biggest strengths. Akshaye Khanna&#39;s portrayal of a key character has also been lauded, his performance steals the show. The film&#39;s direction by Aditya Dhar, its action sequences, and cinematography have been appreciated for delivering a gripping spy-thriller experience. Screenplay as engaging and engrossing, keeping viewers hooked throughout its long runtime."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11038413/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011500",
              "author": {
                "username": {
                  "text": "Avinash29"
                },
                "userId": "ur79075940"
              },
              "summary": {
                "originalText": "A Brutal, Gripping Masterpiece - The Rise of Dhurandhar Hits Hard! (Spoilers)"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I went into Dhurandhar expecting a regular action-crime film, but what I experienced was beyond anything I&#39;ve watched lately. This movie doesn&#39;t just tell a story, it drags you into the brutal world of a man shaped by injustice, betrayal, and survival.<br/><br/>From the opening moments, where the young protagonist watches his world collapse due to a corrupt political system, the film sets the tone: raw, emotional, and unapologetic. The transformation from a helpless boy to the monstrous force known as Dhurandhar is one of the best character arcs I&#39;ve seen.<br/><br/>The action sequences are not just flashy, they are visceral and meaningful. Every punch, every bullet has a purpose. And that interval block? Absolute goosebumps. The BGM roars like a war cry every time Dhurandhar unleashes his rage, turning simple scenes into iconic moments.<br/><br/>The real shocker is the betrayal twist, the friend he trusted the most ends up being the one who sells him out, pushing him into full-fledged vengeance mode. The final showdown, with Dhurandhar standing alone covered in blood, choosing to embrace the monster society forced him to become, that hit hard. The movie doesn&#39;t end with a clean victory. Instead, it leaves us questioning justice, power, and survival.<br/><br/>Despite the violence, the film has a heart, the emotional scenes with his mother and the gut-wrenching loss he faces remind us why he became what he did.<br/><br/>From start to finish, I was fully locked in. 3 hours and 32 minutes felt like a rollercoaster of tension and triumph. The screenplay is tight, the performances are intense, and the music carries the soul of the film.<br/><br/>For me, this is the best movie I&#39;ve watched in years. Brutal, stylish, emotional, a cinematic punch straight to the heart.<br/><br/>🔥 10/10 - Dhurandhar isn&#39;t just a film, it&#39;s an experience! 🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011500/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007078",
              "author": {
                "username": {
                  "text": "mohitkto"
                },
                "userId": "ur173978627"
              },
              "summary": {
                "originalText": "Built with courage, crafted with chaos, delivered with brilliance"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "There is a methodical intensity in Dhurandhar that makes every scene count. Ranveer Singh captivates as a man caught between duty and conscience, portraying vulnerability without sacrificing charisma. Director Dhar&#39;s command over pacing allows suspense to simmer before explosive payoffs, and the action sequences feel authentic and consequential. Supporting performances enrich the narrative, making the underworld fully realized and dangerous. The cinematography&#39;s visual language enhances storytelling, capturing both intimate and chaotic moments, while the score heightens tension. Dhurandhar is cinema that respects intelligence and rewards attention."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007078/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007513",
              "author": {
                "username": {
                  "text": "SahirS-6"
                },
                "userId": "ur200142034"
              },
              "summary": {
                "originalText": "Blockbuster"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I recently watched Dhurandhar and it&#39;s a complete blockbuster! Every actor delivered a fantastic performance, and the director&#39;s vision was truly incredible. Akshaye Khanna absolutely nailed his role, and Ranveer Singh was, as always, a fabulous performer. Overall, a must-watch movie with powerful storytelling and outstanding execution."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007513/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022124",
              "author": {
                "username": {
                  "text": "drpyt-95151"
                },
                "userId": "ur132237469"
              },
              "summary": {
                "originalText": "Goat Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is the best movie I have seen till now I can say in theater l. Don&#39;t wait for it&#39;s pnline release just watch it in theater because the best experience is in theater, everything is goated in this movie from song to intro and cast is just toooooo good. Aditya Dhar literally cpoked so many things by this movie and don&#39;t miss the ending scene."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022124/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011034",
              "author": {
                "username": {
                  "text": "DeviP-42"
                },
                "userId": "ur211571629"
              },
              "summary": {
                "originalText": "Must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story grips you tightly from start to finish. The main characters had depth in their roles and each one of them was brilliant and have taken the experience to the next level. The supporting star cast too had very meaningful roles. The action scenes were intense and executed very well. The storyline is hugely based in the backdrop of geopolitical happenings between 1999-2010 in Indian subcontinent and intermittently uses real world events and real news footage and blends them very nicely in the screenplay. There was smart humour in places that helped lighten the mood after series of intense action and complex political/underworld scenes. This is a must watch!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011034/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010624",
              "author": {
                "username": {
                  "text": "Tadikondak"
                },
                "userId": "ur210696351"
              },
              "summary": {
                "originalText": "Movie is very nice"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a full-on commercial entertainer that aims to deliver action, comedy, and emotion in a single package. The story follows a bold, street-smart hero who never steps back when it comes to fighting injustice. From the opening sequence itself, the film establishes its mass attitude with larger-than-life heroism and punchy dialogues meant to excite fans who love high-voltage cinema.<br/><br/>The narrative is simple, built around social issues that many people can relate to. Instead of focusing on too many subplots, the screenplay keeps the mission of the protagonist clear: protect the weak and punish the corrupt. This makes the audience quickly connect with the hero&#39;s intentions, even if the story becomes predictable at times.<br/><br/>The lead actor is the biggest strength of Dhurandhar. His swag, emotional intensity, and comic timing keep the film entertaining throughout. Even routine scenes become enjoyable because of his strong presence. The heroine doesn&#39;t get much screen time, but she adds charm and contributes to a few feel-good romantic and comedy moments. The antagonist is powerful, with a good backstory and strong motives, which helps create a convincing clash between good and evil.<br/><br/>The first half is filled with fun comedy, stylish action scenes, and energetic songs. The interval twist successfully builds curiosity for what comes next. The second half focuses more on emotional drama and the hero&#39;s personal struggle. A few scenes feel lengthy and could have been trimmed, but the climax once again raises the energy with intense stunts and a meaningful message.<br/><br/>Technically, the film scores well. The background music enhances every action block. Cinematography captures both the mass crowds and emotional close-ups effectively. Songs are catchy, especially the hero introduction song and the celebratory track.<br/><br/>Overall, Dhurandhar may not offer a new storyline, but it definitely delivers solid entertainment. Fans of mass action films will enjoy its energy, heroism, and crowd-pleasing moments."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010624/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015428",
              "author": {
                "username": {
                  "text": "rahul-95703"
                },
                "userId": "ur182655314"
              },
              "summary": {
                "originalText": "Exposes reality of Pakistan as a terror state"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I would encourage global audience to see this film and understand reality of government and military of Pakistan sponsoring terrorism to attack india. It gives a clear picture of what pakistan actually is. The film is action packed and has great acting by all the star cast. Akshay Khanna and Ranveer singh did a stand out job."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015428/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11064888",
              "author": {
                "username": {
                  "text": "Sushant-652"
                },
                "userId": "ur211983377"
              },
              "summary": {
                "originalText": "Goosebumps !!👌👌"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Masterpiece !! What an amazing movie...Kudos to everyone. Top notch acting by everyone especially Ranveer Singh and Akshaye Khanna. Rakesh Bedi excels in every scene 👌👌🙏🙏. After Uri , Aditya Dhar strikes again with an impeccable story line and direction.. Hats off to everyone who&#39;s been part of this movie..Hard work pays off🙏🙏🙏🙏.. Jai Hind .. Vande matram 🙏🙏..Bharat mata ke Jai 🙏🙏🙏🙏"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11064888/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007622",
              "author": {
                "username": {
                  "text": "gauravs-433"
                },
                "userId": "ur211550211"
              },
              "summary": {
                "originalText": "Gripping Real Musical Indian"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After a looooooooong time India has produced a movie which will prove to be a watershed moment in India&#39;s film making\nAditya Dhar has delivered a masterpiece, from casting, writing, screenplay, editing, background score every fundamental aspect of film making has been penned down to the last note with perfection\nA must watch by everyone who is not aware about terror funding and execution\nYes its violent (but necessarily) yes its gore (but necessarily)\nBig cheers."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007622/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013713",
              "author": {
                "username": {
                  "text": "Anurag25"
                },
                "userId": "ur135953582"
              },
              "summary": {
                "originalText": "A Must Watch Spy Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those rare Hindi spy thrillers that grips you from the opening frames and never loosens its hold. It unfolds against a backdrop of gang wars terror networks and geopolitical tensions yet always keeps its focus on human emotions and moral dilemmas. The narrative builds steadily layering tension and clues rather than rushing from set piece to set piece so by the time the bigger operations erupt you are completely invested in what happens to each character.<br/><br/>Ranveer Singh is a true chameleon here disappearing into his part instead of playing a loud showy hero. His performance is beautifully supported by a stellar ensemble Akshaye Khanna, Sanjay Dutt, Arjun Rampal, R Madhavan and others all feel perfectly cast and get moments that genuinely stand out. No role feels wasted as even supporting characters add meaningful weight to the story.<br/><br/>What elevates Dhurandhar further is Aditya Dhar direction and the film technical polish. The use of grounded action street level sequences real world style events and news like footage gives the film a sense of authenticity that makes several scenes genuinely spine chilling. Sound design is used cleverly especially during attacks and interrogations to pull you right into the chaos and fear of the situation.<br/><br/>Dhurandhar is not just loud patriotism or glossy espionage. It is a tense emotional and intelligent thriller that respects the audience intelligence. If you are tired of formulaic action films and want a big screen experience that combines sharp writing powerful performances and realistic politics this movie is absolutely worth your time. Grab your friends or family and catch it in a theatre while you can. You will walk out discussing scenes and characters for days.<br/><br/>Sources."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013713/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007246",
              "author": {
                "username": {
                  "text": "rajh-98043"
                },
                "userId": "ur118094796"
              },
              "summary": {
                "originalText": "Stellar Performances in Every Frame"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s narrative unfolds with a combination of intelligence, suspense, and adrenaline-charged action sequences. Ranveer Singh&#39;s portrayal is a perfect blend of moral conflict, emotional vulnerability, and intense physicality, anchoring the story at every turn. Sanjay Dutt dominates the screen with commanding authority and gravitas, while Akshaye Khanna and R Madhavan provide subtle, layered performances that enhance the ensemble. Arjun Rampal&#39;s silent menace maintains a pervasive tension, and Sara Arjun&#39;s emotional depth adds a humanizing layer to the story. Director Aditya Dhar masterfully integrates suspenseful plotting, strategic confrontations, and high-octane action, ensuring a cohesive narrative. Cinematography captures both large-scale chaos and intimate, emotional beats, while the musical score heightens suspense, emotion, and tension. By the finale, the film delivers an emotionally charged, adrenaline-fueled climax that resonates long after the screen fades to black."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007246/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11034466",
              "author": {
                "username": {
                  "text": "vinayrawatindia"
                },
                "userId": "ur159604736"
              },
              "summary": {
                "originalText": "Keep engaged for 3 hr 34 min"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A solid 10/10 for one simple reason: the film never feels boring, not even for a minute. It keeps you fully engaged from start to finish. Every actor delivers a strong, convincing performance, making it unnecessary to single out anyone. Certain scenes genuinely evoke a sense of patriotism. The characters are written so well that you love them in one moment and hate them in the next. The film plays with your emotions and mind effortlessly, like a puppet master in complete control."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11034466/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11051016",
              "author": {
                "username": {
                  "text": "ArthF"
                },
                "userId": "ur211052187"
              },
              "summary": {
                "originalText": "Absolute cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What an absolute banger by Bollywood in a long time. Absolute phenomenal choice of music. 10/10 cinematography. The way of narration of story is peaked. Character development is mind boggling. The division of story line into chapters establishing a smooth story line which reminds of kill bill by Tarantino. Go for it."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-24",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11051016/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003394",
              "author": {
                "username": {
                  "text": "berananigopal"
                },
                "userId": "ur103022051"
              },
              "summary": {
                "originalText": "Khatarnak action movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Superb movie must watch in theatre....3:30 min kaise kaat gaya pata nehi chala 5 in 5 star...all actors are superb acting also our director just owww\nAkshay Khanna master class of acting and R Madhvan new look acting of Ajit Saniyal(Doval) it really good. Ranveer Singh it&#39;s so good of his character. Khatarnak spy action movie. I am really waiting for 2nd part of DHURANDHAR."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003394/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012868",
              "author": {
                "username": {
                  "text": "deveshmahato"
                },
                "userId": "ur150914295"
              },
              "summary": {
                "originalText": "Best Indian Spy movie...."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping film with strong performances and tight direction. The story is engaging, filled with emotion, tension, and smart twists. Great acting, good pacing, and impressive visuals make it a solid and entertaining watch. Things shown in the movie looks logical and grounded worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012868/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007555",
              "author": {
                "username": {
                  "text": "vijay-6239"
                },
                "userId": "ur211550569"
              },
              "summary": {
                "originalText": "Amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Really glad they went with something different here for Ind vs Pak conflict, and took their time to build the world and establish characters.<br/><br/>Extremely brutal, violent and stylish.. just how I like.. actions scenes are a bit choppy but fun.<br/><br/>Conversations are long but crafted so well that every word feels important and not a single moment feels dull.<br/><br/>Stll have a lot of thinking to do and a lot to process about this one so might change it to perfection later."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007555/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}