{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6dcjptazcwzy472vxvnbyr7tm6abz2mmtx7xkapd6mqbdf4skydk2oqyv7pzyodusi67dilja6zwnskaocxpfa2za",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11007479",
              "author": {
                "username": {
                  "text": "VandanaS-53"
                },
                "userId": "ur211549939"
              },
              "summary": {
                "originalText": "Ghayal and Ghatak... Must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Top Noch... 100% Much watch movie. GO and WATCH this movie in CINEMA HALLS only... The BGM, the Acting, the Story, the songs everything about this movie is refreshing. I don&#39;t know when 03:30 hours passed. This movie shows how spy, espionage works in real word not like YRF delusional world. Dhurandhar...."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007479/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016323",
              "author": {
                "username": {
                  "text": "Utpal-002"
                },
                "userId": "ur211609404"
              },
              "summary": {
                "originalText": "Great movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best movie bollywood ever make. It has everything best actors best story no extra love drama. No forced love between India and Pakistan and it shows real and exact face of Pakistan. Because of that some people doesn&#39;t like this movie, but if you have a great taste in movie you might like this movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016323/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010627",
              "author": {
                "username": {
                  "text": "DeepakR-615"
                },
                "userId": "ur211569059"
              },
              "summary": {
                "originalText": "Perfect Spy Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Honestly one of the best spy genre movie for me i loved the way they presented the intensity of the underworld and perfectly shown the inner politics of the world!!<br/><br/>Performance wise Akshaye Khanna my man hats off loved every second of you ranveer also nailed and also every character played their role perfectly and want to see more of arun rampal as major iqbal waiting for part 2 eagerly!!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010627/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007128",
              "author": {
                "username": {
                  "text": "taraksoni"
                },
                "userId": "ur115070127"
              },
              "summary": {
                "originalText": "Star-Studded Entertainment for Everyone"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s narrative structure builds tension and character depth simultaneously. Ranveer Singh delivers a layered, compelling performance, navigating moral dilemmas, action sequences, and emotional beats with skill. Sanjay Dutt commands attention with gravitas, and Akshaye Khanna and R Madhavan add subtlety and depth to the ensemble. Arjun Rampal&#39;s quiet menace adds suspense, and Sara Arjun&#39;s emotional sequences humanize the stakes. Aditya Dhar directs with precision, balancing strategy, suspense, and explosive action. Cinematography captures both grand-scale chaos and intimate drama, while the score heightens every moment of tension. The finale combines adrenaline-fueled action with emotional resonance."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007128/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11070702",
              "author": {
                "username": {
                  "text": "rajeevsoobul"
                },
                "userId": "ur107607039"
              },
              "summary": {
                "originalText": "Best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best movie ever. Since years haven&#39;t watched a so beautiful movie. Hope bollywood make more beautiful movies like this. Already watched it in cinema and now I want to watch it in netflix. I hope Ranveer singh will get the best actor award in the filmfare award ceremony and Aditya Dhar as best Director. Thank you..."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11070702/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023737",
              "author": {
                "username": {
                  "text": "mikhilsaluja"
                },
                "userId": "ur58002811"
              },
              "summary": {
                "originalText": "Trying too hard to be cool"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar has a promising premise but collapses under the weight of its own styling.<br/><br/>The chapter structure is the first giveaway. Chapters arrive without narrative purpose. There&#39;s no shift in perspective, no temporal leap, no thematic transition. It&#39;s often just the same scene continuing under a new title. For an otherwise linear story, the excessive chaptering feels like borrowed grammar from auteur cinema, without understanding why that grammar exists. It&#39;s form for the sake of form.<br/><br/>Ranveer Singh&#39;s performance is equally puzzling. His voice is pushed into an exaggerated baritone, unnaturally gruff throughout, to the point where it feels imposed rather than organic. Instead of adding gravitas, it distances the character from any emotional credibility.<br/><br/>The music is where the film truly unravels. There is no musical language, only a playlist. Folk, Indian classical, guitar-heavy rock, rap, old Hindi film music, Arabic textures, and then suddenly American jazz playing during a casual evening scene in Pakistan. The transitions are abrupt and unmotivated. It feels less like a score evolving with the narrative and more like the filmmakers trying to justify the rights they purchased. Compare this to a well-made Hollywood action film, where the score may evolve but still feels like it belongs to one world, one story. Here, every genre is fighting for attention.<br/><br/>The action sequences are styled to look &quot;cool&quot; rather than feel real. Slow-motion entries, loud needle drops, stylised gunplay, bodies flying with visibly poor CGI. Physics is treated as optional. Indian mainstream cinema still struggles with action that respects weight, impact, and consequence, and Dhurandhar doesn&#39;t break that pattern.<br/><br/>Narratively, key emotional beats are rushed or mishandled. Akshay&#39;s son&#39;s death, for instance, is treated with startling superficiality. There&#39;s no real inquiry into how it happened, no emotional processing, no investigative weight. Instead, the film jumps straight into formalities, interviews, rewards, and exposition-heavy dialogue that conveniently pushes Ranveer into the next plot role. It feels mechanical, like ticking story boxes rather than telling a story.<br/><br/>Ultimately, the film is obsessed with looking suave. Every moment is engineered for swagger. Loud music, slow motion, stylised violence, cool poses. But none of it feels grounded. The irony is that the core premise is strong. With restraint, coherence, and emotional discipline, it could have worked. Instead, the execution leans heavily into a glossy, Rohit Shetty-esque spectacle that mistakes noise for impact.<br/><br/>Style overwhelms substance. And the film never recovers from that imbalance."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 9
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023737/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010711",
              "author": {
                "username": {
                  "text": "AVNEESHK-523"
                },
                "userId": "ur211569270"
              },
              "summary": {
                "originalText": "A brutally realistic spy film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A unflinching spy thriller that portrays the Pakistan-sponsored terrorism with gritty realism. Its rough, documentary-style approach makes every scene tense and unsettling. A stark, compelling watch that refuses to sugarcoat the world of covert conflict.<br/><br/>This spy thriller stands out for its unfiltered, unpolished look at a world usually dressed up with glamour. Instead of slick action sequences and invincible agents, the film delivers a tense, ground-level view of espionage and conflict. What makes it especially gripping is its fictional portrayal of Pakistan-sponsored terrorism, shown not through dramatic exaggeration but through small, chilling details that make the story feel disturbingly plausible within its narrative universe.<br/><br/>From the first scene, the film throws the audience into a world where chaos is routine, trust is scarce, and survival depends on decisions made in split seconds. The cinematography is intentionally rough-handheld shots, muted colors, and unsteady close-ups that make you feel like you&#39;re right there with the characters, breathing the same dusty air and absorbing the same fear. Nothing here feels staged or sanitized."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010711/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004283",
              "author": {
                "username": {
                  "text": "SumitG-418"
                },
                "userId": "ur209228938"
              },
              "summary": {
                "originalText": "Best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is perfect, story perfect, character are perfect, background music perfect, everything is perfect\nI love every character, 3:33 hours movie feel like 1 hours because story is so perfect,<br/><br/>Plzz go and watch this movie\nI give this movie 10/10 👊<br/><br/>ranbir singh acting was so Good\nAnd other characters too."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004283/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023315",
              "author": {
                "username": {
                  "text": "vsaxena-95944"
                },
                "userId": "ur85398789"
              },
              "summary": {
                "originalText": "Excellent cinema."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Who&#39;s it for? ✅ Fans of big-budget Bollywood thrillers\n✅ Viewers who enjoy gritty espionage / gangster dramas\n✅ Those who like ensemble cast films and strong lead performances<br/><br/>Who might skip it? 🚫 People who dislike long movies\n🚫 Viewers averse to politically charged storytelling or heavy violence<br/><br/>In short: Dhurandhar is a grand cinematic event with powerful performances and immersive world-building - admired by many - but demands patience due to its length and thematic weight.<br/><br/>---<br/><br/>If you want, I can break down the main performances and how each actor fared according to critics and audiences!"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023315/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007306",
              "author": {
                "username": {
                  "text": "nikhatk-71034"
                },
                "userId": "ur123095231"
              },
              "summary": {
                "originalText": "Action, Emotion, and Pure Cinematic Fun"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Each scene feels meticulously designed, blending narrative depth with visual spectacle. Ranveer Singh navigates high-pressure sequences and quiet moments of reflection with equal skill, while Sanjay Dutt adds authority and gravitas, dominating pivotal confrontations. Akshaye Khanna and R Madhavan support the story with subtle, layered performances, and Arjun Rampal&#39;s quiet menace permeates key sequences. Sara Arjun&#39;s presence provides emotional clarity, reminding the audience of what&#39;s truly at stake. Aditya Dhar&#39;s direction balances cerebral plotting with breathtaking action, ensuring that suspense builds naturally. Cinematography captures chaos and calm with equal finesse, while the soundtrack underscores tension without overwhelming. By the climax, the film delivers a high-octane, emotionally resonant finale that lingers long after the screen fades to black."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007306/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017865",
              "author": {
                "username": {
                  "text": "RadhikaK-984"
                },
                "userId": "ur211622849"
              },
              "summary": {
                "originalText": "Outstanding movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Stupendous movie with brilliant acting!!Akshay Kumars acting was par excellence. The movie kept you on your toes. The only thing I didn&#39;t like was the violence but that goes w be ith the theme of the movie. The songs were really pawesome loved all of them.<br/><br/>I loved the way they have handled the issue of Pakistan sponsored terrorism and showed the actual footage of 26/11 and also the parliament attack. We need to stop soft peddling on the issue of terrorism."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017865/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014252",
              "author": {
                "username": {
                  "text": "dpgs-03735"
                },
                "userId": "ur132200889"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a thoroughly engaging and well-crafted film that delivers entertainment with an impressive blend of action, humor, and emotional depth. From the very beginning, the movie captures attention with its crisp storytelling and energetic pace. The director deserves appreciation for presenting a simple plot in a refreshing way, keeping the audience invested throughout.<br/><br/>One of the biggest strengths of Dhurandhar lies in its screenplay. The story flows smoothly, the transitions are natural, and there are no unnecessary scenes that slow down the pace. The dialogues are sharp yet easy to connect with, and many moments leave a lasting impression. The film manages to stay entertaining without losing its emotional core.<br/><br/>Visually, Dhurandhar is appealing. The cinematography captures each scene with clarity and thoughtful framing. The music and background score enhance the impact, especially during key emotional and action sequences. The editing is clean, making the film feel polished and professional.<br/><br/>Overall, Dhurandhar is a delightful watch that combines strong performances, engaging narration, and meaningful moments. It succeeds in delivering positivity, entertainment, and a heartfelt message without being overly dramatic. The film leaves the viewer satisfied and smiling, making it one of the better releases in recent times."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014252/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013520",
              "author": {
                "username": {
                  "text": "abhik-1693"
                },
                "userId": "ur211590920"
              },
              "summary": {
                "originalText": "Finally a well made espionage movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A relentless, masterfully and well crafted spy epic that hits like a bullet. Ranveer Singh delivers a career-best performance as the fierce, flawed RAW agent, backed by a chiling Akshaye Khanna nd rock-solid ensemble. Aditya Dhar&#39;s direction is tight, the action is brutal nd grounded and the four-hour runtime flies by. No fluff, no slow-motion hero walks... just pure tension, patriotism, and jaw-dropping twists inspired by real events. Easily the best Bollywood thriller in years. Book your ticket now. This one&#39;s unmissable ✨✨✨"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013520/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11064891",
              "author": {
                "username": {
                  "text": "rainasuraj-71659"
                },
                "userId": "ur150974025"
              },
              "summary": {
                "originalText": "Awesome direction and fabulous acting 💖"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "In the history of bollywood films, Dhurandhar Movie is the one of best movies with real event based story, especially the 11/26 unfortunate incident of Mumbai ,India. De-monetization of Indian currency and showing the reality of fake currency nexus and how India break down that nexus with strong willpower and execution.<br/><br/>Must watch movie 💖"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11064891/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007679",
              "author": {
                "username": {
                  "text": "iamanurag-95304"
                },
                "userId": "ur61383419"
              },
              "summary": {
                "originalText": "Not bad, but exhausting in parts. Excellent performances!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This 5/10 is for two things: one for the solid acting performances and the other is for the music.<br/><br/>Everything else just feels like an unnecessary dose of hyperpatriotism. Which is fine but unfortunately it doesn&#39;t stick beyond it&#39;s docu-drama effect which is purposely kept to fill the audience and keep the aggression high."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 30
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007679/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010477",
              "author": {
                "username": {
                  "text": "vipulsharma-67482"
                },
                "userId": "ur164441954"
              },
              "summary": {
                "originalText": "Worth every penny"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Didn&#39;t even feel like a 4 hour movie, not for a single second got bored. Amazing storytelling on how to slowly build the characters and story. Ranveer Singh was an absolute beast, I think it might be the best character and movie of his career so far. Bollywood has released a great movie after a long time."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010477/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014796",
              "author": {
                "username": {
                  "text": "ShambhuG-25"
                },
                "userId": "ur211592490"
              },
              "summary": {
                "originalText": "Movie with no nonsense story"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a compelling film that beautifully captures the spirit of patriotism and the resilience of our nation. Through its powerful storytelling and strong characters, the movie inspires a deep sense of pride in our cultural heritage and the sacrifices made by countless heroes. The narrative skillfully highlights the importance of unity, courage, and the relentless pursuit of justice-values that are essential to the spirit of nationalism. The film&#39;s portrayal of dedication to the motherland encourages viewers to reflect on their own responsibilities as citizens. The commendable performances by the cast bring authenticity and emotion to the story, making the patriotic message resonate on a personal level. The striking visuals and evocative music further amplify the sense of devotion and love for the country. Dhurandhar is not just entertainment; it is a tribute to the indomitable spirit of our nation and a reminder that true nationalism thrives in actions fueled by sacrifice, respect, and unwavering commitment. This movie motivates us all to stand together, celebrate our shared identity, and contribute actively to the progress and honor of our nation."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014796/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015134",
              "author": {
                "username": {
                  "text": "rickyricky-63746"
                },
                "userId": "ur61312168"
              },
              "summary": {
                "originalText": "This is how gone Direct movie's"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What a movie man just amazing storyline start end just engaged to it the characters are just for in the role pretty well Extremely great performance by all the characters Especially Akshay,Ranbeer,Sanju Hats of there acting level on high level its lon g movie but feel i want more than that lets Wait for the next chapter ahead."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015134/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024524",
              "author": {
                "username": {
                  "text": "knowledgebooster-71088"
                },
                "userId": "ur165297915"
              },
              "summary": {
                "originalText": "Goated movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The greatest film of 2025 and ranveer singh&#39;s best film as well he acted so well in the character I just loved it, talking about Akshay Khanna he just out played everyone what actor amazing performance done by him and talking about sanjay dutt and Arjun Rampal they played their character really good as well overall film was fantastic."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024524/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007115",
              "author": {
                "username": {
                  "text": "maisourabhsingh"
                },
                "userId": "ur196195037"
              },
              "summary": {
                "originalText": "A film that embraces intensity with every breath"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a complete entertainer. Ranveer Singh leads with electrifying performances, while Sanjay Dutt delivers his usual strong, emotional presence. Akshaye Khanna and R Madhavan shine in their roles, giving the film depth and charm. Arjun Rampal impresses in the action sequences, and Sara Arjun is memorable in her emotional scenes. Aditya Dhar&#39;s direction and writing make the story easy to follow and highly engaging. The balance of action, emotions, drama, and humor makes it a must-watch for anyone who loves cinema."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007115/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016125",
              "author": {
                "username": {
                  "text": "Pratishthag-7"
                },
                "userId": "ur211608303"
              },
              "summary": {
                "originalText": "Good movie.."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Good action and good acting. Entire cast did a great job playing there respective role be it akshye khanna ranveer singh arjun rampal R. Madhvan or sara arjun. And good direction and good music loved it&#39;s kaarvan song.. Although it&#39;s a remake still... And obviously the title track......best spy movie and had parallels with reality."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016125/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016750",
              "author": {
                "username": {
                  "text": "Isha-9257"
                },
                "userId": "ur211612517"
              },
              "summary": {
                "originalText": "Loved it!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "All must go and watch it. Such a beautiful movie 🔥💃🔥💝💝 The Plot, twist and turns, cinematography, music- everything is just mindblowing. Special appreciation goes to the director and actors. Words are not enough to appreciate such a masterpiece. Go to the theater to encourage for more movies like this."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016750/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010948",
              "author": {
                "username": {
                  "text": "tejalrivan"
                },
                "userId": "ur93258355"
              },
              "summary": {
                "originalText": "Amazing Movie showcasing real Facts"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie showcases real fact that new GenZ, Gen Alpha, Gen Beta needs to watch as it makes picture clear about Pakistan and how that place even exists. The story also reveals how Indian Intelligence does covert operation but so very little credit is given by Indian Citizens they have little clue of what a person goes through in his/her life while serving their Nation."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010948/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022170",
              "author": {
                "username": {
                  "text": "vijenderdagar1991"
                },
                "userId": "ur56346840"
              },
              "summary": {
                "originalText": "Highly recommended"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar\nDhurandhar is a powerful and engaging film that keeps you hooked from start to finish. The storyline is intense and well-crafted, with strong emotional depth and meaningful moments. The performances are outstanding-each actor delivers with conviction, making the characters feel real and impactful.<br/><br/>The direction is sharp, and the screenplay maintains a good pace without unnecessary scenes. The background score and cinematography elevate the overall experience, adding to the film&#39;s seriousness and drama. Dialogues are strong and leave a lasting impression.<br/><br/>Overall, Dhurandhar is a must-watch movie for those who enjoy gripping stories with solid performances and quality execution. Highly recommended."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022170/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014029",
              "author": {
                "username": {
                  "text": "hirakbanerjee-08536"
                },
                "userId": "ur150784428"
              },
              "summary": {
                "originalText": "Wow😮"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Everyone should watch the movie Dhurandhar. If you are a defence enthusiast, then you must watch it. The film&#39;s action, acting, songs, BGM, and cinematography are all outstanding.<br/><br/>Although there are a few minor flaws, the movie feels so realistic that it can keep you glued to your seat for three and a half hours.<br/><br/>Yes, some people might find this level of realism hard to digest - but if you&#39;re not among them, then definitely go watch it at your nearest theatre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014029/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}