{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6tcrntazcwzy472xhznzqr3smyaj33upd74pjb3aomqbdf4skydk3oy2vjmbyocsm76nx4lbjk4j4akihvwy3ydva",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11030920",
              "author": {
                "username": {
                  "text": "bhanu-mocharla"
                },
                "userId": "ur35901396"
              },
              "summary": {
                "originalText": "Realistic spy movie!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best action, best screenplay and no boring romance. To the point movie. Haven&#39;t seen a Bollywood movie like this before. No interrupting or out of context songs. Did not get bored with the 3-1/2 hour screen time. No box/cgi that is unnatural or in related. Waiting for the second part eagerly. I suggest this movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11030920/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006838",
              "author": {
                "username": {
                  "text": "zdncliet"
                },
                "userId": "ur177078248"
              },
              "summary": {
                "originalText": "Flood of Feelings and Fierce Fights"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening sequence, the film establishes a sense of controlled chaos, pulling viewers into a world where trust is fleeting and danger lurks around every corner. Ranveer Singh&#39;s portrayal is layered, showing vulnerability beneath a hardened exterior, while the supporting cast, including the brilliant portrayal of a cunning antagonist, brings a palpable intensity to every scene. The direction by Dhar ensures that the long runtime feels justified, weaving together political maneuvering, emotional stakes, and pulse-pounding action with precision. The editing is sharp, creating a rhythm that balances quiet tension with explosive sequences. Visuals are striking, capturing both the grimness of the underworld and the personal stakes of the characters&#39; journeys. The screenplay is intelligent, planting subtle clues early on that pay off spectacularly in the later acts. Every punch, chase, and confrontation feels earned, contributing to a sense of realism that keeps you on edge. By the time the story reaches its conclusion, the combination of performance, direction, and technical mastery leaves a lasting impact."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006838/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004012",
              "author": {
                "username": {
                  "text": "kiratjotsingh"
                },
                "userId": "ur131590810"
              },
              "summary": {
                "originalText": "3hr 34min feels very short"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched dhurandhar by keeping all the hate aside from ranveer singh and guess what it was soo worthy I enjoyed movie that much i didn&#39;t even realised when it finishes the characters play there role so perfectly and specially akshay khanna .<br/><br/>I will say you should really see this movie don&#39;t go for boycott ranveer and etcetera you really need to praise the work which is needed to appreciate."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004012/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014262",
              "author": {
                "username": {
                  "text": "nikhilverma-44940"
                },
                "userId": "ur131984782"
              },
              "summary": {
                "originalText": "Atmosphere, performence and intensity"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie starts in a diabolical manner ,sheds light on the on going brutal gang war lyari town of Pakistan ,take real life incident kneet a well crafted narrative and story around the events and people involved with it ,it just takes you on the world&#39;s craziest ,intense and clever ride of the world.here the MC remains as a observer as a spy should and infiltrate the very core of terrorism.dont think twice just watch ASAP on the biggest screen possible."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014262/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002277",
              "author": {
                "username": {
                  "text": "sachinrawat782"
                },
                "userId": "ur58575994"
              },
              "summary": {
                "originalText": "One of the best spy movie from India."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is long but quite detailed and of serious tone. In any point movie doesnt feel boring. Different from other spy movies in recent times.<br/><br/>Loved action choreography and set designs. Great performance by all actors including side actors too. BGM and sound track is also good.<br/><br/>Hats off to entire team for this wonderful movie."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002277/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014130",
              "author": {
                "username": {
                  "text": "akashdubeycool"
                },
                "userId": "ur114445430"
              },
              "summary": {
                "originalText": "Truth Can't be hide, the History always be remember"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Astonishing performance of Ranveer Singh, wasn&#39;t expecting this good mesmerizing movie, can also watch for 2-3 times this movie... this is what i call a real cinema, not some random beautiful ISI girls seducing our RAW agents :-) , like we&#39;ve seen during our grown ups ages. I like the story Akshay sir was fabulous undoubtedly, Arjun Rampal is good seems like bad guys role works well with his personality...\neveryone should watch this movie.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014130/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023457",
              "author": {
                "username": {
                  "text": "Pradyumna-49"
                },
                "userId": "ur211665637"
              },
              "summary": {
                "originalText": "Amingst best Bollywood Spy Movies EVER!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Thank you team dhurandar for the script, direction, casting and sets.<br/><br/>Thank you for narrating the stories so compelling that many nations ban the movie.<br/><br/>Characters feel so real that can&#39;t help to feel the valour and vengence.<br/><br/>Akshay Khanna wasent the only villain or the hero but most ppl that&#39;ll watch this movie in later weeks shall only be because of social media spoilers that show akshay Khanna and his presence and dialogue delivery with body language and expressions..<br/><br/>Ranveer Singh looks were somewhat similar look like Padmavat perticularly in initial few scenes of Padmavat. But he could evoke the valour and grit of audience with his silent act. Many instances his expressions and body language expressed more than any dialogue for the given scene.<br/><br/>Arjun Rampal - shout out for his looks and act that bring the character to life so much so that it felt very real.<br/><br/>Likes of sanjay dutt as cop, Rakesh Bedi as a very real politician and last but least MAN AJIT DOVAL played by MADHAVAN was amazing !!!<br/><br/>My appetite to watch brutal action isn&#39;t great and I felt distasteful after watching animal which neither had a compelling story nor any message however watching dhurandar with very similar brutal action but this tym backed by a compelling story and purpose.<br/><br/>Thank you again team dhurandar!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023457/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006797",
              "author": {
                "username": {
                  "text": "TanishaK-28"
                },
                "userId": "ur210345573"
              },
              "summary": {
                "originalText": "Action That Commands the Screen"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the outset, the film crafts an atmosphere of controlled chaos, drawing viewers into a world where every choice carries heavy consequences. Ranveer Singh&#39;s performance is a masterclass in restraint and intensity, perfectly navigating a character torn between duty and morality. Director Dhar ensures that every plot thread is purposeful, balancing adrenaline-fueled action with carefully built suspense and character-driven drama. Supporting actors are given the space to shine, each performance layered with personal stakes and narrative significance. The action scenes are dynamic yet grounded, while cinematography captures the scale of conflict alongside intimate emotional beats. A subtle but effective score heightens tension without ever feeling intrusive. As the narrative escalates toward a climactic showdown, the film delivers both thrilling spectacle and profound emotional impact, confirming its place as a standout cinematic achievement."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006797/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023076",
              "author": {
                "username": {
                  "text": "deamonfox"
                },
                "userId": "ur6583798"
              },
              "summary": {
                "originalText": "Omg this is authentic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If authenticity is what you are looking for you will find it here. There is violence but no more than a Netflix or prime web series. Just cover your children&#39;s eyes for a total of 4 scenes. JK.<br/><br/>You will not regret this. Best movie coming from North India in the recent past. There is no hate for any religion just raw unfiltered narration."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023076/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020859",
              "author": {
                "username": {
                  "text": "nomad122"
                },
                "userId": "ur23256630"
              },
              "summary": {
                "originalText": "Work of art. Genius direction and casting"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Saw it today, What an amazing experience ? Don&#39;t get me wrong, there is a lot of explicit action and gore. That didn&#39;t spoil Game of Thrones so what&#39;s the problem here ?<br/><br/>The casting and performances are genius. I loved Maddy, Akshaye Khanna and Ranvir in this. It shows how real world espionage works. The move delves into the dark world of international undercover operatives without the usual bollywood glam. Its and absolute must watch and can&#39;t wait for the next part."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020859/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006844",
              "author": {
                "username": {
                  "text": "odggsdhk"
                },
                "userId": "ur177078345"
              },
              "summary": {
                "originalText": "A Saga Written in Sweat, Tears, and Stardom"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene is layered with tension, emotion, and meticulous attention to detail, creating a cinematic experience that demands engagement. Ranveer Singh carries the narrative effortlessly, delivering a performance that balances vulnerability with relentless determination. The supporting ensemble enhances the story, with characters that feel lived-in and complex. Dhar&#39;s direction is masterful, allowing action sequences to breathe without compromising narrative depth. The cinematography captures both the chaos of violence and the subtlety of character-driven moments, while the score heightens suspense without ever overwhelming the story. Action scenes are brutal yet purposeful, illustrating the harsh realities of the underworld. The story&#39;s pacing is deliberate, building intrigue before delivering explosive sequences that feel both inevitable and shocking. By the end, the film achieves a rare equilibrium between entertainment and thematic depth, making it an unforgettable journey."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006844/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009790",
              "author": {
                "username": {
                  "text": "vikas921454"
                },
                "userId": "ur58210859"
              },
              "summary": {
                "originalText": "Absolute cinema!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie deserves all the praises it is getting. Almost 3 and half hours movie and still keeps you hooked. All the actors, even the supporting cast, have played their part to the perfection. Not a single weak link. The music is one of the very best in recent times and the good thing is, it blends well with the overall narration without overpowering it. Amazing!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009790/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006805",
              "author": {
                "username": {
                  "text": "dineshkapoor-07020"
                },
                "userId": "ur141199797"
              },
              "summary": {
                "originalText": "Drama That Leaves a Lasting Impact"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s narrative unfolds like a tightly wound clock, each tick revealing more complexity, suspense, and high-stakes drama. Ranveer Singh commands attention in every scene, his portrayal filled with intensity, subtlety, and emotional depth that enriches the story. Director Dhar orchestrates the multifaceted narrative with confidence, balancing action, political intrigue, and human drama without losing coherence. The supporting cast enhances the texture of the story, providing compelling counterpoints and memorable moments. Fight sequences are brutal and realistic, choreographed to emphasize the story&#39;s stakes rather than simply impress visually. Cinematography captures the tension of both sprawling action and quiet, character-driven moments. By the finale, the convergence of plotlines and emotional arcs results in a deeply satisfying and impactful cinematic experience, leaving audiences impressed by the film&#39;s ambition and execution."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006805/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028279",
              "author": {
                "username": {
                  "text": "Ashish-205"
                },
                "userId": "ur211704480"
              },
              "summary": {
                "originalText": "must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Just watched Dhurandhar &quot;An intense and well-crafted film. Dhurandhar delivers powerful storytelling, solid acting, and memorable moments. The screenplay keeps the pace tight, and the climax hits hard. Highly recommended for serious cinema lovers.&quot;\nThe film balances emotion and intensity really well, supported by strong direction and impactful music. Every character feels rooted and convincing. Definitely worth watching.&quot;\nSpy thrilling intelligenc."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028279/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024115",
              "author": {
                "username": {
                  "text": "kumarshubhendu-19883"
                },
                "userId": "ur151037141"
              },
              "summary": {
                "originalText": "Total fire 🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It is patriotic, shows internal feelings of every true Indian. Waiting for the Revenge Arc. Based on real events. Pain, betrayal, revenge it gives everything. The acting of Ranveer Singh, Akshay Khanna, Arjun Rampal and Sanjay dutt is awesome. And R. Madhavan played the role every patriot admires him."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024115/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007010",
              "author": {
                "username": {
                  "text": "Ahaan53547"
                },
                "userId": "ur199123078"
              },
              "summary": {
                "originalText": "Action Ignites, Drama Elevates"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s narrative is carefully constructed, each act revealing new stakes and escalating tension. Ranveer Singh is exceptional, portraying a man whose inner turmoil is mirrored by the dangerous environment around him. Sanjay Dutt&#39;s gravitas adds authenticity to every confrontation. Akshaye Khanna and R Madhavan enhance the narrative with subtle, intelligent performances, while Arjun Rampal&#39;s understated menace constantly keeps viewers on edge. Sara Arjun&#39;s emotive sequences heighten the human cost of the plot. Aditya Dhar&#39;s direction combines suspenseful storytelling with high-octane action sequences, including hand-to-hand combat and thrilling chases. Cinematography captures both the large-scale chaos of the city and intimate emotional beats. The climax delivers adrenaline, tension, and emotional payoff in a perfectly calibrated package."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007010/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11045995",
              "author": {
                "username": {
                  "text": "anandkumarrs"
                },
                "userId": "ur122458479"
              },
              "summary": {
                "originalText": "A well made, engaging spy story"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Anand Kumar R. S My Flash Review:\nDhurandhar is scripted, directed, and produced by Aditya Dhar, whose earlier directorial outing was Uri: The Surgical Strike. If the &quot;Josh levels&quot; were high in that film, Dhar takes them even higher in Dhurandhar. Although the film opens with a long disclaimer stating it is purely a work of fiction, most viewers can tell that it is largely based on real events, accounts, and people. For those closely following current affairs, the events depicted in the film are easy to relate to and therefore engaging.<br/><br/>Any commentary on the film is difficult without mentioning its length. The film runs for 3.5 hours, and this is only Part 1. A sequel is scheduled for release by March 2026. With such a lengthy film, it is a significant challenge for the creators to keep viewers engaged throughout, and in this regard, I would say it is a mixed bag. The screenplay mostly keeps us engaged, but there are moments when it struggles to hold our attention, only to regain it later. The ability to stage a comeback when the film begins to lag is one of the film&#39;s strong points.<br/><br/>Dhurandhar clearly belongs to the spy thriller genre, but is entirely different from the &#39;Pathan, War, Ek Tha Tiger&#39; types of spy thrillers. Because it is based on real events, it is more intense, with a raw storytelling style. The film is structured as chapters, and in the first chapter itself, the director sets the context: Pakistan-backed terrorists are repeatedly involved in attacks in India, such as the IC 814 hijack and the Parliament attack. Yet, India is unable to stop these through dialogue or Aman ki Asha efforts and therefore decides to resort to covert operations. This decision follows an impactful scene inside the hijacked aircraft at Kandahar when the IB Chief shouts Bharat Mata ki, but meets with an eerie silence.<br/><br/>Ranveer Singh plays Hamza, an undercover operative planted in Pakistan to gather intelligence on its terror plans. He joins a powerful mafia gang, and until the interval, we are immersed in intergang rivalry, the politician-mafia nexus, and the ISI&#39;s scheming. These parts are quite different and feel very realistic. The first half of the film runs for two hours, and the director tries to fit too much into it. As a result, the watch feels somewhat tiring, but the second half becomes sleeker and more engaging.<br/><br/>The film scores very high on craft and making. It is, to a large extent, an action film, and the action set pieces are brilliantly executed. For example, the action sequence in the climax inside a moving car, I thought, was very well shot. Vikash Nowlakha is the cinematographer, and his work is top-notch. It seems that, except for the long shots or the drone shots, the entire film has been shot on multiple steady cams, which gives an edgy feel not just to the action sequences but even to conversational scenes. Dhar has put a lot of thought into framing of the scenes, and that shows in how the screenplay on paper has been translated to the big screen. There is a scene reminiscent of Iruvar, in which Mohanlal makes an entry into a public meeting while Prakash Raj is speaking on the dias. Here, Akshay Khanna makes that entry when Rakesh Bedi speaks, and this showcases Dhar&#39;s skills in staging an important scene.<br/><br/>Apart from the direction and technique, the other aspect that works strongly for the film is the cast. Ranveer Singh as Hamsa plays his role with a highly intense yet restrained intensity that suits the character. He has a commanding screen presence and, when necessary, emotes in a controlled way to express the pain and agony his character endures when he cannot control certain situations. The other standout performer is Akshay Khanna. He maintains a mean, menacing look throughout. In his entry scene, he appears even more menacing and gives Ranveer a tough fight in terms of presence. The supporting cast of Sanjay Dutt, Arjun Rampal, Gaurav Gera, and Rakesh Bedi all perform their roles quite competently. Madhavan appears in only a few scenes, but as the Intelligence chief playing Ajit Doval, he matches his look and persona very well. There is a love-interest thread introduced between Ranveer and Sara Arjun that seems forced, but the screenplay makes intelligent use of it later.<br/><br/>The editing could have been sharper for sure. The transitions were sometimes jagged, such as when moving from Chapter 2 to Chapter 3. Additionally, the director could have cut some of the lengthy sequences that felt a bit indulgent and risked undermining the film&#39;s pacy tone. The action sequences are excessively loud and gory. This isn&#39;t a film for the faint-hearted. The trailer clearly indicated this, so viewers should be prepared for it. However, this level of violence and noise will likely deter those who dislike seeing excessive blood on screen.<br/><br/>The film&#39;s narrative clearly reveals the makers&#39; politics. It appeals to the hypernationalistic section of the audience and doesn&#39;t attempt any monkey-balancing in the narrative. There are scenes that are propagandistic, aimed at winning over supporters of the current regime. The film goes all out to trigger a rage against Pakistan among viewers with a detailed portrayal of the country&#39;s hatred towards India. The putting out of portions of the actual audio transcripts during the 26/11 attacks is testimony to this.<br/><br/>It would have made sense to make this subject into a web series. However, the audacious ambition and scale of the project make it unviable to release solely on OTT. It required a successful theatrical run followed by OTT and satellite releases to sustain the budget. Notwithstanding the length and excessive violence, Durandhar keeps us engaged with the proceedings. If you are a fan of the spy thriller genre, Durandhar is a good watch. The film has certainly piqued interest in the sequel."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11045995/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025664",
              "author": {
                "username": {
                  "text": "prajwalshah"
                },
                "userId": "ur124762786"
              },
              "summary": {
                "originalText": "⭐ Dhurandhar - A Complete Powerhouse"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just a movie - it&#39;s an experience. From the very first frame, the film grabs you and never lets go. The scale, intensity, and ambition are on another level, reminding you why big-screen cinema still matters.<br/><br/>Dhurandhar sets a new benchmark for Indian cinema. Powerful performances, gripping direction, and an unforgettable cinematic punch make this an absolute 10/10.<br/><br/>A must-watch. A mass entertainer with substance. 💯🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025664/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11041372",
              "author": {
                "username": {
                  "text": "shivamh-66333"
                },
                "userId": "ur80033448"
              },
              "summary": {
                "originalText": "Best Bollywood movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch film, its best movie. Its story of spy. After a long time good movie from bollywood. Everyone should watch. Even though its long movie still not a single minute you will feel disconnected. Best character development. Every character is equally justified, Can&#39;t wait for 2nd part of the movie.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11041372/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016870",
              "author": {
                "username": {
                  "text": "angadsap"
                },
                "userId": "ur122180075"
              },
              "summary": {
                "originalText": "Super movie!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Such an amazing movie! It is quite long but not even once did it lose its grip on you! Amazing star cast, super acting by all, amazing character development and the soundtrack elevates this movie even further! After a long time loved an action movie, even the hard hitting scenes are done so beautifully with the soundtrack and subtle comedy built in that just makes the overall experience beautiful."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016870/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006772",
              "author": {
                "username": {
                  "text": "MahiraS-89"
                },
                "userId": "ur204482731"
              },
              "summary": {
                "originalText": "Stars Elevate Every Moment of This Ride"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film is a thrilling exploration of ambition, loyalty, and moral compromise. Ranveer Singh anchors the story with a performance that is as physically intense as it is emotionally resonant. Sanjay Dutt adds layers of authority and menace, while Akshaye Khanna and R Madhavan make every dialogue-driven moment count, giving the narrative additional complexity. Arjun Rampal&#39;s controlled intensity and Sara Arjun&#39;s heartbreaking innocence make the stakes feel immediate and real. Aditya Dhar&#39;s direction showcases a careful command of pacing and tone, blending suspenseful tension with cinematic spectacle. The action scenes are smartly choreographed and shot, emphasizing realism and consequence over flamboyance. The soundscape and editing further enhance immersion, ensuring viewers are constantly on edge. By the second half, the film escalates into a gripping crescendo, combining strategic plotting with raw emotional power, leaving a lingering impact."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006772/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015087",
              "author": {
                "username": {
                  "text": "mukult-53764"
                },
                "userId": "ur150982835"
              },
              "summary": {
                "originalText": "Must Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Guys, please support this movie, this is an slap on YRF spy Universe. What a Gripping Movie. Please forget about Ranveer&#39;s kantara controversy. Ranveer is mad outside, but in film, his performance is superb, in my opinion this movie can earn 1000cr easily, if all indians will support this movie.<br/><br/>Thank you Aditya Dhar for this excellent movie.<br/><br/>Excellent performances\nSuper music."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015087/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028719",
              "author": {
                "username": {
                  "text": "harshyadav-08206"
                },
                "userId": "ur118873488"
              },
              "summary": {
                "originalText": "Amazing movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar&#39;s Dhurandhar is a cinematic triumph! 💥 Ranveer Singh delivers a raw, explosive performance, while Akshaye Khanna is terrifyingly brilliant as the villain. The espionage drama is gritty, fast-paced, and technically flawless. A gripping tribute to unsung heroes. 10/10 Must Watch! 🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028719/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029049",
              "author": {
                "username": {
                  "text": "ayushsinha-38625"
                },
                "userId": "ur125901072"
              },
              "summary": {
                "originalText": "Dhurandar Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhundandar is a Brilliant Movie that stands tall as a powerful example of what thoughtful cinema can achieve when every department works in perfect harmony. From the very first frame, the film pulls you into its world with confidence, intent, and an unmistakable cinematic voice. It doesn&#39;t rely on shortcuts or noise; instead, it trusts its story and its craft.<br/><br/>One of the strongest pillars of Dhundandar is its great casting. Every actor feels perfectly chosen for their role, delivering performances that are natural, layered, and deeply engaging. No character feels forced or out of place, and even the smallest roles leave a lasting impression. The chemistry between the cast elevates the emotional depth of the narrative and keeps the audience invested throughout.<br/><br/>The writing deserves special praise. The screenplay is sharp, meaningful, and well-paced, balancing emotion and intensity without ever feeling heavy-handed. The dialogues feel real and purposeful, adding weight to the story rather than distracting from it. Complimenting this is the direction, which is confident and mature. The director&#39;s vision is clear in every scene, allowing moments to breathe while maintaining a steady grip on the film&#39;s rhythm.<br/><br/>Visually, the filmography is stunning. Each frame is carefully composed, using light, shadow, and movement to enhance the mood of the story. The visuals don&#39;t just look beautiful; they serve the narrative. Adding to this richness, the background music was perfect, subtly amplifying emotions and tension without overpowering the scenes.<br/><br/>Overall, Dhundandar delivers an allover cinematic experience was great, making it a film that stays with you long after the credits roll. It is immersive, impactful, and truly memorable-a must-watch for anyone who appreciates quality cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029049/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006496",
              "author": {
                "username": {
                  "text": "ruawnnsn"
                },
                "userId": "ur176953624"
              },
              "summary": {
                "originalText": "Breathless Drama with Breakneck Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film proves that great direction and great acting together can elevate a story beyond ordinary cinematic experiences.<br/><br/>Dhurandhar is a film that thrives on its characters, and the director ensures that every actor gets their moment to shine. The protagonist&#39;s performance is layered, combining intensity, vulnerability, and sharp intellect."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006496/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}