{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6rdjntazcwzy476vxfmbyrxsmoaz23uptt6hfapa7ytttfjrkydc3oe3vlnzib4duac6wdovb4wzkp4thsk573s2w4",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11047189",
              "author": {
                "username": {
                  "text": "Prakhar-99"
                },
                "userId": "ur208790177"
              },
              "summary": {
                "originalText": "Not Every Film Is for Young Eyes"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Some people believe that the film contains excessive abusive language and a significant amount of violence. For this reason, it has already been certified for adult audiences by the censor board. However, despite this, some people are still planning to watch it with children. That said, if you can ignore a certain level of violence and strong language, the film is definitely worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11047189/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024319",
              "author": {
                "username": {
                  "text": "HimansuK-29"
                },
                "userId": "ur207120451"
              },
              "summary": {
                "originalText": "GREAT STORY WITH GREAT VIOLANCE"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is top class specially casting is unmatched. After a long time i witnessed a masterpiece spy movie. Facial expression, fight scenes, romantic moments, thriller scenes all are the best. . I just wanna say if you really want to enjoy a great movie then you should go for it. Action was amazing and acting was masterpiece. One of the best Bollywood movie 🍿"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024319/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011000",
              "author": {
                "username": {
                  "text": "Shashi-609"
                },
                "userId": "ur210663643"
              },
              "summary": {
                "originalText": "7.42 PM"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Nice app. Imbd to the right 👍 of the same but I tuu to you and the best of the same but I am not 🚭 to you too dear frie. Nd earn money from my account no reel is very nice app for me and my friends are you Chetan dog a lot of the same but I am not able to join the meeting today and tomorrow I willoo."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011000/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006508",
              "author": {
                "username": {
                  "text": "imdbfan-5891177152"
                },
                "userId": "ur199122427"
              },
              "summary": {
                "originalText": "The Spectacle You Cannot Miss"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film is a thrilling exploration of morality, loyalty, and the high stakes of covert operations. Ranveer Singh leads with intensity, giving a layered, introspective performance. Director Dhar expertly balances narrative complexity with visceral action, allowing audiences to feel the weight of every choice. Supporting actors enhance the story, adding texture and depth to the underworld setting. Cinematography captures both the elegance and brutality of the world depicted, creating a visually and emotionally gripping experience."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006508/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007538",
              "author": {
                "username": {
                  "text": "Utkarsh-922"
                },
                "userId": "ur211548997"
              },
              "summary": {
                "originalText": "Fantastic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Fantastic movie... exposing the terror funder nation...and mentality of pyscopaths...also showed pre 2014 era..and I don&#39;t think any thing is off the mark... absolutely fantastic... refering everyone to watch this masterpiece...inshort bolu to absolute cinema...3 hr 32 min but keeps you connected and full of entertainment."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007538/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006739",
              "author": {
                "username": {
                  "text": "ribhisundar"
                },
                "userId": "ur151424303"
              },
              "summary": {
                "originalText": "Drama That Keeps You Hooked"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses viewers into a meticulously crafted underworld where danger lurks in every corner. Ranveer Singh delivers a breathtaking performance, portraying Hamza&#39;s inner conflict with subtle glances, bursts of restrained fury, and moments of emotional vulnerability that make him instantly relatable. Sanjay Dutt&#39;s presence is magnetic, commanding authority in boardroom confrontations and menacing every street-level interaction. Akshaye Khanna and R Madhavan bring layered sophistication, making even their brief appearances memorable, while Arjun Rampal&#39;s quiet menace adds constant tension. Sara Arjun&#39;s innocence heightens stakes, her scenes providing emotional counterpoints to the adult chaos around her. Aditya Dhar&#39;s direction seamlessly balances intimate character moments with explosive set pieces. The cinematography captures Karachi&#39;s chaos in rich detail, and the score accentuates every heartbeat, from whispered negotiations to adrenaline-charged chases. By the second half, the stakes escalate, culminating in a finale that is as shocking as it is emotionally resonant, leaving audiences stunned and exhilarated."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006739/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013854",
              "author": {
                "username": {
                  "text": "abnp-68860"
                },
                "userId": "ur151021122"
              },
              "summary": {
                "originalText": "Best movie I ever watched"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I like very less movies &amp; trust me I loved this movie. I love the scenes, I love how facts are added into movie: row &amp; truth. Love it. I love everyone&#39;s performance &amp; a reality. Love the music, Love the characters, Love the way it presented &amp; the facts. Literally Lived it &amp; i will watch it once more."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013854/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013984",
              "author": {
                "username": {
                  "text": "chhetribinay"
                },
                "userId": "ur155772702"
              },
              "summary": {
                "originalText": "A Cinematic Masterpiece Like Never Before!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "No film in the history of Indian cinema has ever sparked such a monumental sensation. This movie is a masterpiece of direction, acting, cinematography, and visuals that captivate from start to finish. On the big screen, every scene bursts with energy, emotion, and breathtaking artistry, creating an immersive experience that sends chills down your spine. The stellar performances and stunning visuals come together perfectly, making this a truly unforgettable cinematic event. Don&#39;t miss the chance to witness this extraordinary journey!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013984/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013852",
              "author": {
                "username": {
                  "text": "aashishgundewar"
                },
                "userId": "ur150726071"
              },
              "summary": {
                "originalText": "Must Watch - Cultish Spy Universe!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&#39;Dhurandhar&#39; Movie Review: This is the Spy Universe We Deserve!<br/><br/>This is how Bollywood should make the spy-universe. Not that RAW + ISI love affair ultra boring story should be directed. Dhurandhar is a fresh breather as far as covert ops is concerned. What a movie, everybody has played their part with utmost sincerity.<br/><br/>From the gritty, unfiltered world-building to the calculated, non-stop tension, director Aditya Dhar delivers a sprawling, muscular espionage thriller that stays firmly rooted in the mechanics of a black-ops mission. Unlike predecessors that relied on over-the-top glamour, Dhurandhar pulls you into a dangerously believable underworld that feels textured and real.<br/><br/>Stellar Performances That Electrify<br/><br/>The film belongs not just to its lead, but to a powerful ensemble where every key player is a masterstroke:<br/><br/>Akshaye Khanna - as Rehman Dakait was splendid! His performance is a sheer masterclass in simmering intensity. His silences scream, and his presence is so magnetic that he arguably steals every scene he&#39;s in.<br/><br/>Arjun Rampal - as Major Iqbal was magnificent! He adds steel and authenticity to his role, delivering a performance that is both commanding and deeply convincing.<br/><br/>Sanjay Dutt - As SP Ch Aslam was stupendous! Dutt brings a necessary weight and gravitas to the proceedings, rounding out the high-stakes political drama.<br/><br/>Rakesh Bedi - as Nabeel Gabol was refreshing! He&#39;s a revelation, breezing in with unexpected humor and a performance nobody saw coming, proving his versatility.<br/><br/>Ranveer Singh - RAW Spy was super calm/composed! This is Ranveer in a new, layered, and restrained avatar, playing the character Hamza with a focus and conviction that is truly impressive.<br/><br/>Music, Screenplay, Story, Cinematography is Top Class."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013852/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006874",
              "author": {
                "username": {
                  "text": "revr-86022"
                },
                "userId": "ur151423742"
              },
              "summary": {
                "originalText": "Non-Stop Drama and Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative gradually tightens its grip, immersing audiences in a morally complex underworld. Ranveer Singh anchors the film with a multi-layered performance, his expressions conveying both internal conflict and relentless drive. Sanjay Dutt exudes authority and menace, while Akshaye Khanna and R Madhavan provide depth and nuance to their supporting roles. Arjun Rampal&#39;s quiet intimidation keeps viewers on edge, and Sara Arjun&#39;s emotional moments give the story heart. Aditya Dhar&#39;s direction expertly fuses suspenseful plotting, high-stakes action, and character development. Cinematography captures chaos, tension, and intimate moments with equal precision. By the climax, the film delivers both thrilling spectacle and emotional resonance, leaving a lasting cinematic impression."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006874/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007234",
              "author": {
                "username": {
                  "text": "sonimihir-27184"
                },
                "userId": "ur123191624"
              },
              "summary": {
                "originalText": "High-Octane Action Meets Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening scene, the film establishes an atmosphere thick with tension and moral ambiguity. Ranveer Singh anchors the story, navigating a maze of personal dilemmas, strategic choices, and high-stakes confrontations, delivering a performance that is both subtle and visceral. Sanjay Dutt brings unmatched gravitas, portraying a figure whose authority and unpredictability make every interaction electrifying. Akshaye Khanna and R Madhavan&#39;s nuanced performances provide a cerebral counterbalance, while Arjun Rampal&#39;s quiet menace underscores the ever-present threat in this dangerous world. Sara Arjun&#39;s emotionally charged scenes highlight the human consequences of power struggles. Under Aditya Dhar&#39;s direction, action sequences-ranging from meticulously choreographed combat to tense urban pursuits-are as grounded as they are thrilling. The cinematography juxtaposes sprawling cityscapes with intimate interior shots, immersing the viewer fully in the narrative. The musical score punctuates tension and heightens emotional beats, culminating in a climax that delivers both narrative payoff and adrenaline-fueled spectacle."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007234/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11050640",
              "author": {
                "username": {
                  "text": "souravsenrpm"
                },
                "userId": "ur190791621"
              },
              "summary": {
                "originalText": "\"EXCEPTIONAL WELL ESPIONAGE THRILLER\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "THE MOVIE &quot;DHURENDHAR&quot; DIRECTED,PRODUCED AND WRITTEN BY ADITYA DHAR WITH MULTI-STAR CAST LIKE SUNJAY DUTT,RANVEER SINGH, AKSHAY KHANNA,ARJUN RAMPAL ,R MADHAVAN AND OTHER SIDE CAST. THIS MOVIE IS A WORK OF FICTION BY USING REAL LIFE EVENTS. TIME DURATION OF 3.5 HOURS BUT SUCH INTENSE, FANTASTIC AND FULL PAISA 🤑🤑💰💰 WASUL MOVIE UNLIKE THE YRF SPY UNIVERSE MOVIE LIKE TIGER FRANCHISE,PATHAN AND WAR FRANCHISE, THIS MOVIE SHOWN THE REAL SACRIFICE OF INDIAN SPY WHO DOESN&#39;T SHOW ABS OR DO STUNT IN HELICOPTER BUT TAKE SERIOUS TRAINING AND BECOME A KILLING MACHINE AGAINST ENEMIES. THE ACTION,DIALOGUE AND EVERY SCENE WAS REALISTIC IN NATURE AND DOESN&#39;T TREAT AUDIENCE AS DUMB AND FOOLISH."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-24",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11050640/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012293",
              "author": {
                "username": {
                  "text": "himanshu-rai"
                },
                "userId": "ur58305938"
              },
              "summary": {
                "originalText": "A landmark for Spy action And Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "3.5 hours flew past in a flash..I enjoyed it and going to watch it second time ..never did this in life before..just want to enjoy the bgm once more in a theatre set-up.. BGM , DIRECTION ACTING STORY PACE all is top notch ...If you end is rushed like me you will realize later on that it was the need of the script..no cheap dialogues..no objectifying woman..just pure enjoyment..go and watch it cinema..it&#39;s a well worth and lifetime experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012293/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011677",
              "author": {
                "username": {
                  "text": "adityadadheech-89389"
                },
                "userId": "ur136350132"
              },
              "summary": {
                "originalText": "Never expected this from Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is crazy, it is so much interesting that you can&#39;t get bored for single Minute hat&#39;s off to Ranveer Singh&#39;s acting. Akshay Khanna&#39;s aura was on different level no one can match that. The bgm, actions, story, cast, acting all were lit. The songs are keep on repeating in my head they were too good and editing was literally amazing."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011677/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008512",
              "author": {
                "username": {
                  "text": "spjek"
                },
                "userId": "ur6122231"
              },
              "summary": {
                "originalText": "A Brutal, Realistic, Gripping Genre Redefining Spy Action Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "In the current era of the faltering, synthetic flavored Spy Universes where style matters more than substance, Dhurandhar injects a much needed dose of grittyness and realism enhanced by a strong story, nuanced characters and powerful performances. The movie is indeed Brutal in parts, full of expletives and not an easy watch but thats what makes it real. Do note that a lot of the gore and action from the teaser and trailer are not in this part of the saga. Aditya Dhar has done a great job creating an authentic spy world which is based on real life characters and incidents and sprinkled it with heavy dose of masala to augment the flavors and experience. He gets it right by focusing on things that matter for good cinema - start with a good relatable story, then add well written characters with strong arcs, cast the right actors, give them the reins to bring their characters to life and then take no short cuts to deliver the vision.<br/><br/>Dhar starts with a premise that we have all seen and experienced over the last few decades and makes it relatable for his target audience by splicing in images and videos of the real life attacks that lead to the inception of the Dhurandhar project. He very smartly breaks the movie into multiple tightly written and executed chapters which is one of the reasons the movie even at a really really long run time of 3 and a half hours is highly engaging and entertaining. Almost every scene, character, dialog is an essential part of the screenplay and important in taking the story forward and making the long run time gripping without losing its target audience. The real star of Dhurandhar is Aditya Dhar for creating and delivering on his vision.<br/><br/>Then comes the characters and the actors who inhabit them on the screen. The movie&#39;s main protagonist -Hamza Ali Mazari AKA Jaskirat Singh Rangi played brilliantly by Ranveer Singh is the Indian Agent infiltrating the underworld of Lyari area in Karachi which Dhar created in a real location in Thailand instead of in a studio or infont of green screens. Ranveer may have invoked the character of Hamza in part from Gully Boy&#39;s Murad and in part from Padmaavat&#39;s Khilji but the final result is an effective character of a troubled, skilled, smart, dangerous patriot on a mission. The force behind the creation of Dhurandhar&#39;s spy is Ajay Sanyal, the director of the Intelligence Bureau, a character that has truly been inhabited and brought to life by an exceptional Madhavan.<br/><br/>If a story&#39;s protagonist is as good as the antagonist then we are heading in for a treat to the other side with a buffet of well writen and enacted group of adversaries with real depth and character. The brightest of them all is Rehman Dakait, a role in which Akshaye Khanna literally becomes the much feared and notorious real life gangster. Akshaye Khanna gives such depth to the character that one can see both the human and the devil that resides within. Akshaye&#39;s Rehman Dakait is one of the highlights of Dhurandhar&#39;s first part and one of the main reasons to go on this 3 and a half hour journey through the streets of Lyari. Arjun Rampal&#39;s Major Iqbal takes evil and brutality to a completely new level and with the limited screen time in this part, he is only warming up. In this part, Rampal has shown the potential to create a villain for the ages, so hoping that with Part 2 he can unleash the real devil.<br/><br/>A special mention to Rakesh Bedi who has done a great job in creating the slimy and evil politician Jameel Jamali in what is not only his longest role in a mainstream movie but one that not only parallels but far exceeds his funny supporting roles of Chashme Buddoor and Yeh Jo Hai Zindagi. Sanjay Dutt as SP Chaudhary Aslam is good but is missing the edge, intensity and cut throatedness that one would expect from a character with the nickname, &quot;The Jinn&quot;. Rest of the cast is good in their respective roles with Danish Pandor as Uzair Baloch and Naveen Kaushik as Donga standing out as Rehman Dakait&#39;s faithful gang members. Sara Arjun is decent in a small role which has been set up appropriately, lesser as a romantic interest and more as an important step in the mission.<br/><br/>The real location, the gritty action sequences, the gut wrenching visceral beatings and torture scenes are further augmented by its eclectic background score. The movie doesnt get distracted much by unnecessary songs. Arijit&#39;s Gehra Hua is a pleasant break from the movie&#39;s ever growing tension. Shararat is a bit of a sub-par song that was not needed in the movie but it is easily forgiven because of the spectacular background songs like Hanumankind&#39;s title track and Ez-Ez along with the multiple old Bollywood classics splattered through the movie.<br/><br/>If you were looking forward to watch the movie after experiencing its hyperviolent and gory teaser and trailer, then you are its target audience and will not be disappointed. Overall the movie is extremely gripping and well made with brilliant performances and very good direction. It is long but not boring. It is brutal and gory but not at the level expected. It is not an easy watch but almost a must watch. Overall it is highly entertaining. I really enjoyed it and cant wait for Part 2 on March 19th when the real action will get unleashed, the true evil of some the characters will come forth, a peak will get provided into the protagonist&#39;s troubled past, a big character reveal may take the tension to the next level and real chaos will descend on the world of Dhurandhar. 8/10."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008512/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028806",
              "author": {
                "username": {
                  "text": "edwindenis"
                },
                "userId": "ur135886760"
              },
              "summary": {
                "originalText": "Dhurandhar Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Accurately exposed the terror nexus of Pakistan in a realistic manner unlike typical Bollywood films showing love story between a Pakistani and an Indian spy. No unnecessary vulgarity or Bollywood masala. The film was worth the hype. It gave tributes to all our undercover agents across Pakistan who risk their lives for our safety by living among the terrorists without any external protection."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028806/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013714",
              "author": {
                "username": {
                  "text": "NishitaG-52"
                },
                "userId": "ur211591471"
              },
              "summary": {
                "originalText": "Worth Watch!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must-watch! This movie brilliantly blends reality with entertainment through stunning cinematography, soulful music, and powerful performances. If you&#39;re looking for a film that captivates and resonates, go for it!<br/><br/>Excitedly waiting for Part 2!<br/><br/>PS: You won&#39;t feel if it was indeed 3.5 hours watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013714/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013063",
              "author": {
                "username": {
                  "text": "SaranshW"
                },
                "userId": "ur204077581"
              },
              "summary": {
                "originalText": "Outstanding cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I&#39;m not a big fan of bollywood but movies like this trembles my opinion which i like a lot, this movie is like a real spy political thriller after madras cafe and much more than that its the first bollywood movie where there&#39;s no hero and villain there are protagonists and antagonists cause everyone&#39;s performance is superb especially Akshay Khanna&#39;s mind blowing screen presence. Overall\nCinematography- 9/10\nStory telling - 9.5/10\nActing/ Screen presence - 10/10\nTimeframe - 8/10\nAction scenes - 9/10\nDirection/ Editing- 10/10\nIf you are a fan of thriller/action or should i say if you are Indian you should definitely watch it because its based on true story of consequent terrorism over the years in India and gradual development of political change/ paralyses in pakistan."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013063/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006405",
              "author": {
                "username": {
                  "text": "knewyxxy"
                },
                "userId": "ur175103880"
              },
              "summary": {
                "originalText": "A Thunderstorm of Action and Emotion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening scene, the story grips you with its carefully paced tension and layered conflicts. Ranveer Singh carries the narrative with effortless charisma, navigating a labyrinth of crime, loyalty, and betrayal. The director&#39;s vision transforms familiar tropes into something startlingly fresh, while supporting actors deliver memorable performances that enrich the plot. Action sequences are explosive yet grounded, and the score subtly heightens suspense, ensuring that every moment feels consequential."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006405/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022377",
              "author": {
                "username": {
                  "text": "sachanutkarsh"
                },
                "userId": "ur132652987"
              },
              "summary": {
                "originalText": "This is new INDIA cinema."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ruly a fantastic spy movie, this film stands out as an authentic and realistic portrayal of the espionage world. Unlike many mainstream Bollywood spy thrillers that depend on glamour, exaggerated action, or unnecessary romantic subplots, this movie stays focused on the true nature of intelligence operations. It presents espionage as a world of strategy, risk, and discipline rather than flashy heroics.<br/><br/>What makes this film rare and refreshing is its commitment to realism. The story highlights intelligence gathering, surveillance, covert planning, and the psychological pressure faced by operatives. The characters feel grounded and believable, driven by duty and national interest instead of personal drama. This realism adds depth and credibility, making the narrative more engaging.<br/><br/>Another strong point is the absence of forced romance. The film avoids the typical Bollywood formula where a love story distracts from the core plot. This allows the storyline to remain tight and impactful. It also refrains from romanticizing geopolitics, particularly the portrayal of Pakistan, which is often softened or idealized in many films. Instead, the movie maintains a pragmatic and serious tone, reflecting the harsh realities of international intelligence and national security.<br/><br/>The direction and screenplay are crisp, with sharp dialogues and well-paced scenes that sustain tension throughout. Performances are restrained and effective, enhancing the authenticity of the story. Overall, this film is a rare and commendable Bollywood spy movie that respects the intelligence of its audience and delivers a grounded, mature, and honest depiction of the spy world."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022377/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018389",
              "author": {
                "username": {
                  "text": "DeepanshuS-05"
                },
                "userId": "ur211627141"
              },
              "summary": {
                "originalText": "About movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhorander is a surprisingly refreshing and engaging film that blends emotion, intensity, and strong storytelling in a way that keeps you hooked from beginning to end. What truly stands out is the gripping narrative, which slowly pulls you into the world of the characters and makes you genuinely care about what happens to them.<br/><br/>The performances are excellent-each actor brings authenticity and depth to their role. The lead delivers a powerful portrayal, effortlessly balancing emotional vulnerability with inner strength. Supporting actors also shine, adding realism and texture to every scene."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018389/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023849",
              "author": {
                "username": {
                  "text": "ArjunN-00"
                },
                "userId": "ur209072678"
              },
              "summary": {
                "originalText": "Dhurandhar - My take"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just walked out of Dhurandhar and honestly... what a ride.<br/><br/>Went in expecting a loud mass entertainer and got a solid adrenaline rush instead. The film keeps a tight grip from the start, with moments that genuinely get your pulse going, even if a few stretches feel familiar.<br/><br/>The lead cast absolutely commit - performances feel intense without going overboard, and the supporting actors pull their weight well. You can tell the director knew exactly what tone they were chasing, and for the most part, the execution lands. Action blocks are punchy, well-shot, and staged with confidence, while the background score does a lot of heavy lifting in elevating key scenes.<br/><br/>That said, the film doesn&#39;t try to reinvent the wheel. A couple of plot beats are predictable, and some emotional moments could&#39;ve breathed a bit more. Still, the overall experience stays engaging, and the pacing rarely drops enough to lose you.<br/><br/>Bottom line: Dhurandhar is a crowd-pleasing, high-energy watch that delivers on intensity and performance. Not perfect, but definitely worth the ticket if you&#39;re in the mood for a proper big-screen rush."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023849/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010559",
              "author": {
                "username": {
                  "text": "Sadad-98"
                },
                "userId": "ur210664651"
              },
              "summary": {
                "originalText": "Good"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Good with. Great service, thanks for helping me find my partnerring kiwi box silver cycle topic feature combine any summer spirit rule salt wire fold goose run whisper quit satisfy faith blossom credit blush. The robust security for my Diners Club card payment gave me confidence in using a premium card on this platform without worry."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010559/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031956",
              "author": {
                "username": {
                  "text": "paruljangra"
                },
                "userId": "ur72684884"
              },
              "summary": {
                "originalText": "OMF"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just like R. Madhavan said, after Dhurandhar&#39;s releases, it&#39;ll create a whole new genre in Bollywood. Brilliant film with powerful and lasting impact. Waiting eagerly for Part 2. Aditya Dhar, you&#39;ve truly created a masterpiece and history. This one sets the bar too high.<br/><br/>Bhai kya crazyyyyy movie bnayi hai."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031956/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016812",
              "author": {
                "username": {
                  "text": "SoshalM"
                },
                "userId": "ur211614909"
              },
              "summary": {
                "originalText": "Greatest movie ever made 🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "100/10\nGreatest movie.<br/><br/>Most Engaging 3.5hr movie ever made 🔥\nAll of the section of movie are completely killed. Entries, Story, Screenplay and Music wowww🔥🔥<br/><br/>Very interesting film and greatest bollywood ever made.<br/><br/>Music department work brilliant. Specially the mix-up of old-new musics. All characters are killed the way 🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016812/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}