{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4sofermtizcszqf7suhrmzyrtsmmcjy3imdz67idpj3qflanes22bkzoa2u7w67egjoykfnhnencypz4x4r5uqe",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11014360",
              "author": {
                "username": {
                  "text": "itsappy"
                },
                "userId": "ur98795318"
              },
              "summary": {
                "originalText": "This movie saved Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is hands down the best film of 2025-no competition, no debate. I watched it last week, and I&#39;m already planning to watch it again because it deserves multiple viewings. It&#39;s one of those rare films that pulls you in from the very first scene and doesn&#39;t let go until the credits roll. Every moment feels intentional, every frame feels crafted, and every emotion hits exactly where it should.( This is chat gpt because had to reach 300 word limit)<br/><br/>Yes, the tickets were a little pricey-but honestly, bro, anything for a good movie. When a film is this good, you don&#39;t think twice before booking the best seats you can find. And trust me, this is not the kind of movie you casually wait to watch at home. This is a pure theatre experience, the kind that reminds you why cinemas exist in the first place. The visuals, the sound, the atmosphere-none of it will feel the same on a smaller screen.<br/><br/>People keep saying, &quot;I&#39;ll just wait for the OTT release,&quot; but let me warn you right now: you&#39;ll regret it big time. This movie was clearly made for the big screen. The energy in the theatre, the reactions from the audience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 10,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014360/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005244",
              "author": {
                "username": {
                  "text": "ShambhaviG-9"
                },
                "userId": "ur211538825"
              },
              "summary": {
                "originalText": "A Power-Packed Thriller That Hits Every Nerve"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I walked into Dhurandhar without even watching the trailer -only drawn by the song &quot;Jogi&quot; - and I walked out stunned. This film is a masterclass in how to blend action, politics, intelligence operations and raw human conflict into one explosive narrative.<br/><br/>Akshaye Khanna delivers one of his most charming yet chilling performances. His character makes you hate him for what he does, yet somehow you never want to see him fall - that&#39;s how compelling he is. Ranveer Singh, Sanjay Dutt and Arjun Rampal match that energy with equal intensity, giving the story a solid ensemble base where every character matters.<br/><br/>What really sets the movie apart is how deeply it dives into the silent suffering of a spy - the years spent undercover, the lost identity, the isolation. The plot doesn&#39;t shy away from the ugly truths: gore, betrayal, political manipulation, and the weight of patriotism. Every scene feels earned, every twist hits hard.<br/><br/>Dhurandhar proves that a commercial thriller can still have a beating heart and heavy emotional stakes. If you&#39;re looking for a film that keeps you conflicted - rooting for monsters yet understanding their pain - this is one you shouldn&#39;t miss.<br/><br/>A gripping and unexpectedly impactful watch. Highly recommended."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 13,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005244/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006094",
              "author": {
                "username": {
                  "text": "harishnj"
                },
                "userId": "ur62746524"
              },
              "summary": {
                "originalText": "A Stunning Star Showcase Driven by Terrific Performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; (2025) is a truly stunning cinematic experience, succeeding on the strength of its ambitious vision and the phenomenal acting of its leading men. The film is elevated by the presence of Ranveer Singh, who delivers a great performance, and the sheer excellence of Akshaye Khanna, who is simply terrific in his role.<br/><br/>The film&#39;s stunning quality is evident in its production design and execution, suggesting a visually rich and high-energy production that pulls the viewer into its world. The dual star power of the leads is a major asset, with Akshaye Khanna&#39;s terrific presence providing the perfect counterpoint to Ranveer Singh&#39;s great energy.<br/><br/>However, the film&#39;s high quality is tempered slightly by a &quot;little bit of uneven pacing.&quot; This suggests that while individual scenes and performances are brilliant, the flow of the narrative occasionally falters, perhaps slowing down during exposition or rushing through necessary developments. This minor flaw, though present, is ultimately overshadowed by the spectacle and the powerful acting.<br/><br/>Overall, &quot;Dhurandhar&quot; is a cinematic triumph anchored by two powerhouse performances. It&#39;s a visually stunning and thoroughly engaging film that is a must-watch for its stars and high production values."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 13,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006094/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001676",
              "author": {
                "username": {
                  "text": "SufiS-2"
                },
                "userId": "ur211516022"
              },
              "summary": {
                "originalText": "Great to Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Overall movie was great to watch, this is what we expect from a spy movie not like those of Spy universe. This movie felt more like a webseries than a movie. Drama is the main USP I feel so, more than the Action too... the drama was very good. But but... talking about the negatives... this movie uses SOME of those typical elements that we often see in other Typical Indian Spy movies, also that typical Bollywood mark was somewhat there in it. Lastly, I would keep this in the &quot;Go for it&quot; category. #MOC."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001676/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001265",
              "author": {
                "username": {
                  "text": "ala-sivanand"
                },
                "userId": "ur38995350"
              },
              "summary": {
                "originalText": "Akshay Khanna Shines While the Script Lags"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a mixed bag-a watchable drama lifted by powerhouse performances by Akshay Khanna and Arjun Rampal, but ultimately weighed down by pacing issues, a one-sided narrative, underwritten characters, and needlessly brutal violence. Ranveer&#39;s acting is also a letdown. Apart from a single emotional scene where he breaks down, his performance remains monotonous and fails to bring depth to his character. Watch it for Akshay Khanna&#39;s stellar acting, but temper your expectations regarding rest."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 8,
                "downVotes": 27
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001265/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006197",
              "author": {
                "username": {
                  "text": "shantanuvikramsingh"
                },
                "userId": "ur151993742"
              },
              "summary": {
                "originalText": "A Gritty, Real & Legit Spy Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is easily one of the most gripping films to come out in recent times. The story is raw, gritty and grounded, with dialogues and scenes that hit hard and stay with you long after you leave the theatre. It&#39;s safe to say this is one of the first legit spy films made with such conviction and attention to detail.<br/><br/>One of the most powerful moments in the film is hearing the real conversation from the Mumbai attack displayed on the red screen - it&#39;s chilling, painful and extremely impactful. It instantly pulls you into the emotional weight of the narrative.<br/><br/>The performances are outstanding across the board. Every actor delivers with such honesty that you forget you&#39;re watching a film. Special praise to the director for the bold storytelling and tight execution. The music team also deserves credit the score enhances every tense moment without overpowering the story.<br/><br/>Dhurandhar is intense, brave and brilliantly crafted. A must-watch for anyone who appreciates strong filmmaking and meaningful cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 8,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006197/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006417",
              "author": {
                "username": {
                  "text": "j-99263"
                },
                "userId": "ur189344763"
              },
              "summary": {
                "originalText": "A Big-Screen Explosion of Star Power"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the very beginning, the film immerses the audience in a tense, high-stakes world. The protagonist delivers a performance of striking depth, embodying both strategic brilliance and moral struggle. Action sequences are relentless yet purposeful, integrating seamlessly with narrative developments. Supporting characters are engaging and complex, each with distinct motivations that enrich the story. Visual storytelling captures both vast landscapes and intimate tension-filled moments, while the score amplifies suspense without overwhelming it. Political undertones and realistic underworld dynamics ground the story, enhancing authenticity. The pacing expertly balances slow-burn tension with explosive payoffs. By the climax, emotional and adrenaline peaks converge, leaving an unforgettable impact of cinematic excellence."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 15,
                "downVotes": 7
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006417/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007032",
              "author": {
                "username": {
                  "text": "kumarpravinpk-97620"
                },
                "userId": "ur118089702"
              },
              "summary": {
                "originalText": "Emotional Drama Meets High-Octane Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is meticulous, slowly revealing layers of intrigue, danger, and emotion. Ranveer Singh is captivating, portraying both internal conflict and physical courage with finesse. Sanjay Dutt adds gravitas and presence, while Akshaye Khanna and R Madhavan ensure the supporting cast is as compelling as the leads. Arjun Rampal&#39;s intensity contrasts with Sara Arjun&#39;s innocence, making the narrative emotionally resonant. Aditya Dhar&#39;s direction harmonizes action with tension and character development. The cinematography captures both grandeur and subtlety, while the score heightens suspense. By the climax, the film leaves a lasting impact with its combination of thrills and emotional depth."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 16,
                "downVotes": 8
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007032/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007205",
              "author": {
                "username": {
                  "text": "jaspritk-57534"
                },
                "userId": "ur118093892"
              },
              "summary": {
                "originalText": "Heart-Pounding Action and Strong Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative unfolds with careful pacing, building suspense, action, and emotional stakes simultaneously. Ranveer Singh delivers an intense and nuanced performance, capturing moral conflict and strategic calculation with equal skill. Sanjay Dutt brings gravitas, menace, and authority, dominating key scenes. Akshaye Khanna and R Madhavan enhance the ensemble with subtle, intelligent performances. Arjun Rampal&#39;s quiet menace maintains tension, and Sara Arjun&#39;s emotional authenticity heightens the stakes. Aditya Dhar directs with mastery, orchestrating suspense, drama, and action seamlessly. Cinematography captures both expansive cityscapes and intimate moments, while the score punctuates tension. By the finale, the story delivers a gripping, emotionally resonant payoff."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 15,
                "downVotes": 8
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007205/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007112",
              "author": {
                "username": {
                  "text": "guptapalash"
                },
                "userId": "ur115069528"
              },
              "summary": {
                "originalText": "Emotions, Thrills, and Big Screen Magic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s structure allows tension to build naturally, culminating in a high-stakes finale. Ranveer Singh delivers a layered, intense performance, capturing both vulnerability and determination. Sanjay Dutt commands presence and authority, while Akshaye Khanna and R Madhavan contribute subtle, intelligent performances. Arjun Rampal&#39;s quiet menace elevates suspense, and Sara Arjun&#39;s poignant moments provide the story&#39;s emotional core. Aditya Dhar blends complex plotting with visually stunning action sequences. Cinematography captures expansive chaos and intimate moments, and the score enhances suspense. By the second half, the narrative escalates into thrilling action and emotional resonance."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 15,
                "downVotes": 8
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007112/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006586",
              "author": {
                "username": {
                  "text": "mrtanmaya"
                },
                "userId": "ur174802350"
              },
              "summary": {
                "originalText": "Action Moments That Steal the Show"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative grips you from the very first frame, unfolding layers of strategy, betrayal, and raw human emotion with surgical precision. Ranveer Singh&#39;s dedication to the role is evident in every gesture, conveying fear, courage, and calculation seamlessly. Dhar&#39;s direction ensures that action and emotional depth coexist, never feeling forced or superficial. Cinematic framing and lighting highlight the tension in both public and private spaces, creating a palpable sense of danger. The supporting cast excels, particularly in scenes that explore loyalty and ambition. The editing maintains clarity amidst complexity, and the film&#39;s political undertones resonate strongly with current realities, making it feel timely and relevant."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 16,
                "downVotes": 9
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006586/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006404",
              "author": {
                "username": {
                  "text": "dtrisha-19349"
                },
                "userId": "ur188394055"
              },
              "summary": {
                "originalText": "A Thrilling Experience You Feel, Not Just Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Chaos and strategy are masterfully intertwined throughout the film, keeping viewers on edge from start to finish. The protagonist delivers a riveting performance, blending charisma, fear, and determination seamlessly. Fight scenes and action sequences are expertly choreographed, providing both spectacle and narrative progression. Secondary characters leave memorable impressions, making every interaction feel consequential. Cinematography and visual storytelling are a treat, capturing expansive set pieces and intimate, tension-filled moments alike. Sound design and score heighten the drama, ensuring that suspense is palpable. The screenplay&#39;s intricacy ensures that even minor details resonate in the climax. Political and criminal undertones lend realism to the story, enhancing its emotional stakes. By the finale, the film achieves a perfect balance of exhilaration and emotional resonance, leaving viewers both breathless and reflective."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 16,
                "downVotes": 9
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006404/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006439",
              "author": {
                "username": {
                  "text": "itskabir-35992"
                },
                "userId": "ur188288241"
              },
              "summary": {
                "originalText": "A Blockbuster Saga Full of Punch and Passion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene is crafted to maintain tension, delivering both emotional depth and kinetic action. The lead actor shines, navigating complex emotions and intense physical sequences with equal skill. Action choreography is precise and impactful, making every fight a narrative moment rather than mere spectacle. Supporting characters are compelling, providing narrative richness and unexpected depth. Visuals are striking, capturing both grandeur and subtle human emotion. The score underscores drama and suspense without overshadowing it. The plot&#39;s mix of political intrigue, personal stakes, and criminal undertones creates a gripping world. By the finale, every narrative thread converges in a satisfying crescendo of action, emotion, and cinematic brilliance."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 16,
                "downVotes": 9
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006439/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11037596",
              "author": {
                "username": {
                  "text": "vivekmishra-79206"
                },
                "userId": "ur177938399"
              },
              "summary": {
                "originalText": "Something New in Hindi cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I liked the movie which have actually like black Friday meets gangs of Wasseypur. The screenplay is not great but smartly written. The screenplay structure is very new as compared to other hindi releases nowadays it&#39;s not completely action but have really good drama which will engage the audience throughout. Aditya Dhar knows what he is doing as a director and completely in control of his direction with help of superb performance by akshaye khanna. They have not shown full potential of Ranveer in this part but i know he will explode in the next one and it&#39;s a request to bollywood don&#39;t forget to give work to Shashwat Sachdev this guy can do what Anirudh is doing in south exceptional soundtrack by him."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11037596/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11074163",
              "author": {
                "username": {
                  "text": "shriram-karpur"
                },
                "userId": "ur11017632"
              },
              "summary": {
                "originalText": "A Shallow Attempt at Patriotism That Misses the Mark"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "While Indian cinema has recently seen a surge in high-quality, impactful patriotic films, every successful trend eventually produces imitators. This latest release is a prime example of a film attempting to capitalize on the &quot;patriotic mindset&quot; of the audience without putting in the necessary work on script, logic, or direction.<br/><br/>The Plot: Familiar Territory\nThe core premise is one we&#39;ve seen before: internal power struggles between rival Pakistani gangs serving as a front for the ISI. The narrative suggests that the Pakistani government uses these criminal skirmishes as a &quot;deniable&quot; way to funnel arms and ammunition into India to fuel terrorism. While the geo-political concept had potential, the execution turns it into a messy, confusing gang war rather than a taut political thriller.<br/><br/>The &quot;Faltu&quot; Factor\nThe film fails significantly in three major areas:<br/><br/>Dialogue Writing: The lines are uninspired and &quot;faltu,&quot; lacking the gravitas or sharp wit found in the modern classics it tries to emulate.<br/><br/>The Music: The songs feel forced, breaking the momentum of a story that was already struggling to stay afloat.<br/><br/>The Action: This is perhaps the film&#39;s greatest sin. In an era where audiences appreciate the grounded realism of movies like Sam Bahadur, this film opts for ridiculous, gravity-defying stunts that feel decades out of date.<br/><br/>The Final Verdict: Save Your Head\nThe biggest disappointment lies in the final act. After a build-up of &quot;hoo-haa&quot; and hype, the movie culminates in a 25-minute fight sequence that is so unrealistic and loud it becomes physically draining. It lacks the emotional weight of Bajirao Mastani or the raw honesty of The Kerala Story.<br/><br/>Conclusion: If you decide to watch this for the plot, do yourself a favor and turn it off for the last 25 minutes. You&#39;ll save yourself a headache and some valuable time. Compared to the high-quality patriotic films of recent years, this one is a hollow imitation that prioritizes noise over nuance."
                }
              },
              "authorRating": 4,
              "submissionDate": "2025-12-30",
              "helpfulness": {
                "upVotes": 8,
                "downVotes": 27
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11074163/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006847",
              "author": {
                "username": {
                  "text": "ankitqu"
                },
                "userId": "ur166745883"
              },
              "summary": {
                "originalText": "Emotional Depth with electrifying Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is a film that thrives on contrasts-quiet moments of introspection juxtaposed with explosive action and high-stakes tension. Ranveer Singh anchors the story with a performance that is raw yet calculated, capturing the inner turmoil of a man caught between duty and conscience. Direction ensures every subplot has purpose, while editing keeps the long runtime compelling. The supporting cast provides depth and complexity, enhancing the narrative&#39;s stakes. Cinematic techniques-from handheld camera work to sweeping aerial shots-immerse viewers in both the underworld and the emotional landscapes. The climax delivers both adrenaline and emotional resonance, leaving a lasting impression."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 11,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006847/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006635",
              "author": {
                "username": {
                  "text": "arkshing"
                },
                "userId": "ur179155520"
              },
              "summary": {
                "originalText": "The Perfect Blend of Thrill and Heart"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film grips you from the very first scene, immersing you into a world of tension and intrigue. Ranveer Singh delivers a powerhouse performance, balancing intensity with subtle vulnerability that makes his character feel profoundly human. The supporting cast adds layers to the narrative, each scene enriched by their nuanced portrayals. Director Dhar weaves together action, suspense, and political undertones seamlessly, creating a cinematic rhythm that never falters. The action sequences are meticulously choreographed, combining adrenaline-pumping fights with strategic tension, while the cinematography captures both the grit and grandeur of the setting. The editing maintains perfect pace, ensuring that even the quieter, character-driven moments hold immense weight. The film&#39;s score complements the visuals masterfully, heightening suspense without overwhelming the story. By the end, you are left both exhilarated and contemplative, a testament to the director&#39;s vision and the cast&#39;s dedication."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 17,
                "downVotes": 10
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006635/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007107",
              "author": {
                "username": {
                  "text": "jaswalaman"
                },
                "userId": "ur115069338"
              },
              "summary": {
                "originalText": "Drama That Keeps You on the Edge"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From start to finish, the film expertly balances suspense, strategy, and action. Ranveer Singh commands every scene with intensity and nuance, while Sanjay Dutt provides authority and menace. Akshaye Khanna and R Madhavan enhance the ensemble with subtle performances that elevate the narrative. Arjun Rampal&#39;s controlled menace creates tension that persists throughout, while Sara Arjun&#39;s emotional authenticity raises stakes. Aditya Dhar orchestrates narrative threads and action sequences with precision. Cinematography captures both the chaotic underworld and intimate character moments. The score heightens suspense, and the finale delivers both adrenaline-fueled action and emotional payoff."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 17,
                "downVotes": 10
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007107/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11035260",
              "author": {
                "username": {
                  "text": "mazon-3"
                },
                "userId": "ur211763910"
              },
              "summary": {
                "originalText": "Easily The best movie of this year"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Even though the movie is over 3hrs ,but a second does not feel boring. Its is packed with everything action , triller,a little bit of comady and ofcourse full of best quality acting by the stars. We all know akashay khanna stole the show ,but respect to those actors who made the movie so interesting. It&#39;s highly suggested that you go and watch this movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11035260/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033531",
              "author": {
                "username": {
                  "text": "RyderAviCR7"
                },
                "userId": "ur198756386"
              },
              "summary": {
                "originalText": "M Aditya Dhar Did What Bollywood Was Too Afraid To Do"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is what happens when a director actually has the spine to tell the truth instead of playing it safe for multiplex audiences and foreign markets.<br/><br/>Dhurandar doesn&#39;t apologize. It doesn&#39;t soften the edges. It shows you exactly what happens when a spy operates in the shadows - the guilt, the isolation, the impossible choices. Aditya Dhar built this film on real incidents, real audio recordings, real photographs. That&#39;s not cinematic liberty - that&#39;s documentation dressed as cinema.<br/><br/>The violence? Absolutely necessary. People cry about &quot;graphic scenes,&quot; but it&#39;s literally nothing - a car accident on the road is more brutal than 80% of what&#39;s shown here. That&#39;s barely 3-4% of what actually happens in real life. The brutality in this film has purpose - it&#39;s reflective, not mindless. It&#39;s there to shake people up, not glorify gore.<br/><br/>And here&#39;s the uncomfortable truth: people want to cry &quot;too graphic&quot; because they&#39;ve been fed sugar their whole lives by Bollywood directors too afraid to upset Pakistan or their own conscience. This is a spy movie. Spies don&#39;t solve problems with dialogue and philosophy - they solve them with action, and sometimes that action is ugly. That&#39;s the reality. If you can&#39;t handle that, you&#39;re simply not mature enough for this film, and that&#39;s fine - no one&#39;s forcing you to watch. Go watch Kapil Sharma if you just want a laugh. This film is for those who have the spine to face reality.<br/><br/>.<br/><br/>What killed me about this movie is how human it is. The lead doesn&#39;t become invincible. He doesn&#39;t single-handedly destroy an entire system while cracking jokes. He suffers. He carries the weight. He waits. He makes calculated moves. That&#39;s the actual craft of espionage, and no Bollywood film has ever shown it this way.<br/><br/>The performances are something else entirely. Every actor understands the assignment - this isn&#39;t about being likeable. It&#39;s about being real. You can feel the exhaustion, the purpose, the cost. That&#39;s masterclass acting right there.<br/><br/>And here&#39;s the thing people won&#39;t say out loud - this film is necessary. Not because it&#39;s anti-Pakistan or pro-India propaganda. It&#39;s necessary because it shows our young generation that there ARE people willing to bleed for this country, and their stories deserve to be told without apology or filter. That&#39;s not nationalism - that&#39;s truth.<br/><br/>YRF and the &quot;progressive&quot; brigade will never make this film. They&#39;re too busy worrying about what Twitter thinks and whether their next release will play in Gulf markets. Aditya Dhar didn&#39;t care about any of that. He made a film for Indians, about Indians, showing the reality of what Indians face.<br/><br/>This is the most honest spy film Indian cinema has ever produced. Period.<br/><br/>⭐⭐⭐⭐⭐ - Raw. Uncompromising. Absolutely necessary."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033531/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031447",
              "author": {
                "username": {
                  "text": "abhinabapal"
                },
                "userId": "ur78769000"
              },
              "summary": {
                "originalText": "Dhurandhar is not just a movie, it's a hard slap of truth."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It hits hard because it doesn&#39;t rely on &quot;cinematic exaggeration.&quot; Instead, it builds its story on real incidents - from the Kandahar hijack, to the 2001 Parliament attack, the fake currency network, and even the Lyari gang war links to 26/11.<br/><br/>What makes it truly intense is the use of real footage, real images, and real audio of terrorists, that detail alone changes the whole experience. You don&#39;t just watch the film, you feel the weight of what actually happened.<br/><br/>If you want a thriller that&#39;s not just entertaining but also shocking, informative, and unforgettable. Dhurandhar deserves your time."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031447/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013772",
              "author": {
                "username": {
                  "text": "rockstarankit"
                },
                "userId": "ur68512689"
              },
              "summary": {
                "originalText": "Once in a Generation movie."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Went to watch Dhurandhar in imax 6 am show . Who wakes up at 4:30 am on a sunday in Delhi winters to watch a movie !! I did &amp; it was all worth it ! The movie is 3 and half hours long but it won&#39;t feel like. You won&#39;t take your eyes off the screen. What a performance by entire cast and hats off to Aditya Dhar for the vision and putting such a cinematic experience on the screen. Akshaye Khanna finally getting the roles and credits he deserves for his work, he completely stole the show. What an aura ! Ignore the negative reviews and just watch it you won&#39;t regret it. Dhurandhar restores your faith in Bollywood. Don&#39;t miss the ending there is a high chance that things are going to get crazy in the next part."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013772/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013002",
              "author": {
                "username": {
                  "text": "omkarjoshi1989"
                },
                "userId": "ur20530103"
              },
              "summary": {
                "originalText": "Perfect example of how covert spy movie should be made"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Director is the character of the movie. With Uri as his first directorial movie, he gave what NEW BHARAT represents, jo dushman ke ghar me ghusta bhi hai aur marata bhi hai.<br/><br/>Some original and some originally inspired government officials characters makes it realistic. Covert spy doesn&#39;t provided all setup , all spoon feed mission intel on land, otherwise this time the wait is longer and spy has to make his way up in gangsters of Lyari town of Pakistan. Infaltrating enemy within is the motto here. Its not usual bollywood-ish spy thriller with high octane one sided action scenes, and heroine in bikini sequences. Here we get to see 3 hours and 32 minutes long saga of a man conspiring on his each step with calm mind and clear intentions to reveal enemy plans informing back to India.<br/><br/>Special mention for Akshay Khanna as villain manages to hit the impact on viewers even if hes not the hero of the film. Ranveercs character Hamza Ali Mazari, takes back foot in screenplay which feels correct since he has to implement his mission in most intelligent manner.<br/><br/>R Madhavan as Ajit Doval&#39;s inspired character Ajay Sanyal impacts you whenever he&#39;s on screen. Rage inside his eyes during annopening scene when he&#39;s been mocked by terrorist on plane, was top notch. With Mission Dhurandhar, he is in fact going to show enemy that &quot;Indians ke gude me kitna jor hai&quot;<br/><br/>Movie at one point shows 26/11 incidents first hand by using RED ACREEN EFFECT, which I don&#39;t think been implemented so great in any of the past films.<br/><br/>Kudos to Jio Studios and Director Ditya Dhar and all casting for giving such a wonderful wonderful film to root for!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013002/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033786",
              "author": {
                "username": {
                  "text": "shivajiturka"
                },
                "userId": "ur151237558"
              },
              "summary": {
                "originalText": "Could have been shorter and better"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "When I see all the scenes standalone, they were really awesome.<br/><br/>The action- Very realistic and on point. Hand to hand fight scenes could have been better.<br/><br/>Where the movie lacked- Flow, it felt very long to me. Felt like I was there for 4-5 hours, many scenes were dragged unnecessarily. Overall it could have been cut in a better way ( and I am waiting for a new cut if there will be one ever).<br/><br/>Dialogues were good, could have been better. Great performance by Arjun Rampal, Sanjay Dutt felt very out of place."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033786/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008204",
              "author": {
                "username": {
                  "text": "Safal-1"
                },
                "userId": "ur211554605"
              },
              "summary": {
                "originalText": "Hopeless movie and a waste of Money"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched it for an hour. It was a tortured. Somehow I bore the movie for one hour fifteen minutes, since I had to finish the popcorn. This movie simply does not a anrouse any interest. False hype. It is so boring that I could not resist posting this review. All the reviews here seem to be fake. Poorly made movie. Do not waste your time and money."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 6
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008204/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}