{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xobdjntazcwzy476thzmbuqpumsbj53mkdr7pmapdomqbdf4skydk3oy4fxmryod5whk5ezbpwkp4ieyse5fjxgwfq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11017588",
              "author": {
                "username": {
                  "text": "indranilsadhya"
                },
                "userId": "ur64921179"
              },
              "summary": {
                "originalText": "One of the best movie i watched."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s rare for a film to grab you from the opening frame and refuse to let go, but Dhurandar achieves exactly that. This is not just a movie; it&#39;s a cinematic experience that delivers on every promise and then some. If you&#39;re looking for the raw truth, here it is: The movie is absolute fire from beginning till end.<br/><br/>A Masterclass in Performance\nThe sheer quality of the acting is what truly elevates Dhurandar into must-watch territory. Every single individual on screen-every actor and actress-has genuinely outdid themselves. The ensemble cast operates with a synchronicity and intensity that is breathtaking.<br/><br/>However, a special, singular mention must be made of Akshaye Khanna&#39;s performance. To attempt a critique or even a simple summary of his work would be an exercise in futility. It is a performance that is, quite frankly, way above my paygrade. He doesn&#39;t just play the character; he embodies a force of nature, delivering a nuanced, powerful, and utterly memorable turn that will undoubtedly be discussed for years to come.<br/><br/>The Adrenaline-Pumping Narrative\nThe narrative pacing is relentless, in the best possible way. There isn&#39;t a single moment of lag or a scene that feels superfluous. The screenplay is taut, intelligent, and perfectly structured to maintain a constant state of excitement and engagement. From the opening sequence to the final, powerful crescendo, Dhurandar is a high-octane thrill ride that keeps you guessing, cheering, and gripped in its dramatic vise.<br/><br/>Final Verdict\nDhurandar is a triumph of filmmaking. It boasts a flawless execution across the board, from its direction and technical prowess to its magnificent screenplay and, most importantly, its stellar performances. This is the kind of movie that reminds you why you love cinema.<br/><br/>Do yourself a favor and experience the fire."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017588/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015758",
              "author": {
                "username": {
                  "text": "HarshitS-599"
                },
                "userId": "ur207178544"
              },
              "summary": {
                "originalText": "Bold Gritty and amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s a hard hitting movie with lots of emotions flowing around.... I was feeling too emotional sometimes and too angry sometimes after watching some scenes , thats how touching this movie is . This is a great example of a spy movie should be made rather than glamouring the spy world it keeps things raw and natural.... Would recommend everyone and every nationalist to go watch and experience this spectacle."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015758/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007188",
              "author": {
                "username": {
                  "text": "rvenkatamanoj"
                },
                "userId": "ur91181390"
              },
              "summary": {
                "originalText": "perfect for every moment"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I really appreaciate the Aditya Dhar not for making a movie which is perfect in every frame, but for starting the movie by thanking his wife. That&#39;s what men stand for. Everyone should see this and understand what spies go through! I could not get enough of this masterpiece! I loved it man!! I loved it to the core of its ideology!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007188/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007241",
              "author": {
                "username": {
                  "text": "anubhavshr"
                },
                "userId": "ur196919594"
              },
              "summary": {
                "originalText": "Captivates like hardly any other Bollywood flick"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Takes spy espionage and world building to the international standards. The performances, screenplay and background score are best in the industry probably even first time ever in Bollywood. The characters are sketched well and action is more realistic than contemporary standards. Apart from few forgivable ones, all the dialogues fit well too."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007241/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11096004",
              "author": {
                "username": {
                  "text": "AyuszM"
                },
                "userId": "ur201946645"
              },
              "summary": {
                "originalText": "Best spy movie of indian cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s raw , and every thing is fresh and original yesterday I was in LA and my some friend told me about this movie &quot;dhurandhar&quot; and they were too much excited to see these kind of movie from bollywood and they says that indian cinema is way ahead of every cinema in the world right now , i felt very at that moment and special Thankss to Aditya dhar respected you man."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-04",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11096004/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11034586",
              "author": {
                "username": {
                  "text": "titaniumframedbot"
                },
                "userId": "ur84125372"
              },
              "summary": {
                "originalText": "It's not just a movie, it's a feeling, an emotion..."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Very rarely am I compelled to login to my IMDB account and say a few words, but here goes.<br/><br/>After all the reviews I expecting it to be mind blowing, but I just wasn&#39;t ready to be mind blown and to this extent.<br/><br/>Awesome storyline, perfect cast and acting, and the soundtrack just takes you into a trance. 3.5hrs just flew by like nothing.<br/><br/>This is not a slow burn movie, it is rather raw, gritty and direct. It engages you from the first scene. To all Indian folks, it will invoke an emotion that&#39;s hard to describe. I am from Mumbai, so imagine. Dhurandhar is not just a movie, it&#39;s a feeling, an emotion a vibe. This is what a movie should be like, the story is engaging, the correct scenes, the right angles (R Madhavan speaking to camera during hard hitting dialogues), the right emotions, the right sequence (just enough to paint the story). I can go on and on.<br/><br/>The details, research and storytelling of Aditya Dhar is just such perfection. I was thinking is he like a Christopher Nolan of Bollywood, but that would be an injustice to the very brand and person that Aditya Dhar is. Words cannot express what magic he has woven here.<br/><br/>Actors did absolute justice to the roles. Ranvir Singh is just a silent volcano, burning with rage and he displays short outbursts in this part of the movie. His anger and emotion have such rawness, it felt satisfying. I am guessing this volcano erupts in next part. His looks, acting, emotions, wardrobe, body language and just seeing him being helpless surrounded by perpetrators is intense.<br/><br/>Every actor is just spectacular and just showed the world what Bollywood is and can be. Sanjay Dutt, Arjun Rampal, R Madhavan, Sara Arjun... just everyone is doing their part so well, I wonder how people can even complain.<br/><br/>And I should speak about Akshay Khanna separately. He has always been excellent and still is consistent, and he&#39;s finally getting the rightful praise that he has always deserved. His walk, his attire, his swag, every movement of his body and face is just such acting excellence and perfection.<br/><br/>And just who is Sashwat Sachdev? This music director, garnished this movie with such a &quot;vibe&quot;. You feel the adrenaline rush at the right moments, the actions, the thrill, the suspense, the club scene followed by the chase. The whole movie soundtracks blend and glide so smoothly with the story... it&#39;s truly magical. I was spellbound and still am. All the classic Bollywood hits so beautifully reimagined, it elevates the whole movie experience. The soundtracks echoing with the mountainous landscape, engulf you into the movie. Gehra Hua song for some scenes glides into Jazz and doesn&#39;t lose its rhythm continuing back soon after. Never in my life I imagined a bagpiper music could be mixed into a Bollywood song (Ez-Ez)<br/><br/>That&#39;s what why it&#39;s a must watch in Theaters and people are so addicted to it. It got me so interested, I truly noticed small things, like the rickshaw leaving and arriving sound to create Lyari&#39;s feel when Hamza is talking to Jamil.<br/><br/>Enough said, go and watch it. It&#39;s an incredible story based on true events of several horrible terror attacks India has encountered (including real footage) and a spy mission to identify, infiltrate and dismantle the very core of the terror network. So sad to see, this movie will be kicked out from several Canadian Theaters when Avatar releases<br/><br/>Please go watch it in movie theaters while you can, small screen experience won&#39;t give you the feel that I explained above."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11034586/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11037990",
              "author": {
                "username": {
                  "text": "amitorsinha"
                },
                "userId": "ur132883639"
              },
              "summary": {
                "originalText": "Exceptional Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The greatest spy movie of India.<br/><br/>Story is so gripping , actors are marvelous, background music is masterpiece.<br/><br/>Special mention Ranveer Singh, Akshay Khanna, Rakesh Bedi, Madhavan, Sanjay Dutt, Shashvat Sachdeva&#39;s music.what a comeback by Ranveer Singh.<br/><br/>Aditya Dhar&#39; s direction is superb.<br/><br/>Eagerly waiting for part two."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11037990/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007029",
              "author": {
                "username": {
                  "text": "ashoklegendman"
                },
                "userId": "ur170943504"
              },
              "summary": {
                "originalText": "A Universe of Drama and Thrill"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s immersive world-building is one of its strongest assets, drawing viewers deep into a network of crime and politics. Ranveer Singh delivers a tour-de-force, embodying both the vulnerability and cunning of a man caught between duty and survival. Director Dhar&#39;s meticulous attention to narrative detail ensures every scene carries weight, from silent confrontations to explosive set pieces. Action sequences are expertly staged, combining realism with cinematic flair, while the supporting cast adds layers of tension and complexity. Cinematography captures a rich visual texture, from the crowded streets to intimate interiors. The storytelling remains gripping throughout, culminating in a climax that is both emotionally and narratively satisfying."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007029/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11098894",
              "author": {
                "username": {
                  "text": "krishnamvyas-45024"
                },
                "userId": "ur157641238"
              },
              "summary": {
                "originalText": "best movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Inspirational Stories of Success Through Visualization The power of visualization and positive thinking has been a significant topic of discussion among psychologists, coaches, and individuals seeking personal growth. The stories of those who have harnessed this power not only inspire but also provide valuable lessons..."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11098894/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024235",
              "author": {
                "username": {
                  "text": "Tarunb-212"
                },
                "userId": "ur211673001"
              },
              "summary": {
                "originalText": "One of Those Rare Movies Where the Story Is Bigger Than Everyone"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I didn&#39;t even watch the trailer, so I honestly didn&#39;t know what to expect. My brother bought the tickets and we just went. Looking back, I feel lucky that I didn&#39;t miss this movie in theatres.<br/><br/>From the very beginning, the movie binds you. You can tell it&#39;s not about one hero or one big moment - it&#39;s about the story and the people inside it. The film depends on every character. No one feels extra, and no one feels bigger than the story. This is proper character-driven cinema, where the story stays supreme over any actor or image.<br/><br/>Everything feels real and grounded. No nudity, no vulgar scenes, no unnecessary drama. The ten-chapter structure works really well because it lets the story open layer by layer instead of forcing emotions.<br/><br/>The fight scenes look raw and believable. No fake hero fights, no over-the-top action. People get hurt, people struggle - it feels real.<br/><br/>Before watching, I thought it might be something like a KGF-style movie - loud, heavy background score, full hero worship. But this movie goes in a completely different direction. There&#39;s no exaggerated heroism or superhuman stuff. It stays controlled and honest from start to end.<br/><br/>You can clearly see the effort everyone has put into this film. It feels like a proper team project, not a formula movie. From the actors to the technical team, everyone seems invested.<br/><br/>I didn&#39;t expect this level of control and precision from Ranveer Singh, but he proved me wrong. Still, even his performance never overshadows the story - it supports it.<br/><br/>The director deserves huge credit. Everything feels intentional. Nothing feels fake or done just for claps.<br/><br/>And honestly, I never write movie reviews. I didn&#39;t even have an IMDb account before this. This movie made me create one just to write this.<br/><br/>With movies like Chaava and now Dhurander, it really feels like Indian cinema is moving in the right direction - more story-first, more character-driven.<br/><br/>Went in without expectations.<br/><br/>Came out impressed."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024235/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014152",
              "author": {
                "username": {
                  "text": "zakim-14691"
                },
                "userId": "ur65512824"
              },
              "summary": {
                "originalText": "best movie of 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Besssst movie watched in cinema after such a long time.<br/><br/>Akshay Khanna as Rehman Dakait did a fabulous acting. Ranveer also looked really handsome in his Hamza character look, but the villian ate the hero.<br/><br/>10/10 movie plot, story as well as cast. Sara looked too beautiful and played her role very well."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014152/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11085231",
              "author": {
                "username": {
                  "text": "bedeadly"
                },
                "userId": "ur151174973"
              },
              "summary": {
                "originalText": "Awesome 👍🏻"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "*Dhurandhar* stands tall as a powerful and ambitious cinematic experience that redefines the scale and seriousness of Hindi spy thrillers. Directed with clarity and vision by Aditya Dhar, the film presents a gripping narrative rooted in intelligence operations, national duty, and personal sacrifice. From the very first frame, the film commands attention and maintains a strong emotional and dramatic grip throughout.<br/><br/>Ranveer Singh delivers one of the most impressive performances of his career. His portrayal of an undercover intelligence officer is layered, intense, and deeply immersive. Instead of relying on loud expressions, he uses silence, controlled emotions, and body language to convey the internal struggles of his character. This mature and disciplined performance adds immense credibility to the story. Akshaye Khanna is equally remarkable, bringing depth and sharpness to his role, while actors like R. Madhavan and Sanjay Dutt enhance the film with their strong screen presence and experience. The ensemble cast works seamlessly, making every character feel significant and memorable.<br/><br/>Visually, *Dhurandhar* is striking. The cinematography creates a realistic and atmospheric world that pulls the audience into the dangerous landscape of espionage. Every frame is carefully composed, and the production design reflects authenticity and attention to detail. The background score is impactful and elevates the tension, while the sound design enhances the intensity of crucial moments.<br/><br/>The storytelling is rich and layered, unfolding gradually and allowing viewers to fully absorb the complexity of the mission and the emotional weight carried by its characters. The film successfully blends action, intelligence, and emotion, making it engaging on multiple levels. Themes of patriotism, loyalty, and courage are handled with seriousness and respect, giving the film a strong emotional core.<br/><br/>What truly sets *Dhurandhar* apart is its ambition. It does not shy away from telling a large, meaningful story with confidence and scale. The film feels cinematic in every sense - from performances and visuals to its emotional depth.<br/><br/>Overall, *Dhurandhar* is a compelling, intense, and thoughtfully crafted film that leaves a lasting impression. It is a proud achievement in Indian cinema and a must-watch for audiences who appreciate powerful storytelling and strong performances."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-01",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11085231/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010228",
              "author": {
                "username": {
                  "text": "pranav-740"
                },
                "userId": "ur211565851"
              },
              "summary": {
                "originalText": "Movie Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is the awesome character.reviews for recent releases cover a range of genres and critical receptions. Here is a summary of recent reviews, including the latest Indian cinema releases, based on available information:Received favorable reviews, with praise for the cast&#39;s performances, soundtrack, and emotional depth as it explores the highs and lows of relationships."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010228/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006485",
              "author": {
                "username": {
                  "text": "sofiyakhan-63759"
                },
                "userId": "ur188394113"
              },
              "summary": {
                "originalText": "A Powerful Ride Designed for Big Screens"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every sequence builds tension and delivers narrative payoff, making the story impossible to ignore. The protagonist is compelling, portraying both internal conflict and outward decisiveness with finesse. Action is choreographed to emphasize stakes and character, never feeling gratuitous. Supporting characters contribute richness, enhancing the story&#39;s authenticity. Cinematography captures the chaos and quiet with equal skill, while the sound design amplifies suspense and emotion. Political and criminal elements give depth and realism, while the screenplay balances strategy, intrigue, and personal stakes masterfully. The climax ties together action and emotion flawlessly, leaving an enduring impression of cinema at its peak."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006485/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11037250",
              "author": {
                "username": {
                  "text": "SouvikG-851"
                },
                "userId": "ur211780904"
              },
              "summary": {
                "originalText": "Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolute cinema moment peaked here..\nFrom the starting to the ending everything was perfect. Storytelling,casting, performance all things were top notch\nHuge respect to Aditya Dhar for making this type of movie.<br/><br/>Very very excited to see the second part of this series.<br/><br/>Ans we don&#39;t appreciate Akshay Khanna sir enough. He was the best among all.😊👍"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11037250/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007239",
              "author": {
                "username": {
                  "text": "shahneetu-51517"
                },
                "userId": "ur123184253"
              },
              "summary": {
                "originalText": "A Blockbuster Experience for All"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is methodical yet compelling, slowly tightening suspense while introducing complex moral dilemmas. Ranveer Singh dominates with a performance that is physically dynamic and emotionally layered, portraying a character constantly torn between strategy, loyalty, and conscience. Sanjay Dutt commands scenes effortlessly, bringing depth and gravitas that elevate every interaction. Akshaye Khanna and R Madhavan provide intelligent, restrained performances that add subtle narrative tension, while Arjun Rampal&#39;s presence injects a simmering menace throughout. Sara Arjun delivers heart-wrenching moments, giving emotional grounding to the otherwise high-octane narrative. Aditya Dhar&#39;s direction expertly balances pacing, tension, and layered storytelling, ensuring the long runtime never feels indulgent. The cinematography captures both chaotic urban landscapes and intimate character interactions with cinematic finesse. The score enhances suspense and emotional resonance, and the climactic sequences masterfully blend strategy, emotional stakes, and action, leaving a lasting impression of cinematic craftsmanship."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007239/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013988",
              "author": {
                "username": {
                  "text": "pritamdey-23822"
                },
                "userId": "ur151311134"
              },
              "summary": {
                "originalText": "Brilliantly Made"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s so soo refreshing watch.. Something different from what we have seen so far. Feels a bit slow at times, for 5-7 mins, then comes back with bang. Hats off to the director and his vision. The way the characters were introduced is amazing. UAEs of old songs in the middle of action scenes is just out of the world."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013988/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014444",
              "author": {
                "username": {
                  "text": "himanshusinghal-23055"
                },
                "userId": "ur100105227"
              },
              "summary": {
                "originalText": "What a class movie MOTY2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping entertainer that thrives on its powerful villain and intense storytelling. While most films rely heavily on the hero&#39;s charisma, here it is the antagonist who steals the entire show. The villain&#39;s aggression, screen presence, and ruthlessly sharp dialogue delivery dominate every frame, overshadowing the hero in a way that feels refreshing and bold. His performance adds an unpredictable tension that keeps you hooked from start to finish.<br/><br/>The hero does a decent job, but the writing clearly favours the villain&#39;s arc, making him the true driving force of the narrative. The confrontations between the two are beautifully crafted-raw, high-energy, and emotionally charged. The film&#39;s pacing is tight, with almost no dull moments, and the background score enhances the thrill in all the right places.<br/><br/>Visually, Dhurandhar carries a gritty tone that matches its storyline. The action sequences are choreographed well, balancing realism with cinematic flair. What truly stays with you after the movie ends is the antagonist&#39;s performance-layered, menacing, and unforgettable.<br/><br/>Overall, Dhurandhar is an engaging watch, especially for those who enjoy strong villain-led narratives. Highly recommended-you must watch it!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014444/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028471",
              "author": {
                "username": {
                  "text": "Rubayett"
                },
                "userId": "ur92942976"
              },
              "summary": {
                "originalText": "What a shivering, grotesque and raw depiction of the Pakistani underworld."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshaye Khanna dropping one of the greatest supporting performances I&#39;ve ever seen, the rise and fall of &quot;Rehman Dakait&quot; is worn all over the face of Akshaye, he steals every shot. Ranveer Singh with a beautifully natural display and hats off to Arjun Rampal for his brief yet menacing turn. The politics of the film is contentious but for a cinema standpoint it&#39;s a near perfect set-up for part 2. My only regret is I won&#39;t see more of Akshaye in the sequel. Could&#39;ve done with a bit less romance with &quot;Hamza&quot; and &quot;Yalina&quot;, as aside from the marriage it served no purpose in the story, that might&#39;ve helped trim down the 200+ minute runtime. The world building was incredible, I really felt like I was stuck in the mid 2000s Lyari. Grim and dirty in landscape and actions of the gangsters that run the land. Absolutely no mercy shown, nothing but hatred and contempt for those who stand in their way. Ranveer Singh as a leading man yet a shadowy character serves his purpose well, he is overshadowed intentionally and I love the realistic nature of that because &quot;Hamza&quot; is the spy, he is there to assimilate not stand out, part 2 is where he will take on the cloak of leader and dictate the story. Aditya Dhar&#39;s direction is commendable and I&#39;m a big fan of his work though most/ all as a director has focussed on India vs Pakistan. My favourite scene was &quot;Rehman&quot; entering his home town vibing and dancing along with &quot;FA9LA&quot; blasting away. So much aura garnered. It&#39;s true there weren&#39;t many surprises, everything&#39;s pretty much laid out and plays out exactly how we expect it to but I don&#39;t mind that because this is a build up to part 2 which I imagine will be a lot more chaotic, following the arc of &quot;Hamza&quot; going from a sly shadow to a monster ruler."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028471/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11095302",
              "author": {
                "username": {
                  "text": "SumitS-796"
                },
                "userId": "ur212188123"
              },
              "summary": {
                "originalText": "Incredible"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great work by the film makers. Heartfelt story. The way it&#39;s integrated with real events is superb and perfect. Fantastic acting by each and every actor and actresses. No single hero worship unlike most Indian movies. Fantastic music and memorable songs. 3:30 hours of energetic and engrossing entertainment."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-04",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11095302/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015539",
              "author": {
                "username": {
                  "text": "anuragskumar"
                },
                "userId": "ur80864436"
              },
              "summary": {
                "originalText": "Fantastic movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Engaging for many viewers - &quot;paisa vasool / full entertainment&quot; - Among audience reactions shared online, several people say the movie delivers what it promises: action, drama, intensity, and gives a &quot;thrilling ride.&quot; Example from Reddit:Content and moral-sensibility concerns (violent / heavy) - Several audience posts mention that the film is heavy on violence, profanity, and dark themes - note as many called it a &quot;gore-heavy&quot; and &quot;A-rated&quot; experience. Example:"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015539/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007372",
              "author": {
                "username": {
                  "text": "amit-16557"
                },
                "userId": "ur120248059"
              },
              "summary": {
                "originalText": "Great. Must Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Awesome work done by Aditya Dhar. Great starcast, gripping scenes, excellent cinematography. Loved a movie after a long time based on real life events. Ranveer Singh - Such a versatile actor, Akshay Khanna - soul of the movie. Rest all the characters have done their job superbly. Can&#39;t wait for part 2 on March 19, 2026."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007372/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016878",
              "author": {
                "username": {
                  "text": "Shishirs-39"
                },
                "userId": "ur211615898"
              },
              "summary": {
                "originalText": "story line is good"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The whole plot has a good story line and major part is the acting of all the actors uplifted all scenes and it would give you entertainment and somewhat thrill for which people actually look movies. Also the internet sensation akshay khanna really did well, these experienced actors actually make u believe the scenes and you really connect with them."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016878/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006448",
              "author": {
                "username": {
                  "text": "palakchu"
                },
                "userId": "ur197686139"
              },
              "summary": {
                "originalText": "Feel the Fire of Unmatched Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The genius of Dhurandhar lies in its seamless blend of narrative complexity and human drama. The director orchestrates a tightly knit story where every character&#39;s action feels consequential. The lead actor delivers a career-defining performance, effortlessly shifting between charm, vulnerability, and intensity. Supporting actors are equally compelling, adding depth and texture to a politically charged plot. The director&#39;s ability to balance large-scale action with intimate character moments ensures that the audience remains emotionally invested. Cinematic precision meets brilliant acting in this unforgettable film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006448/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006964",
              "author": {
                "username": {
                  "text": "GautamT-4"
                },
                "userId": "ur203912737"
              },
              "summary": {
                "originalText": "A Grand Drama Led by Unforgettable Stars"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story grips gradually, pulling audiences into a complex web of crime and politics. Ranveer Singh excels in conveying moral struggle, while Sanjay Dutt radiates authority and danger. Akshaye Khanna and R Madhavan bring sophistication and depth to their roles, and Arjun Rampal&#39;s presence intensifies the tension. Sara Arjun&#39;s performance adds poignant humanity. Aditya Dhar&#39;s direction maintains balance between intricate plotting and high-octane action. The cinematography emphasizes scale, from chaotic cityscapes to intimate character moments. The editing ensures seamless pacing, and the score underscores suspense without overpowering. By the climax, the narrative is both emotionally charged and action-packed, leaving a lasting impact."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006964/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}