{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6ldbftazcwzy472th5njsr7t42bz53qntr6pjb3domqbdf4skydk3o4yv7mbyoczwkqcjadiezc32piezisypetcq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11007145",
              "author": {
                "username": {
                  "text": "vermaroshan-61586"
                },
                "userId": "ur118086240"
              },
              "summary": {
                "originalText": "Full-On Action with Heartfelt Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening frames, the film immerses audiences in a morally complex underworld. Ranveer Singh embodies his conflicted character with depth, seamlessly shifting between calculated aggression, introspection, and bursts of raw emotion. Sanjay Dutt dominates every scene he occupies, bringing gravitas, menace, and a sense of history to his character. Akshaye Khanna and R Madhavan provide intelligent, restrained performances that give the story weight and nuance. Arjun Rampal exudes quiet danger, and Sara Arjun&#39;s emotional authenticity highlights the human cost of the narrative&#39;s events. Aditya Dhar&#39;s direction blends layered storytelling, strategic tension, and high-octane action without ever feeling contrived. Cinematography captures both sprawling urban landscapes and intimate human moments, while the score heightens suspense and drama. Every sequence, from calculated dialogue exchanges to explosive confrontations, is carefully choreographed, making the long runtime feel justified. By the finale, the film delivers a thrilling, emotionally resonant climax that rewards patient engagement and thoughtful viewing."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007145/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11042108",
              "author": {
                "username": {
                  "text": "SubramanianR-4"
                },
                "userId": "ur211818025"
              },
              "summary": {
                "originalText": "Raw is war"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Raw (pun intended) movie showing a realistic depiction of Pakistani terror inc including terrorists indoctrinated in Islamic jihad by the ISI, counterfeit currency trade, and India&#39;s belated realization and response. Cant wait for part 2. The Flipperachi song and the retro songs Ramba Ho &amp; Hawa Hawa make it nostalgic."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11042108/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014409",
              "author": {
                "username": {
                  "text": "rjmandhane"
                },
                "userId": "ur60131110"
              },
              "summary": {
                "originalText": "A Masterclass in Cinematic Ambition and Technical Excellence!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands as a remarkable achievement in Indian cinema-a sprawling, ambitious spy thriller that demonstrates why patience and meticulous filmmaking can transform a nearly three-and-a-half-hour runtime into an utterly captivating experience. Director Aditya Dhar has crafted a film that refuses to be confined by conventional narrative formulas, instead delivering a visually and thematically rich epic that engages audiences throughout its considerable length while leaving them eagerly anticipating the promised sequel.<br/><br/>From its opening frames, Dhurandhar announces itself as a film of uncommon ambition and technical precision. Aditya Dhar&#39;s directorial vision is evident in every meticulously composed frame, transforming the gritty criminal underworld of Karachi&#39;s Lyari district into a character unto itself. The director&#39;s commitment to immersive world-building creates an atmosphere of palpable tension-one that never relinquishes its grip on the viewer despite the film&#39;s substantial length. What could easily have become a cumbersome narrative instead becomes a methodical, deliberate unfolding of a complex geopolitical chess game, where every scene serves a purpose in building the film&#39;s layered complexity.<br/><br/>The technical execution deserves singular praise. Cinematographer Vikash Nowlakha delivers visually stunning work that captures both the sweeping vistas and claustrophobic intensity of the underworld setting, plunging viewers directly into the dusty, dangerous alleys of Karachi. The editing by Shivkumar V. Panicker maintains remarkable control over the narrative&#39;s rhythm, ensuring that even the film&#39;s longest sequences never feel bloated or self-indulgent. This technical precision is crucial-it transforms what could have been an exercise in excessive length into something genuinely cinematic, where every minute finds justification in Dhar&#39;s ambitious world-building.<br/><br/>The background score by Shashwat Sachdev deserves particular commendation for its intelligent use of classic, vintage soundtracks that serve as a constant emotional undercurrent throughout the film. Rather than relying on bombastic, intrusive scoring, Sachdev crafts a musical landscape that functions as a pulsating heartbeat beneath the narrative-ensuring tension never dips while maintaining an authentic, lived-in quality. The score&#39;s sophisticated composition reveals itself as a character in its own right, subtly elevating emotional beats without ever overshadowing the intimate character moments that anchor this sprawling epic.<br/><br/>The ensemble cast delivers performances of remarkable depth and nuance. Ranveer Singh&#39;s portrayal of Hamza Ali Mazhari represents arguably the finest work of his career-a transformation so complete that the actor essentially disappears into the character. His performance navigates the treacherous emotional terrain with surgical precision: displaying steely determination in one moment, raw vulnerability in the next, creating a protagonist whose internal dilemmas feel profoundly relatable despite his extraordinary circumstances. Alongside him, Akshaye Khanna provides a superbly controlled, scene-lifting performance as Rehman Dakait that proves utterly magnetic. The chemistry and friction between these two actors form the electric core of the film, generating some of the most compelling dramatic moments in contemporary Indian cinema.<br/><br/>The supporting cast elevates the entire enterprise. Sanjay Dutt brings an understated menace to his role as SP Chaudhary Aslam, while Arjun Rampal&#39;s quiet intimidation creates an unsettling contrast with other performances. R. Madhavan and Akshaye Khanna add intelligence and depth to the ensemble, ensuring that even smaller roles feel fully realized and contribute meaningfully to the narrative&#39;s intricate tapestry.<br/><br/>What makes Dhurandhar particularly impressive is its refusal to apologize for its ambition. Rather than trimming itself to fit conventional expectations about commercial cinema, the film invests its considerable runtime in character development, relationship building, and world-establishment that pays extraordinary dividends when the action sequences erupt with brutal precision. The action choreography itself is meticulous, immediate, and entirely free of unnecessary flourish-each confrontation feels earned and meaningful rather than inserted merely for spectacle.<br/><br/>The narrative structure, while occasionally testing audience patience with its deliberate pacing, ultimately justifies its length through sheer craftsmanship. The film&#39;s multiple chapters create a visually stylish architecture that compartmentalizes its narrative while maintaining forward momentum. This approach transforms what could have been an unwieldy runtime into a sophisticated, multi-layered exploration of espionage, betrayal, political intrigue, and the moral compromises demanded of those operating in shadowy spaces between nations.<br/><br/>The ending, in particular, proves tantalizing enough to generate genuine anticipation for the promised sequel scheduled for March 2026. Rather than attempting to wrap everything into neat resolution, Dhurandhar leaves narrative threads deliberately open, establishing questions that demand answers and character arcs that cry out for continuation. This approach demonstrates confidence in the property and pays respect to the complexity established throughout the film&#39;s runtime.<br/><br/>Dhurandhar is ultimately a film for those willing to surrender themselves to its vision-an immersive, technically brilliant, and deeply engaging experience that rewards patience with spectacle, intelligence, and genuine emotional resonance. It represents a bold statement about what Indian cinema can achieve when a director commits fully to his artistic vision, and the technical and creative team executes with precision and passion. For audiences seeking a film that respects their intelligence while delivering the visceral thrills of a world-class spy thriller, Dhurandhar stands as an essential cinematic experience that justifies every one of its 214 minutes."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014409/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006899",
              "author": {
                "username": {
                  "text": "LataG-64"
                },
                "userId": "ur211546972"
              },
              "summary": {
                "originalText": "Ranveer Singh at His Best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story&#39;s slow-burning tension transforms into high-octane action by the second half. Ranveer Singh&#39;s performance is layered and captivating, balancing intellect, moral struggle, and physical prowess. Sanjay Dutt brings authority and menace, while Akshaye Khanna and R Madhavan elevate the narrative with subtle, compelling performances. Arjun Rampal&#39;s controlled menace keeps viewers constantly alert, and Sara Arjun&#39;s emotional authenticity heightens the stakes. Aditya Dhar&#39;s direction orchestrates suspenseful plotting, high-intensity action, and nuanced character development. Cinematography captures Karachi&#39;s chaos and intimate moments, while the score intensifies suspense. The climax delivers both emotional payoff and thrilling spectacle, leaving viewers thoroughly engaged."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006899/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11057347",
              "author": {
                "username": {
                  "text": "MuskanS-146"
                },
                "userId": "ur211931903"
              },
              "summary": {
                "originalText": "great movie!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Loved the story, the action, the dialogues, the bgm was fantastic, and the acting was greatest. Not a single time i felt it lengthy. Great moviee!!!!!! Ranveer was great as usual, the new face of actorss was great, each and every other actor was bestt....!!!! No words to describe the actor they played at their besttt....!!!!!!!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11057347/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012544",
              "author": {
                "username": {
                  "text": "grumpyfanatic"
                },
                "userId": "ur153237812"
              },
              "summary": {
                "originalText": "Indian cinema at its PEAKKKK"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those rare films that quietly enters the theatres but leaves an unforgettable mark on everyone who watches it. In a time when cinema is often driven by noise, spectacle, and formula, Dhurandhar stands tall as a reminder of what sincere filmmaking truly looks like. This movie deserves not just our attention, but our respect and support-because every little detail about it is crafted with intention, skill, and a deep understanding of storytelling.<br/><br/>Right from the opening frame, you can sense the care poured into the film&#39;s creation. The cinematography sets the tone beautifully, capturing both the intimacy of the characters&#39; emotions and the vastness of the world they inhabit. Nothing feels forced or exaggerated. Even in its simplest shots, the film manages to communicate more than many big-budget blockbusters do with mountains of visual effects. The colour palette, the lighting, the framing-each element contributes to the emotional weight of the story.<br/><br/>The performances are another standout. Every actor, regardless of screen time, adds something meaningful. The lead delivers a layered, honest portrayal that draws you into the character&#39;s journey rather than demanding your sympathy. The supporting cast complements this beautifully, grounding the narrative with authenticity. There are no weak links, no over-the-top dramatics-just pure, heartfelt acting.<br/><br/>What truly elevates Dhurandhar is the writing. The screenplay is tight, purposeful, and immersive. Every dialogue serves the narrative; every silence carries meaning. The character arcs unfold organically, giving the audience time to connect with the emotions at play. There&#39;s a maturity in the storytelling-no shortcuts, no pandering. The film trusts its viewers and respects their intelligence, which is refreshing.<br/><br/>The background score and music deserve special mention. Rather than overpowering scenes, the music enriches them. Subtle notes enhance delicate moments, while stronger compositions bring depth to the film&#39;s more intense sequences. It&#39;s the kind of soundtrack that lingers in your mind long after the credits roll.<br/><br/>Equally impressive is the film&#39;s production design. Whether it&#39;s the interiors of a modest home or the dynamics of a bustling street, everything feels lived-in and real. The attention to detail is astonishing-props, costumes, and locations all reflect the world the characters belong to. It&#39;s clear that every department worked with passion and clarity of vision."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012544/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010661",
              "author": {
                "username": {
                  "text": "SamikshaS-096"
                },
                "userId": "ur211567936"
              },
              "summary": {
                "originalText": "Masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A movie that doesn&#39;t keep you on unnecessary edge but provides you the ground touch to reality. Amazing. Actors, music, story telling, research everything was on point. No loose ends. Masterpiece it is. I can&#39;t wait for part two after the ending it gave. Second part id to release in March 2026. Counting days."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010661/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11041432",
              "author": {
                "username": {
                  "text": "bansalgaurav"
                },
                "userId": "ur65462941"
              },
              "summary": {
                "originalText": "Dhurandhar: A Bold, Brilliant Masterpiece That Redefines Reality Through Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an absolute masterpiece-a film that doesn&#39;t just tell a story, it unravels history, psychology, and geopolitics with rare cinematic courage.<br/><br/>What truly sets Dhurandhar apart is the way the reality of Indo-Pak relationships is shown in an exceptionally imaginative way. Instead of relying on loud nationalism or predictable tropes, the film dives into the grey zones-where intelligence, sacrifice, deception, and diplomacy collide. Every scene feels layered, intentional, and deeply researched, making the narrative gripping without ever feeling exaggerated.<br/><br/>The fact that it is based on true events makes this even more realistic and public-expectation-defying. You constantly feel the weight of authenticity-this isn&#39;t fiction designed to please; it&#39;s truth designed to provoke thought. The storytelling respects the audience&#39;s intelligence, trusting viewers to connect the dots rather than spoon-feeding emotions or conclusions.<br/><br/>Performances are razor-sharp, with characters that feel lived-in rather than written. The tension builds quietly but relentlessly, and the emotional payoff lands hard because it feels earned. The direction deserves special praise for balancing realism with cinematic brilliance-never documentary-dry, never melodramatic.<br/><br/>In short, Dhurandhar is not just a movie; it&#39;s an experience. Bold, intelligent, unsettling, and unforgettable.<br/><br/>A film that stays with you long after the credits roll-and one that raises the bar for political and historical cinema in India."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11041432/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007179",
              "author": {
                "username": {
                  "text": "parthpandotra"
                },
                "userId": "ur132214492"
              },
              "summary": {
                "originalText": "Absolute Banger."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the very first frame, Dhurandhar grabs you by the collar. The backdrop of underworld politics and covert operations inspired loosely by real events lends a dark, gritty flavour to the narrative. What makes the film compelling is how it refuses to sugarcoat its world, the violence feels raw and grounded, the stakes feel real, and the chaos of gang wars is brought to life with relentless energy. The ensemble cast is a major strength. Ranveer Singh leads with quiet intensity brooding and determined, his character carries the film&#39;s emotional weight well. But the film truly shines when Akshaye Khanna steps in: his performance is chilling, compelling and memorable a standout that elevates the entire movie. Supporting actors add depth, and even smaller roles feel lived-in, authentic which adds to the immersive ambience. Technically too, the film is impressive. The cinematography captures both sprawling underworld grime and tense interior moments with equal skill. The background score and music weave through the narrative, amplifying tension, emotion and drama often giving you goosebumps, especially during the climactic scenes. Dhurandhar leaves an impact. It isn&#39;t light entertainment it demands attention, but rewards it with raw emotion, high stakes and powerful performances. For those who appreciate bold, intense spy-thrillers that don&#39;t compromise on grit or scale, Dhurandhar is not just a film, it&#39;s an experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007179/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010849",
              "author": {
                "username": {
                  "text": "JayrajD-9"
                },
                "userId": "ur211568527"
              },
              "summary": {
                "originalText": "Eye catching film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is masterpiece of the the entire bollywood movie collections. Every second is engaging and you wouldn&#39;t get bored even for a single second. The performances of all the actors were so good. Especially Mr khanna&#39;s role of Rehman dakait was so good that even though it was a side role but still it felt like he was the main character. Also ranveer&#39;s acting was on next level."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010849/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033758",
              "author": {
                "username": {
                  "text": "manchuprasath"
                },
                "userId": "ur140347347"
              },
              "summary": {
                "originalText": "Dhurandhar is OMG!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Clearly one of the best from Bollywood in the recent years...<br/><br/>Now waiting for #Dhurandhar2 .<br/><br/>Ranveer Singh, Akshaye Khanna stand out. But Madhavan and Arjun Rampal will have more to do in part 2 I guess.<br/><br/>Aditya Dhar is the actual hero!!! From the first close up shot of Madhavan to the last close up shot of Ranveer, there was no time to blink. Thats how good the screenplay and editing were. Enjoyed every 3hrs 24 mins.<br/><br/>Violence without content is bad. But this is content with violence. Go for it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033758/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005025",
              "author": {
                "username": {
                  "text": "Divyansh_Verma_2003"
                },
                "userId": "ur163716497"
              },
              "summary": {
                "originalText": "Gourmet Cinema: A Benchmark Above the Sloppy Universes"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Honestly, this film is a pure masterclass. Everything-from the tight, snappy editing and pulse-pounding stunts to the razor-sharp dialogues, committed acting, and decisive direction-delivers exactly what you want a spy espionage film to stylistically have. We&#39;ve hit a true breakthrough moment in Indian cinema here.<br/><br/>I sincerely hope the audience support matches this quality (because, let&#39;s be real, this needs to succeed on a level far beyond the generic, certified-low-effort slops we&#39;ve seen recently, like War 2 or Gadar 2, and the various sloppy cinematic universes. You get the point!).<br/><br/>The Cast: Unhinged, Unrecognizable, and Phenomenal\nAkshayae simply out-classed everyone; he absolutely owned the screen!<br/><br/>Ranveer had a perfectly built-up mysterious aura that anchored the story.<br/><br/>All the supporting casts were phenomenal and totally deserved their screen time.<br/><br/>Madhawan was genuinely unrecognizable in his role-a phenomenal transformation.<br/><br/>Dutt&#39;s presentation is surprisingly fresh and different, playing out against what most viewers might expect.<br/><br/>Rampal was unhinged in the best way. Given his role, I&#39;m expecting them to explore much more of his story in the next film.<br/><br/>Sara Arjun&#39;s character also worked incredibly well. The level of self-awareness in this film is brilliant; they even managed to mock her relationship through a quick dialogue!<br/><br/>Spinoff Potential &amp; The Aditya Dhar Universe\nThere&#39;s a serious potential Aditya Dhar Universe building up here, based on a single reference dropped from URI. Time will tell if that&#39;s true, but I genuinely think they should pursue it aggressively. They need to teach a lesson to the sloppy cinematic universes we&#39;ve been subject to in recent years!<br/><br/>Yes, some specific dialogue placements do feel slightly propagandous or overly patriotic, but honestly, that&#39;s entirely forgivable when everything else surrounding it-the plot, the pace, the technical execution-has been knocked completely out of the park.<br/><br/>The Technical High &amp; Music\nI was hooked right from the first shot of the first chapter. The music and the cinematography just instantly pulled me into this world. Right from that opening moment, I knew I was in for a real cinephile&#39;s treat, and I never felt the length-absolutely not!<br/><br/>This is the exact testosterone high I was deprived of since Animal. I was actually worried beforehand (from the music launches) that this might end up being too heavy on the love and romance between Sara and Ranveer, but thankfully, that concern didn&#39;t materialize.<br/><br/>And a major shout-out to the music department: they hit a home run. So much of the background music and the various background tunes used here are straight-up jams! I am convinced the makers will have to upload them straight to YouTube on public demand very soon.<br/><br/>The Wait for Part 2 is Torture!<br/><br/>LAST BUT NOT LEAST: I absolutely cannot wait for Part 2! March 19 feels way too long, darn it! They should have kept the gap shorter, maybe at eight weeks, or at least closer, like Nishanchi, Gangs of Wasseypur, and Sapta Sagaradaache Ello."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005025/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11095744",
              "author": {
                "username": {
                  "text": "dipsmit"
                },
                "userId": "ur123658170"
              },
              "summary": {
                "originalText": "Excellent work. Just Replace Ranveer Singh with Mohit Raina."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Excellent work. Shown the reality. Waiting for the next part. Just replace Ranveer Singh with Mohit Raina and it would be more attractive. Ranveer Singh suits more in comedian role.<br/><br/>Excellent work. Shown the reality. Waiting for the next part. Just replace Ranveer Singh with Mohit Raina and it would be more attractive. Ranveer Singh suits more in comedian role."
                }
              },
              "authorRating": 9,
              "submissionDate": "2026-01-04",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11095744/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006917",
              "author": {
                "username": {
                  "text": "dineshkumar16"
                },
                "userId": "ur141170039"
              },
              "summary": {
                "originalText": "Action That Brings You to the Edge"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every frame is meticulously crafted, reflecting Dhar&#39;s commitment to storytelling that blends realism with cinematic flair. Ranveer Singh&#39;s portrayal of Hamza is magnetic, effortlessly switching between vulnerability, determination, and rage. The film&#39;s pacing allows tension to simmer, making every confrontation impactful. Action sequences are choreographed with a brutal elegance that feels earned, not gratuitous. Cinematography captures the stark contrasts of Karachi&#39;s underworld, from shadowed alleyways to tense boardrooms. Supporting characters are fully fleshed out, adding moral complexity and emotional depth. The narrative culminates in a finale that&#39;s both shocking and satisfying, leaving viewers reflecting on the intricacies of power, loyalty, and betrayal."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006917/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010178",
              "author": {
                "username": {
                  "text": "harshsharma-54638"
                },
                "userId": "ur86460239"
              },
              "summary": {
                "originalText": "Unapologetic, Raw, and Absolutely Gripping"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a masterpiece that finally tells the story India needed to hear. Director Aditya Dhar delivers a hard-hitting narrative that does not hold back.<br/><br/>First, the movie beautifully captures the intense struggle of our intelligence agencies. It pays a perfect tribute to the sacrifice of the unknown men who protect us from the shadows.<br/><br/>Second, you will appreciate the unapologetic way the film exposes the political class of 15-20 years ago. It highlights the frustrations faced by our agencies due to lack of political will.<br/><br/>The depiction of Pakistan and the ISI feels chillingly authentic. It peels back the layers to show the &quot;true side&quot; of our neighbors without sugarcoating the threats.<br/><br/>Ranveer Singh and the ensemble cast deliver career-defining performances, bringing the grit and emotional weight required for such a sensitive subject. The pacing is tight and the background score keeps you on the edge of your seat throughout the runtime.<br/><br/>This film is a must-watch for every Indian. March 2026 cannot come soon enough for Part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010178/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013863",
              "author": {
                "username": {
                  "text": "shreyasalkod"
                },
                "userId": "ur128115221"
              },
              "summary": {
                "originalText": "People who deny reality will hate this movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "When we talk about spy movies in India, it&#39;s just about how cool do you want your lead actor to look, and crazy the stunts should be, but never really focus on story or narration or screen play, we as audience never really felt the actually danger these leading hero&#39;s were in. But this movie showed the reality, and I could feel the tension of some of the sense as if I lived it, which tells you a lot about how well this movie was made.<br/><br/>Great work."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013863/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007141",
              "author": {
                "username": {
                  "text": "ChitranshD"
                },
                "userId": "ur203911064"
              },
              "summary": {
                "originalText": "The rush of drama meets the roar of spectacle"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is pure entertainment with a solid story and brilliant performances. Ranveer Singh leads the pack with intensity and charm. Sanjay Dutt delivers moments of authority and emotion, while Akshaye Khanna and R Madhavan add credibility and style. Arjun Rampal&#39;s action scenes are thrilling, and Sara Arjun&#39;s acting is surprisingly mature for her age. Aditya Dhar has crafted a movie that blends action, drama, and politics in a simple, engaging way. You feel every moment, laugh a little, and get thrilled a lot. A complete cinema experience."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007141/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11066528",
              "author": {
                "username": {
                  "text": "nikhilm-86882"
                },
                "userId": "ur123701321"
              },
              "summary": {
                "originalText": "You can't take your eyes off this movie for even a second."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Not a below 50 IQ YRF spy movie where Raw dances with ISI. Perfectly close to reality. Great attention to detail. Very well thought of movie. Acting is so perfect that you live within the movie. Just a perfect masterpiece. People calling names to movie but all the details shown in the movie are very real.<br/><br/>I had lost hope from bollywood but this movie made me believe in bollywood again."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11066528/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007222",
              "author": {
                "username": {
                  "text": "varunsinghvs-83597"
                },
                "userId": "ur118094047"
              },
              "summary": {
                "originalText": "A Story That Grabs You from Start to End"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s long runtime is justified by its immersive storytelling, gradually revealing layers of tension, moral conflict, and underworld intrigue. Ranveer Singh embodies a protagonist torn between duty and conscience, delivering moments of vulnerability interspersed with explosive intensity. Sanjay Dutt brings a commanding presence, ensuring that his scenes resonate with authority and menace. Akshaye Khanna and R Madhavan&#39;s performances are subtle yet impactful, reinforcing the story&#39;s emotional and strategic complexity. Arjun Rampal&#39;s quiet, controlled menace intensifies suspense, while Sara Arjun&#39;s heartfelt scenes provide emotional grounding. Aditya Dhar&#39;s direction balances explosive action sequences, meticulous plotting, and character-driven drama, ensuring that each sequence advances the story meaningfully. Cinematography captures both the sprawling chaos of Karachi and intimate human moments, while the score elevates every suspenseful, emotional, and action-packed moment. The final act delivers high-octane confrontations, strategic revelations, and emotional payoffs that leave audiences thoroughly engaged and exhausted in the best possible way."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007222/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11056520",
              "author": {
                "username": {
                  "text": "Popcorn_Critic"
                },
                "userId": "ur147790337"
              },
              "summary": {
                "originalText": "Dhurandhar: A Gripping, Intense Thriller That Keeps You Hooked Till the End"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping action-thriller with strong performances, intense storytelling, and well-executed action. The film maintains a serious tone throughout, backed by solid direction and impactful music. Engaging and satisfying. Rating: 9/10<br/><br/>Dhurandhar is a gripping action-thriller with strong performances."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11056520/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016110",
              "author": {
                "username": {
                  "text": "ShubhanshuB-7"
                },
                "userId": "ur211608034"
              },
              "summary": {
                "originalText": "It's must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurendar turned out to be a much richer film than I expected. The story builds steadily, the emotions feel real, and the performances add real depth to every scene. The pacing stays smooth, the visuals look great, and the music lifts the mood at the right moments. It kept me fully engaged from start to finish, and the ending stays in your mind long after the film is over. It easily deserves a full 10 from me."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016110/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007446",
              "author": {
                "username": {
                  "text": "YashD-148"
                },
                "userId": "ur211548092"
              },
              "summary": {
                "originalText": "A MUST WATCH CINEMA"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Words truly arent enough to describe this masterpiece Any attempt to summarize the plot praise the performances or analyze the direction feels utterly insufficient and risks cheapening the actual experience This is a film that demands to be seen felt and absorbed on its own terms From the first frame to the last the cinematic experience is absolutely captivating It manages to be emotionally profound visually stunning and intellectually stimulating all at once The chemistry between the leads is palpable the score is hauntingly beautiful and the direction is simply masterful."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007446/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11043853",
              "author": {
                "username": {
                  "text": "shubhabhatia"
                },
                "userId": "ur160060926"
              },
              "summary": {
                "originalText": "Watch it for an immersive cinema!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "So, I finally watched Dhurandhar and I must say that espionage is not a new genre lately but this one is quite different neither trying to be gimmicky nor preachy but more realistic...\nWhat really works is its pace, division of the plot into chapters and the BGM is bang on!!!<br/><br/>What a selection of songs...kudos!!!<br/><br/>The performances are superb and already ruling the social media although Ranveer looked a bit off initially but might be intentional to make him look naive being a spy.<br/><br/>It&#39;s not one with mindless bloodshedding, only a few scenes which made all sense and my eyes were closed😅\nIt brings something fresh and engaging storytelling.<br/><br/>Nevertheless, end credits left me more excited for part2\nMust watch..."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11043853/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014832",
              "author": {
                "username": {
                  "text": "rahuldodia"
                },
                "userId": "ur107369017"
              },
              "summary": {
                "originalText": "Awesome Movie!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story is commendable, and the acting stands out as the film&#39;s strongest aspect. The cast has performed admirably in their respective roles, and the music is also quite pleasing. Aditya Dhar has done an excellent job in guiding the cast to deliver their best performances. I eagerly anticipate the next installment.<br/><br/>The attention to detail in the movie is also remarkable. It would have been even more impactful if it had been entirely based on true events."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014832/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007026",
              "author": {
                "username": {
                  "text": "Sumedh2037182"
                },
                "userId": "ur199123491"
              },
              "summary": {
                "originalText": "Star Power Meets Storm-Level Intensity"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every sequence in the film is crafted with precision, balancing character arcs, suspense, and intense action. Ranveer Singh&#39;s layered performance oscillates between calculated aggression and moral introspection, making the protagonist compelling in every frame. Sanjay Dutt&#39;s commanding presence dominates key confrontations. Akshaye Khanna and R Madhavan&#39;s nuanced performances elevate the ensemble, while Arjun Rampal&#39;s controlled menace creates persistent tension. Sara Arjun&#39;s vulnerable yet impactful portrayal provides emotional stakes. Aditya Dhar directs with finesse, blending strategic storytelling with visually striking action. Cinematography captures both sprawling cityscapes and intimate exchanges. By the climax, tension and emotion reach a crescendo that is both thrilling and deeply satisfying."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007026/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}