{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": null,
          "hasNextPage": false,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11028826",
              "author": {
                "username": {
                  "text": "SurajN-21"
                },
                "userId": "ur211708278"
              },
              "summary": {
                "originalText": "This is an epic thriller by Aditya Dhar a proud nationalist...🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie focuses heavily on the sheer emotional and physical toll Hamza&#39;s double-life takes, building a palpable sense of tension and moral ambiguity as he fights to maintain his cover while facing the constant risk of exposure. It is a gritty, character-driven story about the extreme sacrifice required to serve a nation from the shadows...!<br/><br/>What an choreography acting,thriller,songs, editing and set building by the crew. Amazing and speechless, that this type of movie will hit the box office collection like a bullet train<br/><br/>Kuddos to the entire crew and Aditya Dhar... Well-done."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028826/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013068",
              "author": {
                "username": {
                  "text": "IAmStacey69"
                },
                "userId": "ur211587899"
              },
              "summary": {
                "originalText": "A Bold and Unfiltered Political Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is the kind of film that doesn&#39;t try to play safe. It directly points out how weak and confused the UP government looks when it comes to handling serious threats. The movie also doesn&#39;t hesitate to show Pakistan as a state that openly shelters and supports terrorism, and that bluntness actually gives the story a lot of weight.<br/><br/>What stands out is how real the frustration feels. The pacing is tight, the tension keeps building, and the political commentary hits hard without getting preachy. Whether someone agrees with its viewpoint or not, the movie stays confident in what it wants to say.<br/><br/>Overall, Dhurandhar works because it&#39;s bold, gritty, and not afraid to call out the things we usually tiptoe around. If you enjoy politically charged stories that mirror real-world messiness, this one delivers."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013068/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019720",
              "author": {
                "username": {
                  "text": "invincible-virus"
                },
                "userId": "ur23168091"
              },
              "summary": {
                "originalText": "Commercial movie with misleading content"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is good as long as audience know that they are watching fiction for the purpose of entertainment. However, there are mentions about real incidences and real footage has been show at few places; this misleads the audience into thinking that they are watching dramatization of actual events.<br/><br/>No real spy can survive as per the script of the movie and some turns of the story can only happen in fantasy - like daughter of a politician going against her father for a henchman and a politician who is too stupid and weak."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019720/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036029",
              "author": {
                "username": {
                  "text": "MdS-46827"
                },
                "userId": "ur209989776"
              },
              "summary": {
                "originalText": "entry of akshay khanna"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The entry of akshay khanna is epic the movie is not satisfied me but the entry of akshay khanna get me goosebumps in movie villain is main roler.but the brutal killing of people is so humilating director want to cut the so terrible scene because our country people is peaceful and happy.this type of scene make them disturb in mind."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036029/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010485",
              "author": {
                "username": {
                  "text": "BhaskarB-267"
                },
                "userId": "ur211566034"
              },
              "summary": {
                "originalText": "Blockbluster movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is very interesting and action movie movie is collected from public positive talk movie is best of 2025 the Great and movie ranbilkapur is very interesting acting you Will go it movie your family and friends it movie liked children locking so interesting movie is is High level and action and collecting."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010485/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026463",
              "author": {
                "username": {
                  "text": "Aditya_Bhattacharyya"
                },
                "userId": "ur32270014"
              },
              "summary": {
                "originalText": "Dhurandhar: A Brutal, Unflinching Spy Thriller That Raises the Bar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Mind-blowing and absolutely gripping, Dhurandhar is easily one of the most realistic spy films to come out of India. In tone and intent, it reminded me of Munich-but with far more relentless, hard-hitting action. Not for a single second does the film lose momentum; there is no filler, no boredom, only constant tension.<br/><br/>What truly sets Dhurandhar apart is its courage. It is unapologetic and brutally honest in its worldview, calling a spade a spade. It dares to call out the real enemies of India, clearly showing that the most dangerous threats to the country often come from within India itself, while Pakistan comes next. This clarity is rare in Bollywood, especially in a genre usually diluted with fantasy and politically safe storytelling.<br/><br/>The inner struggle of an Indian spy is portrayed with depth and realism-lonely, morally complex, and emotionally exhausting. The action sequences are raw and savage, and the Parliament attack footage, along with the chilling audio clips between cross-border hostile operatives and their handlers, sends shivers down the spine. These elements give the film a dark, haunting, and unforgettable vibe.<br/><br/>The music deserves special mention-totally energetic and operating at a different level altogether. The fusion of rap with Punjabi and qawwali elements creates powerful vibes and elevates the tension and intensity of the film brilliantly.<br/><br/>The set design is shockingly realistic. The recreation of Lyari Town in Bangkok is so authentic that you never once feel it was shot outside its actual location. It is a masterclass in immersive production design.<br/><br/>Casting and performances are excellent across the board. Ranveer is restrained, precise, and deeply impactful. Akshay delivers the character and performance of a lifetime. Arjun Rampal and Madhavan bring the same level of gravitas and conviction, while Rakesh Bedi leaves a strong impression as well. Every actor feels perfectly placed.<br/><br/>Editing and cinematography are top-notch, maintaining relentless pace while capturing the grit, brutality, and emotional weight of the story with precision.<br/><br/>This film single-handedly dismantles the glossy, shallow spy universes with trash storylines. Eagerly waiting for Part 2 in March 2026."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026463/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008354",
              "author": {
                "username": {
                  "text": "naveenshori"
                },
                "userId": "ur63237688"
              },
              "summary": {
                "originalText": "Ops Sindoor 2 is coming"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolutely awesome movie. Based on true events from 1999 AIR India hijack till little after Mumbai attack. You will love the story line based on Karachi gang war. It goes in length to show the terrorism originated in Pakistan against India. All the actors did justice to their role. Waiting for the part 2 REVENGE."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008354/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008989",
              "author": {
                "username": {
                  "text": "varsha-dubey"
                },
                "userId": "ur46605405"
              },
              "summary": {
                "originalText": "Kudos"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Very realistic showmanship of espionage! Main hero is not killing 1000 people to be seen as hero! Villains look like villains and makes your blood boil. The characters are in right costume and hair! Main lead&#39;s hair is better than mine :)<br/><br/>Overall a great watch and highly recommend it all audience. Do watch!"
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008989/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013230",
              "author": {
                "username": {
                  "text": "KalpeshM-36"
                },
                "userId": "ur211588662"
              },
              "summary": {
                "originalText": "!! Must Watch !!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must Watch!!<br/><br/>Dhurandhar is a gritty, intense, and ambitious spy-action thriller that successfully blends espionage with a Godfather-esque crime saga set in the Karachi underworld. It is a big-screen spectacle inspired by real-life R&amp;AW operations.<br/><br/>Director Aditya Dhar (of Uri fame) creates a compelling, immersive, and brutal world using a chapter-based narrative style."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013230/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11092676",
              "author": {
                "username": {
                  "text": "veekaycyr"
                },
                "userId": "ur128064309"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After Vishwaroopam, Dhurandhar is the only film that gave me that true world-class filmmaking feel. In both films, the antagonist roles had a strong impact and really connected with the audience. Everyone has competed fiercely and delivered top-notch performances part 2 was bad choice .. film end is perfect."
                }
              },
              "authorRating": 9,
              "submissionDate": "2026-01-03",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11092676/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003451",
              "author": {
                "username": {
                  "text": "sharmamanan-39149"
                },
                "userId": "ur88980680"
              },
              "summary": {
                "originalText": "Another gem from Aditya Dhar 💎"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie Review 🎬 - Dhurandhar\nRuntime: 3h 34m\nPublic Rating: 3.75/5\nPersonal Rating:4.5/5\n+ Spectacular cinematography &amp; performances from all characters, each getting equal screen time\n+ The first half offers an engaging setup of characters &amp; gang-war politics\n+ The second half stays closer to reality - many moments are inspired by real events\n+ Raw action sequences\n+ The love story is short &amp; subtle\n+ R. Madhavan&#39;s acting &amp; dialogues\n+ Exposes ISI &amp; terrorist networks in Pakistan<br/><br/><ul><li>Some viewers may find the film lengthy (but for me, it was engaging)</li><li>Contains lots of abusive language, which could&#39;ve been muted for family audiences, as there is no nudity in the film, and these days family audiences are fine with R-rated violent action &amp; bloodshed</li><li>I don&#39;t like films that become overly dramatic just to portray patriotism, but Dhurandhar doesn&#39;t even try to evoke a sense of patriotism in us - something Uri: The Surgical Strike did successfully</li></ul><br/><br/>My PUBLIC RATING for the movie is 3.75, but my PERSONAL RATING is 4.5.<br/><br/>I never felt the runtime was too long - in fact, it was necessary; otherwise, the story would have felt confusing.<br/><br/>I don&#39;t mind that the movie isn&#39;t fully family-friendly because of the abusive language. Families with kids usually tolerate violence but avoid films with abuses or nudity. That&#39;s why I&#39;m a bit disappointed, a film made in the national interest should have been suitable for kids &amp; young ones."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003451/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}