{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4v6dbjsqyxdo6ib7otxhnryrds4qabs34nd56pfaho6qebgnesk2dksoi2fxjchajdgnyq4z2n4axj6aun4queyxy",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11003448",
              "author": {
                "username": {
                  "text": "vinome-63249"
                },
                "userId": "ur189848569"
              },
              "summary": {
                "originalText": "Salute to the DHURANDHAR!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie stands as a masterclass in emotional depth and cinematic intensity.<br/><br/>Aditya Dhar brings an extraordinary vision to explosive action with raw human vulnerability. Every frame is crafted with precision, every twist lands with impact, and the emotional core of the story is handled with real sensitivity.<br/><br/>Ranveer Singh delivers a powerhouse performance subtle, fierce, and unforgettable. From his silent grief to his unstoppable determination, he carries the film with remarkable control. His portrayal of an undercover agent torn between duty and vengeance feels authentic and heartbreakingly real. The pain in his eyes, the intensity in the action sequences, and the restraint in emotional moments all combine to create a character audiences will remember long after the credits roll.<br/><br/>The raw videos and audio track of those horrible incidents gives goosebumps and give immense pride with moist eyes for the DHURANDHAR who keeps us safe !!!<br/><br/>The movie is a cinematic experience that resonates, thrills, and inspires every INDIAN!!!<br/><br/>HIGHLY RECOMMENDED AND SHOULD WATCH IN THEATRE TO MAXIMIZE YOUR EMOTIONS!!!<br/><br/>JAI HIND."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003448/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006561",
              "author": {
                "username": {
                  "text": "Tushar_kumar_tk"
                },
                "userId": "ur166746812"
              },
              "summary": {
                "originalText": "Action That Fires Up Every Moment"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative&#39;s layered storytelling keeps viewers on the edge, weaving political intrigue with heart-pounding action. Ranveer Singh delivers a commanding performance, capturing both strength and vulnerability, while supporting actors add dimension and authenticity. Director Dhar balances complex plotlines with visceral sequences, ensuring the film never feels rushed despite its length. Cinematography and sound design work together to heighten tension, making each scene feel immersive. The film&#39;s finale is a culmination of meticulous plotting and intense emotional stakes, leaving a lasting impression long after the credits roll."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006561/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11065217",
              "author": {
                "username": {
                  "text": "rahul_prasad_01"
                },
                "userId": "ur104563194"
              },
              "summary": {
                "originalText": "Ranveer Singh's Subdued yet Scorching Screen Presence Fuels this Power-Packed Karachi Mafia Thriller !!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Inspired by real-life incidents, Aditya Dhar&#39;s Dhurandhar is a sprawling action drama that plunges into the dark underbelly of Karachi&#39;s criminal world. The film follows Hamza Ali Mazari (Ranveer Singh), a shadowy Indian operative who infiltrates the city&#39;s powerful mafia network, rooted in the Lyari gang wars, to dismantle terror operations from within. Told across multiple chapters, the narrative unfolds with deliberate, immersive world-building, drawing viewers into a brutal, morally murky universe that stretches close to three and a half hours. Remarkably, the runtime seldom feels exhausting, thanks to Dhar&#39;s confident, tightly controlled storytelling.<br/><br/>One of the film&#39;s standout elements is its music and background score. By reimagining 70s and 80s Bappi Lahiri classics within a modern sonic framework, the soundtrack becomes an integral narrative force, sustaining momentum and amplifying the film&#39;s raw energy.<br/><br/>While &quot;Dhurandhar&quot; is positioned as a spy thriller rooted in the familiar RAW-versus-ISI conflict, its soul lies elsewhere. At heart, it resembles a &#39;Godfather&#39; style crime saga, an epic of power, loyalty, and betrayal set against Karachi&#39;s violent underworld. The scale and structure strongly suggest the foundation of a trilogy rather than a standalone film.<br/><br/>That said, the film isn&#39;t without flaws. Despite being set in the past, certain production design elements feel conspicuously contemporary and occasionally generic, slightly disrupting the period authenticity. The screenplay also slips into familiar stereotypes-such as a terrorist sneering, &#39;Hindus are darpok&#39;, a reminder of Bollywood&#39;s enduring reliance on well-worn narrative shortcuts.<br/><br/>Ranveer Singh delivers a commanding return to form, reclaiming his position at the top with a performance that is layered, controlled, and deeply internalized. Sporting long hair, a rugged beard, and an intense, unflinching gaze, his appearance may invite superficial comparisons to Ranbir Kapoor&#39;s &quot;Animal&quot;, but the tonality and emotional register are vastly different. Singh plays Hamza with restraint and menace, allowing silence and stillness to do much of the work. The supporting cast including Sanjay Dutt, Akshaye Khanna, Arjun Rampal, Rakesh Bedi, and Danish Pandor, add gravitas and texture, while Sara Arjun leaves a pleasant impression in her role.<br/><br/>An ideological extension of Uri&#39;s defining line &quot;Yeh naya India hai, yeh ghar mein ghusega bhi aur maarega bhi, Dhurandhar is unapologetically violent and unflinchingly long. Yet, for all its brutality and density, it remains gripping throughout, refusing to loosen its hold from the first chapter to the last."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11065217/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11076283",
              "author": {
                "username": {
                  "text": "iammuzwer"
                },
                "userId": "ur109547555"
              },
              "summary": {
                "originalText": "Strong Performances, Weak Impact"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is technically well-made. The visuals are impressive, the hero delivers a solid performance, and the villain is effective. The music and background score are good and help maintain the film&#39;s tone.<br/><br/>That said, the movie struggles to create impact. The storytelling feels overloaded with forced patriotism, making the narrative preachy rather than powerful. The portrayal of Pakistan is overly dark and simplistic, which removes any sense of realism or nuance from the conflict.<br/><br/>There are no real wow moments, no engaging twists or turns, and nothing that truly surprises. The film moves in a very predictable direction, making the experience feel flat despite its scale.<br/><br/>The hero-heroine pairing is another weak point. The chemistry doesn&#39;t work, and the noticeable age difference makes their scenes uncomfortable at times - occasionally feeling more like a father-daughter dynamic than a romantic pairing.<br/><br/>Overall, Dhurandhar has good visuals, performances, and music, but lacks freshness, emotional depth, and memorable moments."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-30",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11076283/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036992",
              "author": {
                "username": {
                  "text": "enjoyingengland"
                },
                "userId": "ur126120386"
              },
              "summary": {
                "originalText": "Pen's tremendous win over gun"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar proved something rare<br/><br/>You don&#39;t need hype, noise or controversy.<br/><br/>Respect the audience, tell the truth quietly and let people think. The masks people wore fell off on their own - not on screen but after.<br/><br/>Cinema won. Thank you Aditya Dhar, long live every individual who worked for Dhurandhar.<br/><br/>Entire Bollywood and Tollywood is silent, But the silence feels so loud. Dhurandhar challenges the assumption that scale, mythology, or language spread are necessary for historic success.<br/><br/>I never spent money to watch Bahubali 1 or RRR or Pushpa or KGF or animal in a theatre, I watched Bahubali 2 in theatre and regretted the loss of my time and money. But Dhurandhar I&#39;m so proud I watched it on a cinema screen.<br/><br/>It has been a week since I watched it but I just cannot get it off my head, I&#39;m a female and I am fine to excuse the extreme gore because everything else is top notch. Music is dope, I keep coming back for this drug every time Dhurandhar tries to slip away from my head.<br/><br/>Aditya Dhar respected audience by treating us like intelligent adults. This is clever cinema, money is the aftermath of the conviction this movie displayed. I wish it makes a record so high that only another Aditya Dhar movie can overcome it ever.<br/><br/>100/10 is my rating. Never felt a movie can win me over like the way this one did.<br/><br/>Bollywood has risen.<br/><br/>#Dhurandhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036992/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008063",
              "author": {
                "username": {
                  "text": "anshumanb-41856"
                },
                "userId": "ur112262582"
              },
              "summary": {
                "originalText": "Informative and engaging film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I LOVED THE MOVIE\nLETS TALK ABOUT THE THINGS I LIKED FIRST.<br/><br/><ul><li>I NEVER FELT LIKE DANCING IN A THEATRE BUT THIS WAS MY FIRST CAUSE EVERY SONG AND SOUNDTRACK MAKES ME FEEL I SHOULD JUST STAND AND DANCE ON THE BEATS LMAO.</li></ul><br/><br/>-I LOVED HOW THEY INTEGRATED SOME OF THE REAL STUFF LIKE IMAGES THE RED SCREEN VIDEOS AUDIO.<br/><br/><ul><li>INTENSE VIOLENCE AND GORE (I HAVE WATCHED MARCO AND ANIMAL)</li><li>PEOPLE DONT COMPARE THIS MOVIE WITH ANIMAL CAUSE ANIMAL IS COMPLETELY FICTIONAL WHILE THIS ONE IS ABOUT A SPY LIVING IN LYHIAA KARACHI WHILE COMPLETING ITS OBJECTIVE ONE BY ONE</li></ul>-DIALOGUES ARE NOT CRINGE(I WROTE THIS SINCE FOR LAST FEW YEARS BOLLYWOOD HAS REPUTATION OF PRODUCING CRINGE DIALOGUES)\n-ACTION SCENES AND SET DESIGN CINEMATOGRAPHY EVERTHING IS GR8.<br/><br/>NOW LETS TALK ABOUT BAD STUFF.<br/><br/><ul><li>SOME SCENES FELT STRETCHED LIKE THEY DONT NEED TO SHOW THIS MANY SHOTS FOR SAME THING</li><li>THE KIND OF RUINED THE FINAL CHAPTER IN A WAY SINCE THE FIGHT DIDNT FEEL SERIOUS IT WAS FEELING ALL HUMOROUS.</li></ul><br/><br/>9/10 FROM MY SIDE GIVING 10/10 BECAUSE OF PEOPLE GIVING 1 STARS ALOT FOR I DONT KNOW WHAT SO REASON!!!<br/><br/>HOPING THIS MOVIE DOES WELL AND EAGERLY WAITING FOR SECOND PART :)"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008063/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007083",
              "author": {
                "username": {
                  "text": "suhanarastogi"
                },
                "userId": "ur123187509"
              },
              "summary": {
                "originalText": "A Movie That Keeps You on Edge"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative unfolds with precision, tension, and emotional depth. Ranveer Singh delivers a powerhouse performance, embodying moral complexity, resilience, and physical courage. Sanjay Dutt brings authority and threat, while Akshaye Khanna and R Madhavan provide intelligent, layered support. Arjun Rampal&#39;s quiet menace intensifies suspense, and Sara Arjun&#39;s emotional scenes humanize the stakes. Aditya Dhar&#39;s direction seamlessly blends suspense, strategy, and high-octane action. Cinematography captures both the chaos of the underworld and intimate character beats, while the score punctuates tension and emotion. The climax delivers an unforgettable, multi-layered payoff."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007083/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006281",
              "author": {
                "username": {
                  "text": "anubhavvsharmaa"
                },
                "userId": "ur135622411"
              },
              "summary": {
                "originalText": "Very well researched!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "How the film stars with the exact scenario happened with Ajit Doval when he met the captives of IC814 sets the vibe that it&#39;s going to hit it with precision.<br/><br/>The BGM is on another level. Watch it with your people because you will have many chances to hoot together in the movie.<br/><br/>It&#39;s a 3.34 hours movie which felt short. 👏🏼👏🏼"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006281/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001896",
              "author": {
                "username": {
                  "text": "Shahadat_H_Rakib"
                },
                "userId": "ur168881153"
              },
              "summary": {
                "originalText": "A Must-Watch Spy Thriller with Stunning Execution"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a must-watch for anyone who loves intense spy thrillers.<br/><br/>Ranveer Singh delivers a powerhouse performance, and Sanjay Dutt, Akshaye Khanna, and Arjun Rampal shine in their roles. The film dives deep into espionage, underworld drama, and true patriotism with incredible intensity.<br/><br/>Unlike many modern films that rely heavily on green screen CGI, the sets in Dhurandhar feel real and immersive - the color grading is perfect.<br/><br/>I have to say, The real Dhurandhar is Aditya Dhar. What a talented director!<br/><br/>This movie keeps you hooked from start to finish. If it doesn&#39;t work at the box office, we all deserve YRF spy universe only!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001896/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001444",
              "author": {
                "username": {
                  "text": "dr-kannansundar"
                },
                "userId": "ur31418665"
              },
              "summary": {
                "originalText": "Outstanding film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great film with great acting the most perfect cast with the best roles especially R Madhavan and Ranveer Singh , kudos to the entire team for such a roller coaster ride. We wish the entire cast and crew especially R Madhavan and Ranveer Singh all the best and pray the film becomes a blockbuster for this year."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001444/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007453",
              "author": {
                "username": {
                  "text": "soumikghosh-28187"
                },
                "userId": "ur91718316"
              },
              "summary": {
                "originalText": "Great movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What a execution with bgm, best movie of the year. Aditya dhar is a great director... Bollywood should respect him. Dont judge by the ratings bcs some people don&#39;t want this masterpiece to be successful. The thing is more movies like will make it we encourage them by visiting the cinema , so pls watch at hall."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007453/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002667",
              "author": {
                "username": {
                  "text": "singhanshuman-60659"
                },
                "userId": "ur113423348"
              },
              "summary": {
                "originalText": "Must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "YRF should watch this movie on repeat till they understand what spy, espionage means.<br/><br/>This movie shows how to take creative liberty to elevate, explain and drive stories based on true events. Aditya Dhar you are man with genius brain. This movie take you to Lyari, Pakistan for 3 hours 30 minutes. Despite of being a more than 3 hours long movie at the ending you will crave for more.<br/><br/>Acting- 10/10\nDirection- 10/10\nBGM- 10/10\nStory telling- 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002667/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11057887",
              "author": {
                "username": {
                  "text": "pramanshree"
                },
                "userId": "ur32724577"
              },
              "summary": {
                "originalText": "Ok, Spy thriller movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Very Good script and ok acting.. was expecting Akshay Khanna to be like Kamal Hasan in Nataganor Vishwaroopam .. no where near those classic performances. Was expecting even more nuanced performance from Madhavan. Sanjay dutt was good and most important characters were well portrayed. I would rate Baby and Uri above this movie.."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11057887/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044206",
              "author": {
                "username": {
                  "text": "Lois_lane18"
                },
                "userId": "ur103022075"
              },
              "summary": {
                "originalText": "Relentless, Stylish, and Unapologetically Cinematic!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "2025 really saved its best for the end. Aditya Dhar, take a bow. If a 3.5-hour mammoth makes you completely lose track of time and still leaves you wanting more, you know it worked. This feels like Dhar fully absorbed the traditional action-entertainer template and then outgrew it on his own terms. To quote him, &quot;Cinema remembers the brave, not the agreeable,&quot; and that line fits this film perfectly.<br/><br/>Performance-wise, Akshaye &quot;Aura&quot; Khanna absolutely eats every scene he&#39;s in. So damn satisfying to see him finally get his due...charisma is so unreal, you end up rooting for him without even realizing it. Ranveer clearly understood the assignment, calm and composed when needed, absolute wrath of god when it matters. Arjun Rampal is menacing as hell and really needs to keep working with directors like this. Sanjay Dutt genuinely surprised me, way better than expected. Sara fits perfectly, gorgeous and vulnerable where required, and the supporting cast is solid across the board.<br/><br/>The action choreography is stylized but purposeful, it actually serves the narrative instead of existing just for spectacle. The soundtrack absolutely slaps. Shashwat goes insane here and elevates every scene to another level.<br/><br/>I need to talk about that car sequence bcz my god it&#39;s been living in my head rent-free ever since. Hamza driving, Rehman stuck in the back, tension squeezing tighter by the sec in that claustrophobic space...absolute cinema. I don&#39;t think I breathed once.<br/><br/>Late to the hype, but this is absolutely a big-screen film. I&#39;m going back for another watch. With the love it&#39;s getting, it already feels like it&#39;s earned that cult-classic status."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044206/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002096",
              "author": {
                "username": {
                  "text": "ankit4y"
                },
                "userId": "ur70854392"
              },
              "summary": {
                "originalText": "UNAPOLOGETIC. HIGH-VOLTAGE. ACTION"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ranveer Singh delivers a career-best, intense performance in Aditya Dhar&#39;s sprawling spy saga. It&#39;s a gritty journey into the heart of conflict, anchored by the sheer brilliance of Akshaye Khanna as the ruthless villain.<br/><br/>Aditya Dhar&#39;s Dhurandhar is an uncompromising, high-stakes action drama about a covert RAW mission infiltrating the deepest parts of the Pakistani underworld. Despite its lengthy runtime, the film grips you with its stylish direction and intense, realistic action sequences.<br/><br/>Yes, it&#39;s long (3h 34m), but the raw action, incredible background score, and relentless storytelling make it worth every minute. Go watch this cinematic epic!<br/><br/>Sequel of Dhurandar coming on 19 March 2026."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002096/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004443",
              "author": {
                "username": {
                  "text": "daisyshah_official"
                },
                "userId": "ur148698121"
              },
              "summary": {
                "originalText": "A true masterpiece in spy movies-don't miss it if you haven't seen it yet."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film offers a powerful and moving experience that truly touches your heart. Every scene resonates with genuine emotion and depth, showcasing heartfelt performances by all the Dhurandhars. With an engaging storyline and thoughtful direction by Aditya Dhar, it&#39;s a must-watch for fans of espionage and thrillers who appreciate storytelling that connects on a deeper level. Prepare to be captivated and emotionally involved-your eyes won&#39;t want to look away. Kudos to the team for creating such a meaningful movie worth experiencing in the cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004443/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003251",
              "author": {
                "username": {
                  "text": "thetanmaygupta"
                },
                "userId": "ur70249008"
              },
              "summary": {
                "originalText": "Espionage at Its Fiercest Dhurandhar Is a Monster of a Film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a masterclass in how to make a lengthy movie without ever letting the audience feel the runtime. Not a single scene drags, not a moment feels stretched the tight pacing, crisp writing, and gripping screenplay keep you hooked from start to finish.<br/><br/>The film is gory and loaded with cuss words, yet none of it feels forced or added for shock value; it blends naturally into the brutal, lived-in world Aditya Dhar builds, raw, grounded, and intensely real.<br/><br/>Akshaye Khanna is an absolute monster as Rehman Dakait hypnotic, terrifying, unforgettable.<br/><br/>Sanjay Dutt&#39;s SP Chaudhary Aslam brings that trademark heavyweight intensity, and Arjun Rampal as Major Iqbal looks ready to unleash his full monstrous aura in the second part you can already feel the storm gathering. Hats off to R. Madhavan and the entire team, because every performance and every technical choice lands with precision.<br/><br/>And despite its 3 hour 40 minute runtime, the film never feels draggy. Time just flies, and I didn&#39;t even realise it something that&#39;s happened to me only with a few truly immersive epics. I&#39;ve only felt this level of engagement in long films three times first with The Lord of the Rings, second with Zack Snyder&#39;s Justice League, and now with Dhurandhar. All three prove that runtime means nothing when the storytelling is powerful and the pacing is immaculate.<br/><br/>Honourable Mention Sashwat Sachdev&#39;s background score is pure adrenaline. It doesn&#39;t just support the film it drives it. Every beat hits like a pulse, every drop tightens the tension, and the whole soundtrack supercharges the film&#39;s spy-espionage mood.<br/><br/>This is the kind of BGM that turns scenes into moments and moments into goosebumps. Absolute fire.<br/><br/>#Dhurandhar #DhurandharReview."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003251/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003663",
              "author": {
                "username": {
                  "text": "shrofftiger-10994"
                },
                "userId": "ur151067682"
              },
              "summary": {
                "originalText": "Perfection is here"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie was so goated and wellmade. I didn&#39;t expected Aditya Dhar that he will make the movie this Good . Screenplay,Brutal Action Sequences,Visuals,Song timings and The Performance of everyone Each and Everything was perfect. This is the real Indian Cinema. Best part was that every main actor in the movie was at it&#39;s peak."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003663/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002354",
              "author": {
                "username": {
                  "text": "iAshu21"
                },
                "userId": "ur116784554"
              },
              "summary": {
                "originalText": "Dhurandhar - A Movie That Grabs You and Never Lets Go"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar doesn&#39;t waste a second. From the very first scene, it pulls you into the harsh reality of secret operations and the brave people who walk into danger like it&#39;s just another day at work. The performances hit hard. Ranveer brings that calm but deadly intensity. Akshaye Khanna barely speaks yet steals every frame. Arjun Rampal and Madhavan add real weight, and Sanjay Dutt is a complete powerhouse.<br/><br/>What really surprised me was how real everything felt. The shootouts, the tension in every mission, the details around the Parliament attack and 26/11... nothing feels exaggerated. The music and background score are mind boggling, giving the film that heartbeat you feel in your chest. Even the use of real clips and sounds made a few scenes straight-up chilling.<br/><br/>This is the kind of film that makes you feel proud, angry, emotional, and pumped all at the same time. I walked out thinking, this wasn&#39;t just entertainment... this was an experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002354/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007048",
              "author": {
                "username": {
                  "text": "harshitamishraaa"
                },
                "userId": "ur170944166"
              },
              "summary": {
                "originalText": "Drama That Paints Every Frame"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What begins as a slow, strategic exploration of a complex underworld gradually transforms into a high-stakes thriller that refuses to relent. Ranveer Singh&#39;s performance is layered, portraying courage, vulnerability, and calculated intellect with equal conviction. Director Dhar&#39;s storytelling combines psychological tension with kinetic action, making each scene impactful. The supporting cast complements the leads, each character contributing to the intricate web of crime and politics. The cinematography captures both grandeur and intimacy, making the cityscape a character in itself. The editing ensures that even the longest sequences remain taut, while the score amplifies suspense without overpowering the narrative."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007048/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008113",
              "author": {
                "username": {
                  "text": "sanjibanisudhasarangi"
                },
                "userId": "ur132421744"
              },
              "summary": {
                "originalText": "A Dark, Gritty and Deeply Engaging Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just a film - it&#39;s an experience. From the very first scene, it pulls you into a world built on fear, power, and deception, and it never lets go. The story of an undercover Indian agent infiltrating Karachi&#39;s mafia-terror network is handled with remarkable maturity. Instead of relying on typical spy clichés, the film focuses on psychological depth, moral conflict, and the dangerous grey zones of loyalty and identity.<br/><br/>Ranveer Singh delivers one of the strongest performances of his career. His transformation from a determined officer to a man slowly consumed by the world he&#39;s pretending to belong to is incredible to watch. Akshaye Khanna is equally brilliant - calm, clever, and quietly terrifying. Sanjay Dutt, R. Madhavan, and Arjun Rampal add immense weight to the narrative, making the film feel truly epic in scale.<br/><br/>The writing is sharp and layered. Every scene has purpose, every conversation pushes the story forward, and every character adds a new dimension to the central conflict. The world-building is exceptional - the film presents Karachi&#39;s underworld with such detail that it feels real, dangerous, and unpredictable.<br/><br/>The cinematography is breathtaking. Dark alleys, tense meetings, silent betrayals - everything is captured with a sense of style that enhances the mood without overshadowing the story. The background score is another triumph, turning simple scenes into moments filled with tension and emotion.<br/><br/>Yes, the film is long. Yes, it is heavy. But that&#39;s exactly what makes Dhurandhar special. It refuses to simplify the world it portrays. It makes you think, it makes you feel, and it stays in your mind long after the credits roll.<br/><br/>In a time when thrillers often feel repetitive, Dhurandhar stands out as a bold, ambitious, and beautifully crafted film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008113/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11051112",
              "author": {
                "username": {
                  "text": "msgopikrishnan-24694"
                },
                "userId": "ur134591019"
              },
              "summary": {
                "originalText": "One infiltrator. Two ruthless gangs. Velu Naicker vs. Reddyar - with an Indo-Pak undercurrent engineered as deception."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s a well-made film and an engaging thriller-but it is not a spy thriller, at least not yet.<br/><br/>The film lifts heavily from Nayakan, almost scene for scene:<br/><br/>Rehman&#39;s son being killed by rivals mirrors Surya&#39;s death.<br/><br/>The senior dacoit gang being wiped out at multiple locations in parallel is straight out of the sequence where the Reddiyars are eliminated after Surya&#39;s death.<br/><br/>The last rites of Rehman&#39;s son are visually and emotionally identical to Surya&#39;s funeral-religion aside.<br/><br/>Rehman stepping onto the balcony and waving to supporters after being rescued from the police is a clear echo of Nayakan&#39;s iconic balcony scene.<br/><br/>Nayakan works for Tamils; Rehman works for Balochs-both positioned as protectors of marginalized communities in their respective territories.<br/><br/>Rehman kills the senior dacoit; Nayakan kills the senior Reddiyar.<br/><br/>Rehman runs schools and hospitals for Balochs; Nayakan does the same for Tamils.<br/><br/>And this list could go on endlessly.<br/><br/>If anything, I&#39;m proud that Nayakan continues to influence Indian filmmakers decades later.<br/><br/>The film also borrows liberally from another classic gangster movie-Satya (Hindi). The entire infiltrator/outsider arc comes from there. Satya enters Mumbai as an outsider, works menial jobs (doodh-soda, anyone??), and gradually enters Bhiku Mhatre&#39;s gang. The scene where Ranveer Singh is shown his flat in a busy Mumbai locality, while Rehman&#39;s backstory is explained, is an almost exact lift.<br/><br/>Audiences today have short memories and are easily distracted. Label it a &quot;spy thriller,&quot; and many will miss how deeply it is stitched together from films people have already watched a hundred times-Nayakan and Satya.<br/><br/>Yes, Aditya Dhar has clearly done extensive &quot;research&quot; on Nayakan and Satya. And yes, I enjoyed the film. But I genuinely wish he had acknowledged Mani Ratnam and Ram Gopal Varma.<br/><br/>That&#39;s where Anurag Kashyap stands apart. In Gangs of Wasseypur, he openly acknowledged Bala, Ameer, and Sasikumar. Inspiration is fine. Borrowing is fine. But owning up to it matters.<br/><br/>My small comparison on Dhurandhar scenes with scenes from Mani Ratnam&#39;s Nayakan and Ram Gopal Varma&#39;s Satya (Hindi)."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-24",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11051112/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026198",
              "author": {
                "username": {
                  "text": "cksquare"
                },
                "userId": "ur16472896"
              },
              "summary": {
                "originalText": "Gang War movie disgiused as a Spy Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Basically it turned out to be a gang war/mafia movie. Where gangs were killing each other like Godfather etc.<br/><br/>These were interspersed with events that were meant to look real, ie Pak against India.<br/><br/>Look at this way... they made a gangwar movie... and then threw in Madhavan to show up every once in a while in the play, to make this a spy thriller.<br/><br/>And then of course to please today&#39;s bosses they also added dialogues.<br/><br/>Waste of time. Not sure what people who rave this, are watching!"
                }
              },
              "authorRating": 3,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 21
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026198/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007882",
              "author": {
                "username": {
                  "text": "dhruvprajapati-74681"
                },
                "userId": "ur125674272"
              },
              "summary": {
                "originalText": "Must watch, Best film of 2025🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; is absolute cinema at its finest-a relentless powerhouse that flawlessly blends raw intensity, bold storytelling, high-octane action, heartfelt romance, and edge-of-the-seat thrills. From start to finish, this film grips you with a rare combination of grit and passion, delivering an unforgettable experience that stays with you long after the credits roll. What sets &quot;Dhurandhar&quot; apart is its fearless narrative approach. The boldness in the screenplay, weaving together complex characters with authentic emotions, is refreshing and compelling. The story pulses with raw energy, never shying away from the darker, grittier elements that make the plot so immersive and realistic. Action sequences are choreographed with precision and flair, radiating pure fire with every punch and chase. Each scene is crafted to keep the adrenaline pumping without sacrificing clarity-making the thrills genuinely intense rather than chaotic noise. It&#39;s truly a masterclass in balancing action with storytelling. The love story is beautifully interwoven, providing genuine emotional depth amid the high stakes and relentless pace. This balance adds a human touch, making the characters&#39; journeys even more impactful and relatable. Cinematographically, &quot;Dhurandhar&quot; is stunning. Every frame is thoughtfully composed, blending dark hues and vibrant moments that visually echo the film&#39;s intense mood and tone. The camera work enhances every emotion and action sequence, amplifying the immersive quality that pure cinema should evoke. In short, &quot;Dhurandhar&quot; is everything a top-tier film should be-raw, bold, thrilling, passionate, and visually spectacular. It isn&#39;t just a movie; it&#39;s a flawless experience. A perfect 10/10 that sets a new benchmark for cinema lovers everywhere."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007882/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009256",
              "author": {
                "username": {
                  "text": "akshatmahajan"
                },
                "userId": "ur69496651"
              },
              "summary": {
                "originalText": "Amazing!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "That&#39;s how you make a spy action drama!! The drama, action and suspense; you name it, this movie had everything with a touch of reality of how agencies work and how spy actually works..<br/><br/>The story was inspired by true events and the details with which it is shown, it was just great! The screenplay though long, keeps you engaged and even with some pacing issues, it keeps you excited throughout the runtime.<br/><br/>The direction was good and you could see that the director had done proper homework before making the movie. The performances by all the cast members was just brilliant, everyone gave their best.<br/><br/>Overall, it was a good spy action drama and you should definitely give it a try. Its a must watch!"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009256/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}