{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6nbbktazcwzy476uxfnjqrtu4ybrt2ikt74hkalb6mqbdf4skydk2oeyvrnzyocwimpd5oxwkilm4fsttrwcc5c2a",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11012770",
              "author": {
                "username": {
                  "text": "theabhilove"
                },
                "userId": "ur103656856"
              },
              "summary": {
                "originalText": "Title: A Tense, Gritty Thriller Driven by Strong Performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is a gripping geopolitical thriller that blends high-stakes espionage with an emotionally charged narrative. Set against the backdrop of cross-border terrorism, the film follows an Indian intelligence operative who infiltrates hostile networks in Pakistan to stop a covert terror operation aimed at destabilizing India.<br/><br/>What works best in Dhurandar is its ability to maintain constant tension without resorting to unnecessary dramatization. The screenplay is tight, the pacing steady, and the atmosphere consistently intense. The film avoids simplistic patriotism and instead presents espionage as a world of moral ambiguity, personal sacrifice, and psychological pressure.<br/><br/>The lead actor delivers one of his finest performances-controlled, layered, and convincingly sharp as a field operative trained to think several steps ahead. The supporting cast, particularly the antagonist network&#39;s handler, adds depth and menace without feeling caricatured.<br/><br/>Technical execution is also commendable. The cinematography captures the covert world with muted tones and shadowy interiors, while the background score elevates moments of suspense without overpowering them. Action sequences are grounded and realistic, staying true to the genre.<br/><br/>If the film falters anywhere, it is in a few predictable story beats and an overlong second act. However, the final payoff is satisfying, with a climax that feels both thrilling and emotionally resonant.<br/><br/>Overall, Dhurandar stands out as an engaging spy thriller that combines geopolitical realism with cinematic flair. Fans of intelligence-driven stories like Baby, Raazi, or Special 26 will find plenty to appreciate here."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012770/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006789",
              "author": {
                "username": {
                  "text": "Najim45"
                },
                "userId": "ur198244107"
              },
              "summary": {
                "originalText": "Action That Blasts, Drama That Breaks"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative gradually builds tension, immersing audiences in a complex underworld where betrayal and loyalty collide. Ranveer Singh delivers a riveting performance, effortlessly balancing the duality of his character&#39;s moral conflict and relentless drive. Sanjay Dutt&#39;s presence adds weight, authority, and menace, while Akshaye Khanna and R Madhavan elevate the supporting ensemble with intelligent, layered portrayals. Arjun Rampal&#39;s understated menace keeps viewers on edge, and Sara Arjun&#39;s emotional authenticity adds poignancy. Aditya Dhar&#39;s direction orchestrates action, suspense, and character arcs with precision. Cinematography captures chaos and quiet moments equally, and the music punctuates tension masterfully. The finale is both thrilling and emotionally resonant, leaving a lasting impression."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006789/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026155",
              "author": {
                "username": {
                  "text": "Aryank-3035"
                },
                "userId": "ur211687452"
              },
              "summary": {
                "originalText": "Best movie ever watched"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Awesome movie just because of Akshay. Dhurandhar is a bold, sprawling spy drama anchored by strong performances and technical craft, but its length and narrative choices might not be for everyone. Many viewers are loving it in theaters, even as critics remain cautious - making it one of the most talked-about films of the year. Overall Reddit sentiment ranges widely - from 8-10/10 from many to critically disappointed takes, though the positives heavily outweigh the negatives."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026155/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010520",
              "author": {
                "username": {
                  "text": "rajputsunil-12093"
                },
                "userId": "ur158066387"
              },
              "summary": {
                "originalText": "A Subtle, Mature, and Perfectly Balanced Film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is a refreshing change from the usual loud storytelling. It&#39;s subtle, grounded, and lets every character shine in their own space. What I loved most is that no one is overpowered. Each role is strong, purposeful, and mature, creating a well-rounded ensemble that feels real.<br/><br/>The cast is filled with experienced actors who bring depth without ever slipping into exaggeration. Their performances are controlled yet impactful, making the emotional beats land naturally.<br/><br/>The background music deserves a special mention. It blends multiple styles like old, soft, dramatic, and energetic without ever overshadowing the scenes. Instead, it elevates them, adding a perfect rhythm to the story.<br/><br/>Overall, this film is one of the most balanced and thoughtfully crafted movies I&#39;ve watched recently. Subtle, engaging, and beautifully executed."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010520/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016320",
              "author": {
                "username": {
                  "text": "mskgupta"
                },
                "userId": "ur150926785"
              },
              "summary": {
                "originalText": "Excellent Super Duper"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the Best Movie of Decade, Non Stop Engagement, No Boring, No Drama, Goose Bumps Assured, Must Watch how Week the Previous Government, it Exposes the Reality of Indian Media, Its Exposes Reality of Aman Ki Asha, Its Exposes fakeism, its Exposes the Reality of Bollywood, One Word Must Watch in Movie Teathere 10 Times."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016320/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006648",
              "author": {
                "username": {
                  "text": "Hamzakhan34"
                },
                "userId": "ur198244050"
              },
              "summary": {
                "originalText": "This is Cinema You Can't Ignore"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s intensity comes from the masterful direction that balances sprawling action sequences with deeply personal character arcs. Ranveer Singh shines in the lead role, his performance oscillating between vulnerability and ruthless pragmatism. The ensemble cast brings credibility to the underworld politics, while every shot is composed to amplify tension and stakes. Action choreography is sharp and precise, and the cinematography captures both sprawling cityscapes and intimate human emotions with equal care."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006648/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006810",
              "author": {
                "username": {
                  "text": "Kallu55"
                },
                "userId": "ur198244192"
              },
              "summary": {
                "originalText": "The Movie Experience You've Been Waiting For"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses audiences in a world of calculated risks and moral dilemmas. Ranveer Singh&#39;s performance is exceptional, portraying a man whose internal conflict is mirrored by the external chaos around him. Sanjay Dutt adds commanding gravitas, while Akshaye Khanna and R Madhavan enrich the story with subtle, impactful performances. Arjun Rampal&#39;s controlled intensity keeps tension taut, and Sara Arjun&#39;s vulnerable portrayal adds emotional stakes. Director Aditya Dhar&#39;s vision blends strategic plotting with high-octane action seamlessly. Cinematography emphasizes both scale and intimacy, and the score elevates suspense. By the finale, the stakes are emotionally and visually breathtaking."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006810/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006861",
              "author": {
                "username": {
                  "text": "ytkzunzp"
                },
                "userId": "ur177078436"
              },
              "summary": {
                "originalText": "Action That Roars, Drama That Cuts Deep"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling unfolds with measured precision, slowly building stakes that culminate in a high-octane finale. Ranveer Singh&#39;s performance is nuanced, portraying a character caught between moral duty and survival instincts. The antagonist&#39;s menacing presence adds gravitas to the story, making confrontations genuinely tense. Director Dhar excels in crafting sequences where strategy, dialogue, and action intersect seamlessly. Cinematography captures both the grandeur and grit of the world the characters inhabit, while editing ensures a taut, immersive pace. The action is realistic and impactful, never gratuitous, and each scene feels meticulously choreographed. The background score underscores the tension without overshadowing performances, enhancing the narrative&#39;s emotional depth. By the end, viewers are left not only exhilarated but deeply invested in the characters&#39; journeys."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006861/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006517",
              "author": {
                "username": {
                  "text": "imdbfan-3852581436"
                },
                "userId": "ur198195821"
              },
              "summary": {
                "originalText": "Drama So Deep, Action So Loud"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative is a slow-burning testament to meticulous storytelling, capturing both the chaos and strategy inherent in high-stakes missions. Ranveer Singh&#39;s performance oscillates between controlled restraint and explosive emotion, anchoring the film&#39;s tension. Dhar&#39;s direction is assured, orchestrating complex sequences with clarity and style. Supporting actors enhance the story with believable, multi-dimensional portrayals. The cinematography and score elevate every moment, ensuring an engaging, immersive experience from start to finish."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006517/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11097707",
              "author": {
                "username": {
                  "text": "priyas-610"
                },
                "userId": "ur211798843"
              },
              "summary": {
                "originalText": "Wow movie unlike other director's (anurag kashyap or infact any director) faltu movies"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must watch movie, a true patriot nationalist &amp; Indian citizen can definitely say this movie have surpassed everything and made audiences to go to theatre without doing any promotion or creating awareness of this movie. I myself watched it thrice, unlike other director who just making same kind of rom com or take any movie of Anurag kashyap or other director they make same kind of non watchable movies, we seriously need director like Aditya Dhar where truth meets creativeness and he showed this really well. Hats off to him, all members involved in this movie making."
                }
              },
              "authorRating": 8,
              "submissionDate": "2026-01-04",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11097707/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015543",
              "author": {
                "username": {
                  "text": "parthap-61"
                },
                "userId": "ur211604031"
              },
              "summary": {
                "originalText": "Best movie of the decade"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Reality is served as it is , no additional drama,no bhaichara of raw and isi. This film represents pakistan is it is-a filthy , dirty and terrorist state . Director have a lot of courage to who made a film of 3:44 hoir movie which justify every second of it . Amazing cast , amazing acting and amazing screenplay . U won&#39;t feel bore out of it . A must watch movie , can&#39;t wait for the 2nd part ."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015543/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023185",
              "author": {
                "username": {
                  "text": "Surajk-0060"
                },
                "userId": "ur211665311"
              },
              "summary": {
                "originalText": "Biggest SPY movie of this era"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not only one off the best Indian spy movie but also it would be definitely one of the biggest bollywood movie. Must watch movie guys!!!<br/><br/>Every actors &amp; actresses who worked in this movie are incredible performance. Loved to seeing finally bollywood find his path of success of movie.<br/><br/>Also I would to share my experience of this movie about this film&#39;s director: ADITYA DHAR what a director and vision. Loved to seeing finally one director available in bollywood who believe in his hard work.<br/><br/>Love only LOVE."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023185/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11078035",
              "author": {
                "username": {
                  "text": "sanjubhat"
                },
                "userId": "ur67039799"
              },
              "summary": {
                "originalText": "A path breaking masterpiece .. unmissable!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar: An honest introspection.<br/><br/>Finally watched #dhurandhar .. pretty late compared to others who must&#39;ve watched it in the first week itself . I was reading and watching the hype around the film , the talk abt Akshaye Khanna&#39;s Rehman Dacait overshadowing Ranveer Singh&#39;s Hamza and finally after a misadventure that i shall mention at the end , I finally managed to catch the film in the theatre.<br/><br/>My honest perspective...\nFilm was fantastic .. a 3.5 hr film that keeps u hooked from start to end .. kuch toh hoga na .. Aditya Dhar .. hats off to u bro .. grt film indeed ..\nQuentin Tarantino ka chaap dikhayi deta hai isme, yet retaining its regional identity 👌👌.<br/><br/>Abt the Akshaye vs Ranveer hype ... All bullshit according to me. Both actors have held their own and r brilliant in their own right!! 👌👍\n.. each having their own space in the film with extremely well written characters. No one overshadows the other in any form. Sab bakwaas hai !!<br/><br/>The film is much more than just these 2 characters..\nRakesh Bedi as the devious politician, Sanjay Dutt as the encounter specialist cop , Arjun Rampal as the ISI chief whose hatred for India sends a shiver down ur spine, R Madhavans portrayal of Ajit Doval and Gaurav Gera as Ranveers handler in Pak - each and every one has given it their all to make it a memorable watch.<br/><br/>Now abt my misadventure.. going with the flow ,i had booked my tickets for 7th Dec and enthusiastically went to the cinema hall to watch it.<br/><br/>Upon reaching the cinema hall ( PVR cinemas at Phoenix Market City, Viman Nagar) i found out to my shock and horror that I had , in haste, booked tickets for PVR cinemas, at Phoenix Mall of the Millennium in Wakad , the other side of town instead 😁 .. Biwi se maar padi ..ouch 🤕🤕... But that&#39;s a story for another day .. ouch it still hurts 😅😅<br/><br/>#sanjuzzreviews #SanjayDutt #ranveersingh\n#RMadhavan #AkshayeKhanna #ArjunRampal\n#gauravgera #sanjuzzklikzz #sanjuzzclicks\n#travelmusketeers #filmreview #moviewreview\n#dhurandharmovie #DhurandharReview."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-31",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11078035/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006425",
              "author": {
                "username": {
                  "text": "mr-64837-94068"
                },
                "userId": "ur160787974"
              },
              "summary": {
                "originalText": "Cinematic Thrill Ride Begins Now"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The brilliance of Dhurandhar lies in its combination of visionary direction and stellar performances. The director balances complex political narratives with intense personal conflicts, creating a story that is both thrilling and deeply human. The lead actors bring conviction to their roles, delivering dialogues with power while maintaining emotional depth. The ensemble cast supports the story with layered performances, elevating even minor characters. Every action sequence is meticulously choreographed, yet the film never feels like spectacle alone-it&#39;s driven by character choices and motivations. Cinematic storytelling at its finest."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006425/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016168",
              "author": {
                "username": {
                  "text": "imdbfan-537291"
                },
                "userId": "ur204679507"
              },
              "summary": {
                "originalText": "Amazing bollywood movie ever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best movie so far\nMusic scenes all characters everything top knock.<br/><br/>Aditya dhar hats off\nAkshay khana sanjay dutt ranveer singh arjun rampal too good.<br/><br/>Amazing amazing everyone should wstch it in theatre once\nI watched it and my experience was fabulous. Goosebumps scenes and waiting for second part."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016168/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11032279",
              "author": {
                "username": {
                  "text": "mnvwdhw"
                },
                "userId": "ur172161351"
              },
              "summary": {
                "originalText": "Masterpiece by Aditya Dhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film remained and made it&#39;s place in my mind for many days and I couldn&#39;t try to not think of it. All the characters&#39; acting was mind boggling, the direction, the camera movement and the realism was on par. But the thing which fascinated me the most were the tightly written storyline amd screenplay by Aditya Dhar. Hamza had a very complex and emotionally nuanced character."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032279/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009965",
              "author": {
                "username": {
                  "text": "buyingdeepak"
                },
                "userId": "ur155575225"
              },
              "summary": {
                "originalText": "Best Spy Movie from India"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Excellent movie based on true events.<br/><br/>Each scene with details and cinematography.. awesome 👍<br/><br/>Starcast of the movie brilliantly choosen and everyone have played their character beautifully.<br/><br/>This movie depicts Indian history of last few decades and how terrorist from Pakistan have made vulnerable/unstable with their terrorism.<br/><br/>Enjoyed every bit of the movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009965/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013463",
              "author": {
                "username": {
                  "text": "VR2108"
                },
                "userId": "ur211589913"
              },
              "summary": {
                "originalText": "A theatrical experience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Super spoiler free review\nMovie is too engaging you won&#39;t even feel little bore inspite of being over 3 hours, and bgm is so good, the song selection is also very good and sonu nigam climax song too good. And acting of every character is also top notch. Action hollywood level, although little abusive language here n there but that too to make it feel realistic Overall a must watch."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013463/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017679",
              "author": {
                "username": {
                  "text": "avishekbose-85436"
                },
                "userId": "ur151302890"
              },
              "summary": {
                "originalText": "brilliant direction"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "True story, brilliant cinematography and direction and awesome music- 3 hr 30 min run justify it ... must watch.<br/><br/>Each character plays their part well. Villains will make you hate them - such is the power of their performances. Uncensored scenes and violence often makes it little hard to follow but it was necessary for the storyline."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017679/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010097",
              "author": {
                "username": {
                  "text": "sumedhsaini"
                },
                "userId": "ur150700914"
              },
              "summary": {
                "originalText": "Must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Aditya Dhar has created a masterpiece! You will be glued to the screen, you won&#39;t regret going to the theatres and watching this movie!&quot; The first 15 mins of #Dhurandhar are pure trauma. From IC-814 to the Parliament attacks, Aditya Dhar forces you to relive the helplessness before unleashing the solution."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010097/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025695",
              "author": {
                "username": {
                  "text": "navrishi-83901"
                },
                "userId": "ur69536331"
              },
              "summary": {
                "originalText": "Cult movie 🎇 christmas gift 🎁"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Such well made movie with such good acting that after 3.5 hrs you still want to see more. There is not a movement you feel bored or out of the grip of movie each actor like rakesh bedi and gaurav gera and Sara arjun play their role so well.only after rang de basanti movie I wanted to see again in theatre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025695/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11093101",
              "author": {
                "username": {
                  "text": "ananyatripathy"
                },
                "userId": "ur89353789"
              },
              "summary": {
                "originalText": "Mind-blowingly good"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I have watched it like 3 times now it is a once in decades kind of a movie hats off to Aditya Dhar the director this is just amazing everything is amazing!! The music of the movie is awesome the storytelling the research they have done for it is again mind-blowing must watch movie it shows the reality of the amazing (sarcastic) neighbour countries we have!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-03",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11093101/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006670",
              "author": {
                "username": {
                  "text": "thatha-56908"
                },
                "userId": "ur176628212"
              },
              "summary": {
                "originalText": "Emotion-Powered, Action-Fueled Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The director&#39;s choices in scene construction, pacing, and tension make the film immersive, while the performances bring authenticity to even the most dramatic moments. This film is a celebration of acting craft, cohesive storytelling, and confident direction.<br/><br/>Watching Dhurandhar is a lesson in how actors and directors can synergize to create unforgettable cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006670/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010315",
              "author": {
                "username": {
                  "text": "KomalJ-204"
                },
                "userId": "ur211565986"
              },
              "summary": {
                "originalText": "Just a perfect Spy Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "You cannot even miss a minute. It doesn&#39;t feel dragged. 3hrs 32 minutes but still cannot get over it! Loved it! Akshaye Khanna was stellar! So was Everyone else. But Akshay Khanna has outshined everyone. Cannot wait for 19th March 2026. Hope it will be another banger! Thank you Aditya Dhar for such a banger!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010315/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011051",
              "author": {
                "username": {
                  "text": "bhagwand-33"
                },
                "userId": "ur211571978"
              },
              "summary": {
                "originalText": "Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is amazing with great cinematography, story, although its a long movie of 3 hours 32 minutes but it doesnt feel like long even a single minute, i highly recommend it, specially the acting done by Akshay khanna, he nailed it.<br/><br/>Also the real call recording of 26/11 gives chilling experience, it makes us connect more to the story, the physics in the movie is not too bad too, and the music is great too, its indeed one of the best movies of 2025 in India and the world, the use of old songs was a great idea which feels good in the cinema, dont wait for the movie to come on OTT, go to cinema and enjoy it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011051/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}