{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6rdzktazcwzy472txxnbrr3t44az22imdv7plate6mqbdf4skydk2oeyv7nbyoaa4oczgfm2pm3wqgn4yxr7bfsvq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11008251",
              "author": {
                "username": {
                  "text": "goldysinghraj1"
                },
                "userId": "ur52481512"
              },
              "summary": {
                "originalText": "A Fantastic Watch - \"Dhurandhar\" Delivers Big!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watched Dhurandhar today, and wow-what an experience! The storyline is gripping from start to finish, layered with twists, emotion, and intensity that keep you glued to the screen. The film may run close to four hours, but not for a single moment did I feel bored or disconnected. It&#39;s one of those rare long films that earns every minute of its runtime.<br/><br/>The performances are absolutely top-notch. Ranveer Singh delivers a powerful and energetic act, but the real scene-stealer here is Akshaye Khanna. His performance is on another level-subtle, commanding, and utterly immersive. He effortlessly overshadows everyone whenever he&#39;s on screen, elevating the film with his sheer presence.<br/><br/>Every actor has given their best, the direction is sharp, and the storytelling is outstanding. Dhurandhar is easily one of this year&#39;s best films and a must-watch for anyone who loves solid cinema.<br/><br/>If you&#39;re ready for a gripping, well-crafted 4-hour ride, don&#39;t miss this one! 🎬🔥"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008251/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11066588",
              "author": {
                "username": {
                  "text": "adyutjaiswal"
                },
                "userId": "ur127890064"
              },
              "summary": {
                "originalText": "Akshaye Khanna absolutely killed it in Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshaye Khanna (as Rehman Dakait) absolutely killed it in Dhurandhar, delivering an amazing performance with incredible facial expressions that stole the show.<br/><br/>The movie is fantastic overall, featuring excellent direction and spot-on casting throughout. The songs are great, and the background music is intense and really drives the film&#39;s mood."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11066588/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013747",
              "author": {
                "username": {
                  "text": "PareshD-85"
                },
                "userId": "ur208087564"
              },
              "summary": {
                "originalText": "\"Where Real Events Meet Cinematic Greatness: Dhurandhar Review\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is easily the finest film of 2025 - no second thoughts about it. From the opening frame to the final moment, the story holds you in a tight grip and never lets go. The lead characters are written with remarkable depth, and each actor delivers a powerhouse performance that elevates the entire experience. Even the supporting cast shines, contributing meaningfully to every twist and turn.<br/><br/>The action sequences are intense, sharply choreographed, and executed with precision. What makes the film even more compelling is its ambitious storyline, rooted in real geopolitical events across the Indian subcontinent from 1999 to 2010. The way the movie blends actual news footage and historical moments into its narrative is seamless and impressive.<br/><br/>Despite the heavy themes, the screenplay knows exactly when to breathe - sprinkling smart, well-placed humour that lightens the mood after stretches of intense action and complex political and underworld drama.<br/><br/>Dhurandhar is not just a film - it&#39;s an experience. A definite must-watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013747/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018022",
              "author": {
                "username": {
                  "text": "adityak-9664"
                },
                "userId": "ur211624400"
              },
              "summary": {
                "originalText": "A Brilliant, Hard-Hitting Masterpiece ⭐⭐⭐⭐⭐"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; is an absolutely fantastic film that goes beyond entertainment - it delivers truth with courage and precision. The movie is factually accurate and brings out the real face of Pakistan&#39;s involvement in terrorism without resorting to exaggeration. Every scene feels deeply researched and authentic. The performances are stunning - each actor brings raw emotion and conviction to their roles, making the story feel incredibly real. The direction and screenplay deserve special mention for maintaining balance between realism and drama, keeping the audience engaged while confronting hard truths. Overall, Dhurandhar is not just a movie - it&#39;s an eye-opener. A must-watch for those who value powerful storytelling backed by facts and exceptional acting."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018022/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006779",
              "author": {
                "username": {
                  "text": "SakshiA-85"
                },
                "userId": "ur204501204"
              },
              "summary": {
                "originalText": "Explosive Action and Emotionally Strong Moments"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative grips you immediately, weaving a story that balances intellectual strategy with raw physicality. Ranveer Singh navigates complex emotions with layered subtlety, while Sanjay Dutt brings a palpable gravitas that anchors the high-stakes world. Akshaye Khanna and R Madhavan&#39;s performances are quietly commanding, and Arjun Rampal exudes a dangerous unpredictability that keeps audiences on edge. Sara Arjun adds a haunting human element, making the consequences of the story feel urgent. Director Aditya Dhar&#39;s skillful orchestration of plot and action ensures that tension escalates naturally. Cinematography captures the underworld with stark realism, while the musical score enhances every dramatic beat. The film&#39;s editing maintains momentum, letting suspense and character arcs coexist seamlessly. By the climax, the stakes are emotionally and physically elevated, making the film a powerhouse of smart action and resonant storytelling."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006779/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009228",
              "author": {
                "username": {
                  "text": "guptashradddha"
                },
                "userId": "ur196275048"
              },
              "summary": {
                "originalText": "Must Watch !!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "No other bollywood movies has ever done justice for a SPY film but don&#39;t be sad cos this movie has done it. Despite having 3.5 hrs of long runtime, this movie will make you glued to the screen till the last. I won&#39;t give any spoiler. Go and experience this masterpiece in the theater.<br/><br/>All the actors have done phenomenal job but this man has set the bar so high: Akshay Khanna💎"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009228/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006794",
              "author": {
                "username": {
                  "text": "Shadab98"
                },
                "userId": "ur198244122"
              },
              "summary": {
                "originalText": "When Stars Collide, Magic Happens"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film succeeds in creating a world that feels lived-in and dangerous, where every decision carries consequence. Ranveer Singh&#39;s performance is immersive, showcasing a man torn between conscience and survival. Sanjay Dutt brings gravitas and authority to his role, commanding attention effortlessly. Akshaye Khanna and R Madhavan provide layered support, and Arjun Rampal adds a menacing intensity that lingers long after his scenes end. Sara Arjun&#39;s emotional depth makes the stakes real and tangible. Aditya Dhar&#39;s direction expertly balances suspense, action, and character development. Cinematography and score combine to heighten tension, culminating in a finale that is both shocking and satisfying."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006794/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010721",
              "author": {
                "username": {
                  "text": "kshitij-03546"
                },
                "userId": "ur162947206"
              },
              "summary": {
                "originalText": "Brutal Honesty"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Some real cinema along the lines of nationalism... well done Aditya Dhar. The film does not only shows the hate sentiment in Pakistan but also shows the life of Dhurandhar beatifully who blends in with the underground. The reminiscence of his past or even reflections of murder showcase his conscience. All in all well written character."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010721/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006916",
              "author": {
                "username": {
                  "text": "VikramP-38"
                },
                "userId": "ur203913091"
              },
              "summary": {
                "originalText": "A Riveting Drama Fueled by Massive Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative unfolds like a chess game, each move calculated yet unpredictable. Ranveer Singh delivers a nuanced performance, balancing internal conflict with bold action. Sanjay Dutt adds gravitas, making every scene he inhabits memorable. Akshaye Khanna and R Madhavan provide layered, compelling support, and Arjun Rampal embodies understated menace. Sara Arjun&#39;s presence is quietly powerful, grounding the story emotionally. Aditya Dhar orchestrates a tense, immersive world where suspense, politics, and action collide. The cinematography is sharp and atmospheric, capturing both vast urban chaos and intimate emotional beats. The soundtrack and sound design heighten tension, and the climax delivers satisfying drama and high-stakes action."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006916/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020951",
              "author": {
                "username": {
                  "text": "Aditya-8648"
                },
                "userId": "ur211648985"
              },
              "summary": {
                "originalText": "The Best Bollywood movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best movie I have seen so far... The one and only best spy movie rather then all those circus spy movie of YRF. The cast is so perfect, specially the Akshay Khanna. Wt a performance man... All those critics get a life... All those incidents happened was so real all those r from the documentry.. the perfect movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020951/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11093807",
              "author": {
                "username": {
                  "text": "am-63627"
                },
                "userId": "ur122043101"
              },
              "summary": {
                "originalText": "Gamechanger For Indian Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ever wondered if Bollywood or Indian cinema could have ever created something as good as Hollywood? Well Dhurandhar is that movie but the catch is it is not only as good but surpasses that level.<br/><br/>Dhurandhar is one of those rare films that delivers on every front. From the very first scene, it pulls you into a tense, high-stakes world and never loosens its grip. The plot unfolds like a smart, layered thriller. Intense, unpredictable, and deeply engaging without ever feeling overstuffed or rushed. For a 3 hour long movie to pull that off goes to show how excellently crafted it is. After watching Dhurandhar I could without a doubt say that it is in my list of top 5 indian movies. You will hardly find such raw acting performances with such great screenwriting and action scenarios equivalent to a well crafted luxurious once in a lifetime movie.<br/><br/>Akshay Khanna being the craze all around the world after this movie is not some promotional hype. His acting performance in this movie is equivalent to the level of Al Pacino, I would go on to say even better, &quot;Yes&quot; even better all thanks to the writers who are able to bring out such raw performance from a great actor. From the Acting, Direction, writing and the music score everything adds up to create beautifully crafted unforgettable scenes that will stick with you for a long time. Trust me they will."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-03",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11093807/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013059",
              "author": {
                "username": {
                  "text": "Optimus_Rohit"
                },
                "userId": "ur198266916"
              },
              "summary": {
                "originalText": "Current govt. Propaganda Yet Majority Mindblowing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie redefines an Espionage Genre like Never Before and makes it so crisp and on edge that the length doesn&#39;t put you off or bore you. Almost 95% of the movie goes into this trance of Movie Magic but That 5% Current Govt. Propaganda shown by Aditya as a Director in the Form Of Madhvan&#39;s Ajit sir Character is Awful to say the least. I get why they can&#39;t criticize current govt. Is because the Censor Board Head Prasoon Joshi is a Boot Licker Of BJP and it&#39;s evident and thus Majority of the amazing scenes we got to see was because of that licking but apart from that Every Department gives their all for this movie from Direction to Acting to Cinematography to Music to Makeup to Screenplay, Everything is top notch and especially Akshay Khanna nailed the character of Rehman Dakait role with Finesse and holds the scene superbly. Ranveer was outstanding as Hamza as he goes undercover with creating his presence felt going forward in the movie. Sanju baba was Charismatic and Comic in this movie. Yet to see Arjun and Madhvan shine and i hope they do in the next part in March but this movie is worth Watching No Doubt about but I just hope Director&#39;s like Aditya Don&#39;t Hold His Inner Brutalness Reserved and get scared of current govt. And deliver&#39;s Mercilessly towards any govt. Aditya we as an Audience will back you if you be truthful towards yourself."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013059/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013289",
              "author": {
                "username": {
                  "text": "dharaneeshkh"
                },
                "userId": "ur128157143"
              },
              "summary": {
                "originalText": "Can't ask for anything more !"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just don&#39;t have words. No masala no fantasy no duets no dance no love no sex. Pure drama and real action. No faaltu content like Pathan jawan or Tiger ! Absolute master piece. Just dint know how 3.5 hours went by. Dint want the movie to finish after 3.5 hours ! Master class !! And what acting by the cast ! Awesome BGM especially if you are a 90s kid 😜Lov it !! Thanks Aditya Dhar for the master piece 🙏🙏🙏"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013289/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11045853",
              "author": {
                "username": {
                  "text": "prabhat524"
                },
                "userId": "ur29111880"
              },
              "summary": {
                "originalText": "What an amazing masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Don&#39;t watch this movie if you want to continue enjoying other Bollywood movies of spy genre, once you watch this movie, trust me, you can&#39;t go back to the usual movies, other spy movies look cringe in front of this one.<br/><br/>This movie appears to be a significant milestone in Indian Cinema, if you do want to watch this movie, please do so in theaters, we need to support these movies so that producers are forced to make movies like this to remain relevant in the industry."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11045853/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036086",
              "author": {
                "username": {
                  "text": "aatishagarwal"
                },
                "userId": "ur51377404"
              },
              "summary": {
                "originalText": "Unapologetic, Unfiltered, Unforgettable"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just a mind-gripping cinematic experience; it is also a path-breaker in the narrative set by earlier films of this genre. While many movies have put Pakistan in the spotlight for exporting terrorism to India, they often end on a soft, terror-sympathizing, pseudo-secular note. This film breaks that long-cast spell on Indian viewers and presents the brutal truth about Pakistan&#39;s nature and its intention to &quot;bleed India with a thousand cuts,&quot; without any sugar-coating. There is no artificial icing in the name of fake calls for peace and humanity when the other side continues to hurt us. The film makes it clear that there is no grey area in war, and this reality is portrayed unapologetically. It serves as a wake-up call for all Indians to understand their enemy better - Shatru Bodh. Aditya Dhar has delivered before with Uri, but Dhurandhar is on a different level. It is a masterpiece. Every character does complete justice to their role. The movie keeps you glued to your seat for 3.5 hours, and even then, you&#39;re left wanting more !!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036086/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016056",
              "author": {
                "username": {
                  "text": "Aniketa-71"
                },
                "userId": "ur203379867"
              },
              "summary": {
                "originalText": "Reality check"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Many people are reviewing it one star so that it didn&#39;t reach many people and many scenes are full real and some audio are also in this movie which didn&#39;t changed and the Indian critics didn&#39;t like this but they will give 10 for pathan where they show love between terrorist and army. So if anybody thinking why they should see this movie then let me tell you something interesting like it&#39;s the closest thing from what reality of terrorist is and the movie is a little too violant for bollywood but it&#39;s not too much and the character of Akshay Khanna is just amazing."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016056/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021191",
              "author": {
                "username": {
                  "text": "rockingjahnavi"
                },
                "userId": "ur160904864"
              },
              "summary": {
                "originalText": "Ranveer, dhar & the brilliance of realism"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a masterclass in espionage cinema Ranveer Singh disappears into his role, blending into Karachi gangs like a chameleon, every move and glance perfectly measured. Aditya Dhar&#39;s direction is audacious, meticulous, and fearless, from casting to music to the portrayal of real-life events, making every frame pulse with intensity. The ensemble cast, contextual action, and raw realism create a visceral, immersive experience that left me in awe and grateful for the brilliance of our spies and soldiers. Akshay khanna arjun rampal sanjay dutt the ballistic characters are goated, the resemblance with reality is uncanny, dhurandhar is the antidote of yrf spy universe disease, absolute cinema , all hail ranveer singh and aditya dhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021191/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006926",
              "author": {
                "username": {
                  "text": "SushantS-604"
                },
                "userId": "ur211547192"
              },
              "summary": {
                "originalText": "Best Indian Movie of 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the finest cinemas and spy thrillers made in India. Akshay Khanna&#39;s acting is world class. I was sceptical about long run time, but the pace of the movie was such that you don&#39;t have a moment of boredom. Amazing cinematography, background scores and music. Ranvir Singh&#39;s acting was very measured. Action sequences, they do look a bit over the top, but they make sense in the movie. Compared to action in so called action movies of Shah Rukh Khan, Salman Khan and also Animal movie, the action felt very natural and graceful. Very realistic dialogues, director didn&#39;t shy away from using choicest of abuse words, which actually go well with the sequences and the context of the movie (gangsters and mafia). In the beginning, it said that Netflix is their streaming partner, I felt that I really wasted money but can&#39;t say that now. Must watch only in cinema to experience the magic of this movie. Don&#39;t go by the stupidly bad reviews."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006926/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11057214",
              "author": {
                "username": {
                  "text": "nishantjangir-60498"
                },
                "userId": "ur156387767"
              },
              "summary": {
                "originalText": "Best movie ever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar comes across as a gritty, no-nonsense espionage thriller that aims to break away from the glossy patriotism often seen in Bollywood spy films. From the very first glimpse, the tone feels dark, intense, and grounded in realism rather than exaggerated heroics.<br/><br/>Ranveer Singh&#39;s transformation is the film&#39;s biggest strength. His rugged look and restrained aggression suggest a morally complex character-someone shaped by shadows, secrets, and sacrifice. The film seems less about flamboyant action and more about psychological tension, loyalty, and the cost of serving a nation silently."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11057214/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015611",
              "author": {
                "username": {
                  "text": "sunnymishra-62164"
                },
                "userId": "ur140745547"
              },
              "summary": {
                "originalText": "Best spy thriller movie of India."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s not Cringe like YRF SPY universe where hero(supposedly spy)doing Cringe dance and romance.<br/><br/>Dhurandhar Review:\nDirected by Aditya Dhar, Dhurandhar is a brutal, ambitious, and politically charged spy epic that moves Indian espionage cinema into a darker, more realistic, and grounded space compared to many of its recent peers.<br/><br/>Why it&#39;s being called one of the Best Indian Spy Movies\n* Grounded Realism &amp; Depth: The film is praised for moving beyond the typical &#39;spy universe&#39; clichés. It emphasizes the intricate machinery of espionage, political power games, and criminal networks with a level of research and authenticity often lauded by critics. It&#39;s less about the hero vacationing in exotic locations and more about covert gamesmanship and the high-stakes reality of intelligence work.<br/><br/>* The World-Building: Dhar&#39;s recreation of the Karachi underworld (shot across various locations) is described as grimy, layered, and lived-in, establishing a strong, immersive atmosphere that sets the tone for a dark, intense thriller.<br/><br/>* Masterclass Performances: The ensemble cast is a major highlight. Akshaye Khanna&#39;s portrayal as the menacing, cold, and calculating presence is frequently called a &quot;masterclass&quot; that steals the show. Ranveer Singh delivers a surprisingly subdued yet scorching performance, trading his usual flamboyance for a simmering intensity that holds the complex film together.<br/><br/>* Technical Excellence: The film&#39;s craft is considered top-notch, featuring muscular set-pieces, powerful background music (BGM), and cinematography that builds a genuinely cinematic and epic feel.<br/><br/>Areas where it receives criticism\n* Lengthy Runtime: The film, with a runtime of over three hours, is often described as too long or &quot;stretched,&quot; particularly in the first half. A significant number of viewers felt a tighter edit would have elevated the pacing.<br/><br/>* Saving for Part 2: Some reviews felt the momentum dipped in the second half, suggesting the narrative was too focused on setting up a bigger story for a confirmed sequel, leaving the ending of the current film feeling slightly underwhelming in terms of final closure.<br/><br/>Overall Verdict as a Spy Film:\nDhurandhar is a powerful, well-made, and gripping political spy thriller. It takes a bold, uncompromising approach to the genre, prioritizing realism, complex politics, and strong character work over formulaic action.<br/><br/>While its runtime and intense nature might not suit everyone, for fans of dark, deeply researched espionage dramas that aim for cinematic scale and realism, Dhurandhar is a must-watch and absolutely stands tall as a strong new benchmark in Indian spy cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015611/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11047038",
              "author": {
                "username": {
                  "text": "imdbfan-6577919711"
                },
                "userId": "ur198450965"
              },
              "summary": {
                "originalText": "Don't sleep on the best 2025 movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Epic direction, killer storyline, and songs that hit hard. Those 3.5 hours? Gone in a flash. Ranveer Singh, Akshaye Khanna, and Aditya Dhar steal the show, but don&#39;t sleep on deliveries from Arjun Rampal, Rakesh Bedi, R Madhavan, Sara Arjun, and Danish Pandor. Keep in mind that violence is next level but the killer storyline and acting performances very well compensate for it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11047038/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006555",
              "author": {
                "username": {
                  "text": "shusant_55"
                },
                "userId": "ur210344194"
              },
              "summary": {
                "originalText": "A Power-Packed Blast of Entertainment"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story&#39;s slow-burn approach allows characters to evolve organically, making each twist and revelation feel earned. Ranveer Singh commands the screen, delivering a nuanced performance that conveys both determination and inner turmoil. Director Dhar&#39;s execution of action and suspense is precise, creating a balance between thrilling sequences and quiet character moments. The cinematography captures the atmosphere of danger, while the score accentuates tension at every turn. Supporting actors shine in their roles, each adding layers to the intricate tapestry of narrative and emotion, culminating in a finale that is as satisfying as it is intense."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006555/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025890",
              "author": {
                "username": {
                  "text": "Quirk-25"
                },
                "userId": "ur211684476"
              },
              "summary": {
                "originalText": "Dhurandhar-A Thoughtful and Responsible Take on History"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What I really appreciated about Dhurandhar is the care and responsibility with which history has been portrayed. In a time when many films twist historical events for shock value or convenience, this one chooses honesty and balance. It doesn&#39;t feel exaggerated or agenda-driven; instead, it feels thoughtful and sincere.<br/><br/>The film presents its characters as real people rather than symbols, which makes the story more believable and emotionally engaging. You can sense the effort put into research and storytelling, and it shows in the way events unfold naturally. The performances and direction support the narrative without overpowering it, allowing the history itself to take center stage. Dhurandhar is a strong example of how cinema can respect the past while still keeping the audience invested."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025890/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006468",
              "author": {
                "username": {
                  "text": "zpdizalw"
                },
                "userId": "ur176953130"
              },
              "summary": {
                "originalText": "A Story Driven by Stars and Strength"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The director&#39;s ability to balance high-stakes action, political intrigue, and emotional depth is remarkable. The lead actor delivers a powerhouse performance, perfectly capturing the complexity of a man caught between duty and morality. Supporting actors are equally compelling, each adding layers to the story rather than merely filling space. The antagonist is chilling, nuanced, and brings real tension to the narrative. The ensemble cast works in perfect harmony under the director&#39;s guidance, making even small interactions meaningful. The pacing never falters, with each twist and turn perfectly timed, and the final sequences are as gripping as they are emotionally resonant."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006468/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011022",
              "author": {
                "username": {
                  "text": "abhijeetbishnoi"
                },
                "userId": "ur27940301"
              },
              "summary": {
                "originalText": "A must watch.."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar (2025) is a gripping cinematic experience that blends raw emotion, sharp storytelling, and powerful performances into one unforgettable package. The film dives fearlessly into ambition, betrayal, and destiny, crafting a narrative that stays with you long after the credits roll. Director Manish Verma demonstrates remarkable control over pace and tension, unfolding each twist with precision and purpose.<br/><br/>Ranveer Singh delivers one of his strongest performances to date-layered, intense, and deeply human. His transformation throughout the story is both heartbreaking and inspiring. The supporting cast adds depth, especially in scenes where personal motives collide with larger moral conflicts. Every character feels alive, flawed, and memorable.<br/><br/>Visually, Dhurandhar excels. The cinematography captures the grit of the streets and the grandeur of power with equal finesse. The background score elevates key moments, adding emotional weight without overpowering the scene. Action sequences are choreographed realistically, maintaining impact without unnecessary exaggeration.<br/><br/>What sets Dhurandhar apart is its honesty. It does not romanticize struggle or success; instead, it shows the cost of choices and the fragile nature of power. The script is sharp, often poetic, and leaves room for interpretation.<br/><br/>Overall, Dhurandhar (2025) is a bold, compelling film that deserves praise for its storytelling vision and emotional depth. A must-watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011022/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}