{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xoddjntazcwzy472wx5njyrls4obb53iotx4hjaxdomqbdf4skydk2oa4vvnryochsqppitj2erachlkkgthkszvkq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11040634",
              "author": {
                "username": {
                  "text": "mandarmulay"
                },
                "userId": "ur165244052"
              },
              "summary": {
                "originalText": "Awesome movie. Great acting."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is based on Lyari in Karachi Pakistan, the gang wars in Lyari, infiltration of Indian intelligence in Karachi gangs.<br/><br/>It broadly covers various terrorist attacks carried out by ISI in India in the last decade and the course correction made by Indian intelligence agencies. Overall acting by all the actors is very good."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11040634/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010544",
              "author": {
                "username": {
                  "text": "imdbfan-3453108771"
                },
                "userId": "ur197913515"
              },
              "summary": {
                "originalText": "Powerful"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If you wanna watch something raw, rusty, and real, go and watch Dhurandhar. Nothing manipulative, no sugar coating for the nation we actually know hates us. The BGM is powerful, the action is remarkable, and the performances were lethal. If you watch it from an unbiased perspective, you will still fall for the amazing vision of Aditya Dhar. And if you stand strongly with the nation, then it will be a treat for you."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010544/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023206",
              "author": {
                "username": {
                  "text": "sushilpnoida"
                },
                "userId": "ur149903039"
              },
              "summary": {
                "originalText": "Brilliant must see"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie of the year 2025, all indians and even outsiders must see how Pakistan uses the money received from IMF, China, and western countries like US/UK to fund terrorism through radical Islam. Top level performances from all actors including Rakesh Bedi who has been a fine actor all through. The music is great too."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023206/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007096",
              "author": {
                "username": {
                  "text": "Aayan4278022968"
                },
                "userId": "ur199127931"
              },
              "summary": {
                "originalText": "A Masterclass in Drama Backed by Explosive Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watching this film is like stepping into a carefully orchestrated storm. Ranveer Singh anchors the narrative with intensity and vulnerability, while Sanjay Dutt exudes the authority of a man shaped by power. Akshaye Khanna and R Madhavan complement him with nuanced performances, giving weight to each subplot. Arjun Rampal and Sara Arjun enhance the emotional stakes, making danger feel immediate. Director Aditya Dhar&#39;s vision ensures that tension builds naturally, interspersed with action sequences that are both thrilling and realistic. Every frame, from sweeping cityscapes to intimate confrontations, feels purposeful, and the soundtrack amplifies every moment of suspense."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007096/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013448",
              "author": {
                "username": {
                  "text": "AkashS-013"
                },
                "userId": "ur206022001"
              },
              "summary": {
                "originalText": "Best movie in past 20 years I have ever watched"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must watch for sure, its what everyone shud be aware about what exactly is the reality of some particular nati@ns and how our own industry is hiding the reality in the name of aman ki aasha and bhaaichara ..\nleast you can do is miss a movie like this, people should be aware of facts , and there should be talk about such arts."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013448/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018631",
              "author": {
                "username": {
                  "text": "imharyjag"
                },
                "userId": "ur93116791"
              },
              "summary": {
                "originalText": "Very realistic..shows true face of terrorists."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch..waiting for part2. This shows tru face of terrorism and the so called jihadis in this word. So far bollywood was only pramoting films which were sponsored by goons. Now first time someone from bollywood dared to show truth. No politics of appeasement. It shows real truth behind 26/11 mumbai terrorist attacks and all other attacks happened in india."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018631/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006669",
              "author": {
                "username": {
                  "text": "gitanjalishah"
                },
                "userId": "ur196233253"
              },
              "summary": {
                "originalText": "A Powerful Tale Delivered by a Mega Cast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a film where the director&#39;s vision and the actors&#39; craft are in perfect harmony. The narrative unfolds with intelligence, keeping audiences engaged throughout its runtime. The lead actor immerses completely into the role, balancing intense action with emotional depth. Supporting actors are equally compelling, providing nuance that makes the world feel lived-in. The director&#39;s attention to detail, whether in shot composition, pacing, or character development, magnifies every performance. Action, suspense, and political drama are interwoven seamlessly. This is a movie where direction and acting don&#39;t just coexist-they elevate each other to create an unforgettable cinematic experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006669/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007146",
              "author": {
                "username": {
                  "text": "ShanuD-7"
                },
                "userId": "ur203912224"
              },
              "summary": {
                "originalText": "Big emotions, bigger battles, and the biggest stage"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a film that grabs you from the start and doesn&#39;t let go. Ranveer Singh dominates the screen with high-energy action and emotional depth, while Sanjay Dutt&#39;s presence gives the film extra weight. Akshaye Khanna and R Madhavan perfectly balance the drama, and Arjun Rampal makes the action scenes look effortless. Sara Arjun&#39;s scenes are memorable and emotional. Aditya Dhar&#39;s writing and direction are sharp, making a complex story easy to follow. The blend of action, drama, and real-world events makes this movie very exciting and worth every second."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007146/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015089",
              "author": {
                "username": {
                  "text": "AnushkaD-56"
                },
                "userId": "ur211599807"
              },
              "summary": {
                "originalText": "MUST WATCH"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a standout film that blends strong music, solid acting, and a gripping storyline into one smooth experience. The songs elevate every scene, the performances feel real and engaging, and the plot keeps you invested without dragging. It&#39;s a well-balanced movie that entertains from start to finish and leaves a lasting impression."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015089/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11060771",
              "author": {
                "username": {
                  "text": "atharvasaxena"
                },
                "userId": "ur112253216"
              },
              "summary": {
                "originalText": "Waiting for part 2"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie has Fantastic characters. Akshay Khanna has played a very strong role.<br/><br/>Strong direction and immersive world-building.<br/><br/>The action in the movie is good, and we will be waiting for second part.<br/><br/>✔ Strong performances across the cast\n✔ Tightly built first half and compelling narrative world\n✔ Authentic action and sound design."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11060771/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11047582",
              "author": {
                "username": {
                  "text": "Rishikaaa-3"
                },
                "userId": "ur211865245"
              },
              "summary": {
                "originalText": "Best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshaye Khanna as rehman daikat is so good and his acting skills... oh god mind blowing. Arjun rampal as major iqbal casting is so good and real overall the movie is showing the reality and it&#39;s good... Aditya dhar&#39;s movie is best. Rehman and his wife is looks like power couples akshaye is looking so much handsome at the age of 50."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11047582/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006947",
              "author": {
                "username": {
                  "text": "Aditya8713"
                },
                "userId": "ur199122440"
              },
              "summary": {
                "originalText": "Stars Bring Fire, Story Brings Soul"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is intelligent, gradually revealing layers of intrigue, tension, and emotion. Ranveer Singh delivers a performance that is both intense and reflective, Sanjay Dutt adds commanding presence, and Akshaye Khanna and R Madhavan provide layered support. Arjun Rampal&#39;s understated menace keeps viewers on edge, and Sara Arjun&#39;s emotional performance makes the stakes feel real. Aditya Dhar&#39;s direction orchestrates suspense, drama, and action perfectly. Cinematography captures sprawling environments and intimate exchanges, while the soundtrack heightens every dramatic beat. The climax delivers thrilling action and emotional satisfaction simultaneously."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006947/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024213",
              "author": {
                "username": {
                  "text": "omkarnaik-25906"
                },
                "userId": "ur88918143"
              },
              "summary": {
                "originalText": "Excellent movie 👌"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I walked into Dhurandar with curiosity, but I walked out with admiration. This is one of those films that doesn&#39;t just entertain you for a couple of hours and then fade away-it lingers. From the very first frame, Dhurandar makes it clear that it has something to say, and more importantly, it knows how to say it with confidence, restraint, and power.<br/><br/>What struck me the most was how grounded and sincere the film feels. There&#39;s an honesty in the storytelling that&#39;s rare these days. Nothing feels forced or exaggerated just for effect. Every scene seems to serve a purpose, every moment adds weight, and that kind of tight, thoughtful filmmaking deserves respect. The pacing is excellent-it never rushes, yet it never drags. I found myself completely immersed, the kind of immersion where you forget to check your phone or look at the time.<br/><br/>The performances are truly commendable. You can feel the effort, the preparation, and the emotional investment behind each character. There&#39;s a rawness that makes the characters feel real rather than written. Dialogues land with impact, not because they&#39;re loud or dramatic, but because they&#39;re believable. Some lines stay with you long after the movie ends, and that&#39;s a sign of strong writing paired with even stronger delivery.<br/><br/>Technically, Dhurandar is solid and confident. The visuals are striking without being flashy, and the background score complements the mood perfectly instead of overpowering it. The direction deserves special praise-the filmmaker clearly trusts the story and the audience, allowing moments to breathe instead of spoon-feeding emotions.<br/><br/>What I appreciated most is that Dhurandar respects its viewers. It doesn&#39;t underestimate your intelligence, and it doesn&#39;t rely on shortcuts. It&#39;s the kind of film that reminds you why cinema matters-not just as entertainment, but as an experience.<br/><br/>In my opinion, Dhurandar is a powerful, well-crafted film that deserves to be watched, discussed, and remembered. It&#39;s bold, sincere, and impactful-and I&#39;m genuinely glad I experienced it on the big screen."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024213/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020211",
              "author": {
                "username": {
                  "text": "SahilG-38"
                },
                "userId": "ur205082102"
              },
              "summary": {
                "originalText": "A Sharp, Engaging Thriller That Delivers More Than Expected"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film runs for 3 hours and 30 minutes, yet not once did I feel bored. From the very first scene to the last, it kept me completely hooked. The energy, the pacing, the tension, everything was on point. The performances were outstanding across the board. It wasn&#39;t just Akshaye Khanna who delivered; every actor brought their best and added real weight to the story.<br/><br/>What impressed me even more was the use of real images, real footage, and actual recordings. It added a layer of authenticity that made the whole experience even more gripping. Truly mind-blowing work from the entire team."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020211/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018111",
              "author": {
                "username": {
                  "text": "Adrian-5494"
                },
                "userId": "ur211624326"
              },
              "summary": {
                "originalText": "Bold, unflinching and Brilliant"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar isn&#39;t just another spy thriller, it&#39;s Aditya Dhar&#39;s most ambitious and emotionally charged work yet. The film takes you into the heart of espionage, but what really sets it apart is the soul behind the spectacle. Every frame feels intentional, every silence carries weight, and every character has a heartbeat.<br/><br/>Ranveer Singh delivers one of his strongest performances to date, raw, layered, and hauntingly real.<br/><br/>Akshaye Khanna, Sanjay Dutt and the rest of the cast match that intensity, grounding the chaos with conviction. There&#39;s action, yes, but there&#39;s also philosophy, pain and patriotism that doesn&#39;t feel preachy.<br/><br/>The pacing is fearless, long, but never dull. Dhar proves that patience can be powerful when the storytelling is this sharp. The cinematography and score elevate the experience to something cinematic yet deeply personal.<br/><br/>🔥 10/10, a must-watch for anyone who still believes cinema can be both massive and meaningful."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018111/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014558",
              "author": {
                "username": {
                  "text": "rajr-10602"
                },
                "userId": "ur85244092"
              },
              "summary": {
                "originalText": "Cinema🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolute banger of a film from start to finish. This is the kind of movie that reminds you why cinema is such a powerful medium. The cinematography alone is worth the price of admission-every frame feels intentional, visually striking, and emotionally charged. The lighting, color grading, and camera movement work in perfect harmony to elevate even the smallest moments, making the world of the film feel immersive and alive. It doesn&#39;t just look good for the sake of looking good-it serves the story at every step.<br/><br/>The casting is genuinely flawless. Each actor feels handpicked for their role, delivering performances that feel raw, natural, and completely believable. There&#39;s no weak link in the ensemble; everyone brings their A-game. The chemistry between the characters is electric, whether it&#39;s tension, friendship, rivalry, or quiet vulnerability. It&#39;s one of those rare cases where great writing actually meets great acting-and the result is unforgettable.<br/><br/>The direction is tight, confident, and focused. There&#39;s no wasted time, no unnecessary detours, and absolutely no bullshit padding the runtime. Every scene pushes the story forward with purpose. The pacing is razor-sharp-never rushed, never dragging. The director clearly trusted the audience&#39;s intelligence and didn&#39;t feel the need to spoon-feed anything, which makes the experience even more satisfying.<br/><br/>And the plot? Clean, powerful, and brilliantly executed. No pointless subplots, no forced twists just for shock value-just a strong, well-structured story that knows exactly what it wants to be. It hits hard emotionally, keeps you engaged intellectually, and leaves a lasting impact long after the credits roll.<br/><br/>This is a must-watch. If you care about great filmmaking, compelling performances, and storytelling without fluff, this movie absolutely delivers."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014558/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005437",
              "author": {
                "username": {
                  "text": "anujresidentevil-41038"
                },
                "userId": "ur69534839"
              },
              "summary": {
                "originalText": "Tightly written movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Loved the movie , very well paced, though it was long, didn&#39;t feel like it. Action was precise and blood and gore was on never unnecessarily used, whenever there was gore or violence, it felt like it was supposed to be there. Akshay Khanna was the highlight, ranveer was shining as well. Madhvan nailed it.. whoever is planning to go, can go watch this movie. Just keep in mind,it&#39;s strictly adult filt(for language and gore).. btw could&#39;ve avoided some jokes and that one item number was not really required,but it was placed in a manner that it felt not so off putting. All in all, one of the best movie of 2025 and probably the best big budget spy movie I&#39;ve seen.."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005437/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016977",
              "author": {
                "username": {
                  "text": "saurabhcivilengr"
                },
                "userId": "ur128435997"
              },
              "summary": {
                "originalText": "Must watch, amazing storytelling and soundtrack"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It is a must watch, preferably with good sound system. Akshay is phenomenal and ranveer and madhvan are a delight to watch.<br/><br/>The story telling is just too good. Not a single minute is wasted. No nudity or unnecessary love scenes. The story is based on many small true stories. Just go for it you&#39;ll like it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016977/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026006",
              "author": {
                "username": {
                  "text": "VedP-47"
                },
                "userId": "ur211686864"
              },
              "summary": {
                "originalText": "A Different Blend"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "First of all to all Parents, it&#39;s an A rated movie. Don&#39;t go with your 5 yaer old kids to watch this movie.<br/><br/>Aside from this statutory warning, this movie is FANTASTIC, this is coming from a guy who doesn&#39;t like Ranbir Singh&#39;s acting at all....until now.<br/><br/>Reality has been presented as it is ; no diplomatic storytelling at all. It&#39;s a must - solo watch or group-of-friends- watch movie. Totally recommend it."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026006/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023526",
              "author": {
                "username": {
                  "text": "aishpal"
                },
                "userId": "ur122258964"
              },
              "summary": {
                "originalText": "Cult classic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This kind of movie make cinema proud . And full of entertainment. Must watch.<br/><br/>I would like to mention the akshay kumar specifically due to his immense and detailed acting level. And hidden gem aka arjun rampal expressions and tone of vocals were just amazing. Love to watched it multiple times. People should praise this."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023526/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021110",
              "author": {
                "username": {
                  "text": "NihalB-354"
                },
                "userId": "ur211650860"
              },
              "summary": {
                "originalText": "Best movie of the year 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "India should start making this type of movies... Waiting for Part 2 on 19th March🙌... This type of movies are giving us hint that bollywood is actually upgrading. Dhurandhar is a great movie that&#39;ll leave a lasting impact on your mind! It&#39;s a testament to Bollywood&#39;s growth and progress. The film is engaging, intense, and well-made, making it a must-watch for fans of the genre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021110/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006873",
              "author": {
                "username": {
                  "text": "PawanK-924"
                },
                "userId": "ur203913229"
              },
              "summary": {
                "originalText": "Stars Bring Fire to This High-Impact Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the first scene, the story grips with careful pacing and rich characterization. Ranveer Singh brings depth and complexity to his role, navigating moral ambiguity with finesse. Sanjay Dutt&#39;s presence is commanding, creating an immediate sense of threat. Akshaye Khanna and R Madhavan provide weight to the ensemble, while Arjun Rampal exudes subtle menace. Sara Arjun&#39;s emotional performance reminds viewers of what&#39;s truly at stake. Aditya Dhar&#39;s direction ensures tension builds organically, with action sequences that are thrilling yet purposeful. The cinematography and sound design further enhance the realism, while the editing maintains a gripping pace. By the climax, the film combines emotional resonance with cinematic spectacle, leaving a lasting impression."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006873/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11057178",
              "author": {
                "username": {
                  "text": "HimadriP-68"
                },
                "userId": "ur211445515"
              },
              "summary": {
                "originalText": "Dhurandhar movie short review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great performance from all the actors. It&#39;s not often you see a movie like this. The storytelling is so good with this kind of action that it doesn&#39;t feel like it&#39;s a three-hour movie. All the old songs used in this movie are beautifully brilliantly. Every scene looks very authentic. The sets here are more real than in VFX, so it looks amazing on the theatre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11057178/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010716",
              "author": {
                "username": {
                  "text": "adityabubna"
                },
                "userId": "ur116165233"
              },
              "summary": {
                "originalText": "Genre Defining Cinema. Brilliant."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is 3hr 34 mins long but not even a single minute went by where I felt bored. Aditya Dhar has great technical expertise and it shows in the screenplay of the movie. The BGM is bound to take your attention and will stay with you long after the movie is over. The movie has multiple power packed performances and that makes it even more interesting. This ones a must watch in theaters. I cannot wait for part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010716/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010870",
              "author": {
                "username": {
                  "text": "ashwinisawanth-65416"
                },
                "userId": "ur165378394"
              },
              "summary": {
                "originalText": "amazing movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is how I want to see a spy/espionage movie. Excellent world and character building,with awesome attention to detail to set pieces. Every single actor played their roles to perfection! Amazing direction by amazing direction by Aditya Dhar. Askhay Khanna stands out the most. However, as other mentioned, the role of Ranveer was not to stand out in the first place, and the director and actor executed that perfectly!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010870/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}