{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xoldjotazcwzy472xhzojvqps4ycb42modz7xiaxd6mqbdf4skydk3oy2vvmjyobz2uinmjhhfy6ps5xzigeqbfz7a",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11006454",
              "author": {
                "username": {
                  "text": "vipin-39489"
                },
                "userId": "ur197686357"
              },
              "summary": {
                "originalText": "Non-Stop Thrills From Start to End"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an extraordinary achievement in Indian cinema. The director crafts a dense, multi-layered narrative that is both thrilling and thought-provoking. Every actor brings their A-game: the lead commands the screen with a mix of gravitas and vulnerability, while the supporting cast enriches the film with believable and memorable portrayals. The director&#39;s attention to detail-from framing to pacing-ensures that every scene resonates. Even amidst political drama and explosive action, the performances anchor the story, making it compelling on both emotional and narrative levels."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006454/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006525",
              "author": {
                "username": {
                  "text": "imdbfan-7844457666"
                },
                "userId": "ur199122849"
              },
              "summary": {
                "originalText": "Big Screen, Bigger Impact"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film combines suspense, action, and emotional depth with exceptional finesse. Ranveer Singh anchors the story, delivering a performance that captures both grit and vulnerability. Director Dhar ensures every sequence, from tense confrontations to explosive action, feels grounded in character and purpose. Supporting actors bring authenticity, enhancing the narrative&#39;s realism. Cinematography highlights both grandeur and intimacy, while the background score amplifies tension subtly. It&#39;s a compelling mix of heart, intellect, and adrenaline."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006525/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013167",
              "author": {
                "username": {
                  "text": "pkroy-98925"
                },
                "userId": "ur196899009"
              },
              "summary": {
                "originalText": "Top notch cinema but has 2 part curse"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Even though the trailer mislead us that it is ranveer singh movie, it was actually akshay khanna movie. His aura was 🔥 throughout the movie. The spy scenes were very grounded not so unrealistic. All 4 main characters were aura farming. The action scenes were good specially the one where the go after babu dakait. The only bad thing I feel is that the end was not that grand which is due to the splitting of the movie in 2 parts.<br/><br/>People are talking about propaganda which I felt a little only when they said current govt will not do anything 2 times other then that there was nothing which I think was propaganda as they showed the reality of how they instructed their operatives by watching Indian media live feeds.<br/><br/>As a cinema it&#39;s top notch and a noteworthy performance by all the leads which is very rare. A must watch."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013167/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018104",
              "author": {
                "username": {
                  "text": "samarthdesai-01565"
                },
                "userId": "ur101497330"
              },
              "summary": {
                "originalText": "Next Level Experience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If cinema is meant to be an immersive experience, Dhurandhar is the new gold standard. From the very first frame to the rolling credits, this film does not just entertain; it engulfs you. It is a cinematic triumph that proudly wears its identity on its sleeve-unapologetically Indian, fiercely intense, and technically flawless.<br/><br/>What truly sets Dhurandhar apart is the technical wizardry on display, specifically the synchronization of the background score (BGM) with the visuals. The editors and sound designers deserve a standing ovation. The music doesn&#39;t just accompany the scene; it dictates the heartbeat of the film. Every punch, every chase sequence, and every dramatic pause is mathematically timed to the score, creating a &quot;next-level experience&quot; that feels less like a movie and more like a sensory event. The BGM acts as an adrenaline pump, elevating the tension to a fever pitch.<br/><br/>Narratively, the film manages a difficult balancing act. It is undeniably a hero-focused movie, with the protagonist carrying the weight of the mission and the emotional arc. However, the screenplay is generous and intelligent enough to ensure that it isn&#39;t a one-man show. The film features a heavyweight ensemble cast, and every major actor is given equal importance. There are no wasted characters here; each performance adds a crucial layer to the storytelling, making the stakes feel real and the camaraderie authentic.<br/><br/>But the soul of Dhurandhar lies in its spirit. In an era of globalized content, this film stands tall as a rooted, &quot;Hindustani&quot; movie. It captures the grit, the emotion, and the ethos of India without resorting to empty clichés. It connects with the audience on a visceral level, evoking a sense of pride and belonging that resonates long after the lights come up.<br/><br/>Verdict: Dhurandhar is a masterclass in modern commercial cinema. With stellar performances, a thumping score that syncs perfectly with the action, and a story that beats with an Indian heart, it is a must-watch. It is big, bold, and brilliantly executed. Don&#39;t miss it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018104/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013464",
              "author": {
                "username": {
                  "text": "mainakoddar"
                },
                "userId": "ur189805120"
              },
              "summary": {
                "originalText": "One of the best spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is a fast-paced, engaging entertainer that blends action, emotion, and sharp storytelling. From the very first scene, the film sets a strong tone with its stylish visuals and gripping background score. The director deserves credit for keeping the narrative tight and making sure the audience remains hooked throughout.<br/><br/>The lead actor delivers one of his most powerful performances-balancing intensity, humour, and vulnerability with ease. His screen presence lifts every scene, especially the high-voltage action sequences which are choreographed with great precision. The supporting cast also performs convincingly and adds depth to the story.<br/><br/>One of the strongest aspects of Dhurandar is its screenplay. The twists are well-placed, the dialogues are memorable, and the emotional moments feel genuine rather than forced. The cinematography is visually impressive, and the music complements the mood of the film beautifully.<br/><br/>While the film has a few predictable moments, they never take away from the overall experience. Instead, the energy, pace, and performances make Dhurandar a solid mass entertainer that keeps the audience satisfied till the end.<br/><br/>Overall, Dhurandar is a well-crafted, highly engaging film that delivers exactly what it promises-thrill, emotion, and entertainment. A must-watch for fans of high-impact commercial cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013464/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020250",
              "author": {
                "username": {
                  "text": "ashutoshna"
                },
                "userId": "ur87773598"
              },
              "summary": {
                "originalText": "Dhurandhar Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best movies ever created in the history of Indian cinema. Top-notch direction, performances, cinematography music. I must applaud Ramvir Singh not for acting but for accepting this role with other dhurandhar starkast. They are all literally BAAPS of acting. Can wait for the second part. Simply Amazing!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020250/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008637",
              "author": {
                "username": {
                  "text": "vikashkr-49993"
                },
                "userId": "ur122148119"
              },
              "summary": {
                "originalText": "Absolutely Superb, must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Never seen before such brilliant take on a Spy thriller that so closely resembles real life incidents. Bravo..what an awesome experience. Direction to performances by all lead actors.. everything is just precise and brilliant. Akshay Khanna literally stole the show. Intense Ranbir is simply fabulous. R Madahavan just killed it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008637/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022614",
              "author": {
                "username": {
                  "text": "pareshrdoshi-14788"
                },
                "userId": "ur65245734"
              },
              "summary": {
                "originalText": "Bull's Eye - An Ric Espionage Saga"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Today I Watched\na Movie in theatre after 2 years<br/><br/>I watched\n*_D H U R A N D H A R_*<br/><br/>We spent Rs. 2500 for 4 Pax.<br/><br/>Its Worth the wait\n&amp;\nIts worth every single paisa we spent<br/><br/>A Must Watch for Thriller Lovers/Bharat Lovers<br/><br/>Iske saamne Tiger abhi Bachcha he Aur Kabir aur Vikram bahut Kachche he<br/><br/>Aditya Dhar smartly overtakes the likes of Stanely Kubrik, Alfred Hitchkok, Steven Spielberg, Francis Ford Copolla, Mario Puzo, James Cameron , Quentin Tarantino, Martin Scorsese, John Woo &amp; Riddley Scott all in one man<br/><br/>Only Christopher Nolan remains to be overtaken in terms of Complexity<br/><br/>Before I Die, I am eagerly waiting for some more Alistair mclean, Christopher Nolan Touch in AD&#39;s future works<br/><br/>Waiting for 19-3-2026 to watch part 2 of this Epic Espionage Saga<br/><br/>As an Indian I am Afraid we might lose him to Hollywood<br/><br/>*_Dhurandhar_* easily, very convincingly overtakes likes of Bond Movies, Mission Impossible series,\nPulp Fiction, space odyssey, GodFather, broken arrow, face off, Titanic, gladiator, Reservoir Dogs, Kill Bill, Django Unchained (all cult classics in their respective category)<br/><br/>Dhurandhar is the New Cult Classic, worldwide, in all movie making &amp; experience departments<br/><br/>It is superlative in all departments<br/><br/>Be it Casting, Resemblance to real life Characters , Quirky Comic Touches, Representation of facts, Screenplay, BGM, Dialogues, Gore &amp; Action, Makeup, Acting &amp; whatever you name, I am not forgetting The Direction<br/><br/>It is a complete film making Course institute itself<br/><br/>Believe me. This film will break all box office records worldwide<br/><br/>This movie Re-discovers powerful Akshaye Khanna, ever Reliable Rakesh Bedi &amp; Mysterious R Mohan<br/><br/>The Resl Hero of the movie is AD, the director<br/><br/>It will be numero uno, Be it box office collection, pirated copies, awards, acclaims, criticisms, reviews, love, hate, respect<br/><br/>You either love Aditya Dhar or Hate him. But you cannot ignore him<br/><br/>Bollywood, Hollywood, The World Cinema, Beware AD has arrived<br/><br/>Now we know what to expect, rather not to expect from AD<br/><br/>Move over Huckla, Tukla, Pakla &amp; 6 ungli wala RiRo<br/><br/>Your Baap has arrived : Hamza Mazari aka Jaskirat Singh<br/><br/>Last Movie I liked was Johnny Gaddar<br/><br/>Dhurandhar - A Must Must Must watch if you don&#39;t mind row Violence<br/><br/>An Epic Action Saga in 2 parts a movie we patriot Bharatiys needed at this time.<br/><br/>For 3 &amp; half hours i was teleported to pakistan underworld and back to the cinema hall in malad , the cost was just INR 500<br/><br/>Dhurandhar is an event that comes in 100 years , technically it is just like eclipse occurs in 100 years<br/><br/>There are some unique Master Pieces on our Planet Earth, the only planet with life in the entire Universe<br/><br/>There is only one Unique Postage stamp : Penny Black<br/><br/>There is only one unique Painting : Monalisa<br/><br/>Therr is only one unique movie : Dhurandhar<br/><br/>I am glad to be alive to experience it.<br/><br/>This movie has extended the life of dying, corrupt, rotten bolywood film industry."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022614/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018117",
              "author": {
                "username": {
                  "text": "Shivans-20"
                },
                "userId": "ur211625468"
              },
              "summary": {
                "originalText": "Good"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Very very very good movie one should must watch this movie and support it . The level acting is beyond imagination like really exceptional cast and acting. Akshay khanna was really great he did a good acting...such a down to earth guy. I will say guys you should must support suck kind of videos that shows the truth and real faces of certain community and people, you know what I&#39;m talking about."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018117/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026695",
              "author": {
                "username": {
                  "text": "snehaharwandkar"
                },
                "userId": "ur195622267"
              },
              "summary": {
                "originalText": "Best movie I have ever watched \"Dhurandhar\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerful cinematic experience that keeps you hooked from start to finish, but what truly elevates the film is Ranveer Singh&#39;s phenomenal performance. He once again proves why he is one of the most versatile and fearless actors of this generation.<br/><br/>Ranveer completely immerses himself into his character, delivering a performance that is intense, layered, and emotionally gripping. Every scene he appears in carries a strong screen presence-whether it&#39;s moments of raw aggression, vulnerability, or quiet strength, he handles them with remarkable ease. His body language, dialogue delivery, and expressive eyes add depth to the character, making it both believable and impactful.<br/><br/>The film&#39;s narrative is engaging, supported by a solid screenplay and strong direction, but it&#39;s Ranveer who becomes the driving force of Dhurandhar. He commands attention and brings authenticity to the story, making the audience deeply invested in his journey. The background score and cinematography further enhance the intensity of his performance.<br/><br/>Overall, Dhurandhar is a must-watch, especially for Ranveer Singh fans. His performance alone makes the film worth experiencing, reaffirming his ability to transform and dominate the screen every time he takes on a challenging role."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026695/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11039910",
              "author": {
                "username": {
                  "text": "vijay-jaiswal"
                },
                "userId": "ur151027365"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I am Vijay Kumar Jaiswal, a resident of Khagaria district in Bihar, and I am giving an honest review. I humbly request the true patriotic artists of Bollywood to keep making such films and show them to the people of our country. In this movie, Akshaye Khanna sir has done an amazing role. I love you, sir."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11039910/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11032221",
              "author": {
                "username": {
                  "text": "DipyamanS"
                },
                "userId": "ur210727814"
              },
              "summary": {
                "originalText": "Amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands out as a powerful cinematic experience under Aditya Dhar&#39;s sharp direction, showcasing his strong grip on intense storytelling. Ranveer Singh delivers a fierce and commanding performance, while Akshaye Khanna brings depth and maturity with his understated brilliance. R. Madhavan adds emotional weight and credibility, elevating the narrative with his presence. Supported by a solid ensemble cast, impactful dialogues, and a gripping background score, the film feels intense, layered, and thoroughly engaging from start to finish."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032221/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004524",
              "author": {
                "username": {
                  "text": "vishut-337-7643"
                },
                "userId": "ur32972698"
              },
              "summary": {
                "originalText": "Dhurandhar - A Cinematic Masterpiece!(No Spoiler)"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a sensational film that hits all the right notes with its compelling story, remarkable performances, and breathtaking visuals. From the very first frame, the movie grabs your attention and doesn&#39;t let go until the credits roll. It&#39;s a perfect blend of drama, action, and emotion that keeps you on the edge of your seat.<br/><br/>The film&#39;s storyline is fresh and unique, weaving a narrative that&#39;s both gripping and heartwarming. The protagonist, played by a stellar cast member, is a force to be reckoned with, delivering a performance that is both nuanced and powerful. Their journey of struggle and self-discovery is relatable, and you can&#39;t help but root for them every step of the way.<br/><br/>The direction is top-notch, with each scene thoughtfully crafted to build tension and deepen the emotional impact. The cinematography deserves special mention; the visuals are stunning, capturing the essence of the story beautifully, whether it&#39;s the scenic landscapes or the intense action sequences. The long movie duration is not felt is proof of art of story telling with use of good BGM when necessary."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004524/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006821",
              "author": {
                "username": {
                  "text": "ezeysqjy"
                },
                "userId": "ur177078091"
              },
              "summary": {
                "originalText": "Starry Spectacle of Power and Pain"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Right from the start, the film commands attention, creating an atmosphere thick with tension, intrigue, and danger. Ranveer Singh gives a tour-de-force performance, seamlessly blending moral conflict with physical intensity. Supporting actors enrich the story, each delivering scenes that leave a lasting impression. Director Dhar demonstrates remarkable control over tone and pacing, letting suspense and action unfold organically. Action sequences are both visceral and narratively justified, while cinematography captures the stark contrasts between chaos and silence. The emotional and political undercurrents add weight, making the finale both inevitable and profoundly impactful."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006821/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021231",
              "author": {
                "username": {
                  "text": "HN-2999"
                },
                "userId": "ur211652110"
              },
              "summary": {
                "originalText": "The truth hits hard, this movie is a must watch!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I am generally not a fan of violent films, but Dhurandhar is an exception because every scene is grounded in hard facts and undeniable truth. The storytelling is gripping, and the direction has truly set a new bar for the action genre-the attention to detail in every single frame is a visual treat. The entire cast delivered phenomenal performances, but the highlight has to be Akshaye Khanna. He may have been out of the spotlight, but he has made a legendary comeback with this role. I highly recommend ignoring any negative media influence and experiencing this masterpiece for yourself. I genuinely hope we see more films of this caliber, made by actors who truly respect the craft.<br/><br/>P. S - I created an account here, to specially review and support the movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021231/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028522",
              "author": {
                "username": {
                  "text": "BossKin1237L"
                },
                "userId": "ur147423189"
              },
              "summary": {
                "originalText": "Best Movie Ever Made !!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie was blast and was very good and as very realistic with original recordings and events. Akshay Khanna and Ranveer role was amazing and Arjun Rampal is Underrated. In the whole 3hr 34 min I never felt boring. Massive movie I am....speechless man. This is a revolutionary movie which changed the perspective of spy movies, it was brutal , harsh and honest. The movie ended at a cliffhanger....waiting to watch Part2: Revenge on 19th Mar 2026, expected to see more screen time of Major Iqbal (Arjun Rampal)."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028522/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006918",
              "author": {
                "username": {
                  "text": "lhvgcujn"
                },
                "userId": "ur177078885"
              },
              "summary": {
                "originalText": "A Blockbuster Born from Heart and Heat"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an epic cinematic journey powered by exceptional direction and brilliant performances. The lead actor is nothing short of phenomenal, delivering an emotionally layered portrayal that resonates deeply with viewers. Supporting actors bring authenticity and depth, elevating even minor subplots. The director expertly balances intense action, suspense, and nuanced storytelling, creating a narrative that keeps the audience engaged throughout. Real-world geopolitical events are seamlessly incorporated, giving the story a palpable realism. The film&#39;s technical aspects-from precise editing to evocative music and cinematography-enhance the impact of each scene. Dhurandhar is a testament to how thoughtful direction and powerhouse performances can elevate mainstream cinema into an unforgettable experience."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006918/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036683",
              "author": {
                "username": {
                  "text": "ShubhamVerma_03"
                },
                "userId": "ur155679869"
              },
              "summary": {
                "originalText": "Best Ever Spy and Patriot Movie ever Built In India"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "10/10* &amp; 100/100*\nJust one this is tremendous, speechless, marvelous and a true sense of cinema. Very realistic and beautifuly acted. Ever actor in this movie is just lit.<br/><br/>Kudos to its makers as well. This movie will break the chain of bollywood&#39;s deep love to Pakistan and Muslims. Love u Aditya Dhar Sir."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036683/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013161",
              "author": {
                "username": {
                  "text": "YogeshT-52"
                },
                "userId": "ur211588141"
              },
              "summary": {
                "originalText": "A masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a refreshing entertainer that blends emotion, humor, and strong storytelling beautifully. The film keeps you engaged from start to finish with its clever dialogues and well-crafted scenes. The performances are absolutely standout-each character feels real, relatable, and full of life.<br/><br/>The direction deserves special applause for delivering a story that is simple yet impactful. Whether it&#39;s the family sentiment, the fun sequences, or the dramatic moments, everything lands perfectly. The background music and cinematography elevate the film&#39;s mood and give it a memorable flavor.<br/><br/>What makes Dhurandhar special is its message-believing in yourself, staying fearless, and never underestimating your own strength. It leaves the audience inspired, smiling, and satisfied."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013161/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016415",
              "author": {
                "username": {
                  "text": "JoydeepB-40"
                },
                "userId": "ur211609955"
              },
              "summary": {
                "originalText": "Left a lasting effect"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great plot, fast paced and captivating throughout even with long running time. Lot of buzz that Akshaye outshined everyone but Ranveer was brilliant as well. Everyone in the key supporting roles were fantastic. Good to see Arjun Rampal and R Madhavan was unrecognizable . Overall a great cast put together. Though there is some gore but still a must watch. I am anxiously waiting for the sequel!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016415/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016090",
              "author": {
                "username": {
                  "text": "josimo16"
                },
                "userId": "ur56119641"
              },
              "summary": {
                "originalText": "Rakesh Bedi was outstanding"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Music was quality and Hanumankind&#39;s rap too. 4 out of 8 star was to music and background score , and the rest 4 was for Rakesh Bedi and the nationalistic content . While the content had potential, the initial direction was underwhelming in the first 15 minutes. Both R. Madhavan&#39;s and Sanjay Dutt&#39;s performances were average; however, I found Rakesh Bedi&#39;s acting to be exceptional. Ranveer Singh&#39;s looks and his powerful performance during the 26/11 scene were superb, though his acting in the remainder of the film was merely ordinary. Akshay khana&#39;s acting was ordinary too."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016090/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014321",
              "author": {
                "username": {
                  "text": "shivamrai-03903"
                },
                "userId": "ur150579259"
              },
              "summary": {
                "originalText": "IMDB Review (Special Appreciation for Akshaye Khanna)"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the most impressive films of the last 2-3 years.<br/><br/>This movie stands out not just for its storytelling, but for the sheer brilliance of its performances - especially Akshaye Khanna, who delivers one of his most controlled, gripping, and unforgettable roles in recent times.<br/><br/>Akshaye Khanna - The Soul of the Film<br/><br/>Akshaye Khanna once again proves why he is one of the finest actors in Indian cinema.<br/><br/>His presence is magnetic, his expressions speak louder than dialogues, and the subtle intensity he brings to the screen is simply on another level.<br/><br/>His emotional control is remarkable\nHis dialogue delivery is sharp and impactful\nEvery scene he appears in becomes instantly more powerful<br/><br/>It&#39;s the kind of performance that reminds you what true, effortless acting looks like.<br/><br/>Overall Performances<br/><br/>The supporting cast also does a commendable job, but Akshaye Khanna clearly leads from the front and lifts the entire film with his maturity and screen presence.<br/><br/>Direction &amp; Craft<br/><br/>The direction, pacing, cinematography, and background score blend together beautifully, making the film a complete experience.<br/><br/>Final Verdict<br/><br/>A brilliantly crafted film elevated to greatness by Akshaye Khanna&#39;s outstanding performance.<br/><br/>One of the best films to come out in the last few years."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014321/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007173",
              "author": {
                "username": {
                  "text": "DineshV-46"
                },
                "userId": "ur210718828"
              },
              "summary": {
                "originalText": "Bold storytelling meets breathtaking execution"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses viewers in a morally complex and thrilling world, brought to life by Ranveer Singh&#39;s magnetic performance. The director exhibits masterful control over tone, alternating between high-octane action and contemplative drama with ease. Supporting actors deliver standout moments, each contributing to the story&#39;s layered texture. Cinematography captures tension and atmosphere, from bustling city streets to shadowy interiors. The screenplay unfolds with intelligence, giving space for character development while steadily escalating stakes. Action sequences are intense but narratively justified, adding to the story rather than distracting. The sound design and score enhance suspense subtly, making key moments hit harder. By the finale, every narrative thread converges for a satisfying, impactful resolution that lingers in the mind."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007173/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006528",
              "author": {
                "username": {
                  "text": "Sanjay-7524"
                },
                "userId": "ur211546151"
              },
              "summary": {
                "originalText": "The Kind of spy movies we deserve"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s not everyday that you see a 214 min film hook you to the screen for the entirety of its runtime. The cinematography, the music, the performances, the set design everything is top-notch. The violence especially is clos to reality and I&#39;m glad they did this rather than going for a stylized take. Excited for Part 2."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006528/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006477",
              "author": {
                "username": {
                  "text": "ypeqkjkd"
                },
                "userId": "ur176953285"
              },
              "summary": {
                "originalText": "Emotions Rise as Action Rips Through"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film is a masterclass in storytelling, direction, and performance.<br/><br/>What makes Dhurandhar extraordinary is how the director has managed to extract flawless performances from the cast. The lead&#39;s transformation over the course of the film is subtle yet profound, showing vulnerability alongside immense strength. The supporting cast, including the secondary leads and minor roles, contributes significantly, making the world feel alive and believable."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006477/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}