{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xolbbltazcwzy476uhhnbzr3tm2cb72ikd367oaho6qebgnesk2dk4oayfjjchyriec4v3hxe5ijzgkypqwwhahu",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11014177",
              "author": {
                "username": {
                  "text": "shobhitchitransh"
                },
                "userId": "ur151031376"
              },
              "summary": {
                "originalText": "#Dhurandhar doesn't just arrive, it detonates. #Raw, #ruthless, and unapologetically real..."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tonight I proudly say, Bollywood finally roared again, breaking free from the syrupy, spineless cinema that Karan Johar &amp; his brigade drowned it in for years!!<br/><br/>Aditya Dhar, Respect!!!<br/><br/>#Dhurandhar doesn&#39;t just arrive, it detonates. #Raw, #ruthless, and unapologetically real...<br/><br/>This isn&#39;t just a film... this is the reminder of what Bollywood looks like when a real dhurandhar takes charge!!<br/><br/>Don&#39;t Miss this One!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014177/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010503",
              "author": {
                "username": {
                  "text": "ektabharti-56036"
                },
                "userId": "ur134515233"
              },
              "summary": {
                "originalText": "Great"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; is an inspiring watch. I truly loved the acting-each performance felt real and powerful. The way the makers presented the true story was outstanding and deeply emotional. A beautifully crafted film that stays with you long after it ends. Brilliant direction and heartfelt storytelling.<br/><br/>Loved it!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010503/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012422",
              "author": {
                "username": {
                  "text": "talkingdeepak"
                },
                "userId": "ur166716438"
              },
              "summary": {
                "originalText": "Not a fake movie like Ongoing spy verse"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This Movie is something else than ongoing fake Spy universe of SRK and Doggy tiger. It shows real transformation, betrays, real mindset of terrorists..\nAction - Awesome, emotions - awesome..\nShows true face of ISI and other Pakistani gangs and their internal matters.<br/><br/>I request to all true Indians to go and watch it.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012422/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016357",
              "author": {
                "username": {
                  "text": "guptankur-23155"
                },
                "userId": "ur162851852"
              },
              "summary": {
                "originalText": "best movie ever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Reality as it is not glorifying pakistani terriorist. Chills when the real attack recording is shown whats true is true not like FAKE YRF propaganda. Actors classy and true to their roles ranveer stand out greatly this is the best movie of 2025 without a blink of an eyelid!!! The story grips you tightly from start to end no fake drama bikni women objectification moments."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016357/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022407",
              "author": {
                "username": {
                  "text": "prajjwalsingh-96797"
                },
                "userId": "ur122004272"
              },
              "summary": {
                "originalText": "Dhurandhar - When Indian Spy Cinema Learns the Art of Silence and Substance"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just another spy film-it feels like a quiet reset button for the Indian spy universe. What instantly stands out is the filmmaking style: restrained, confident, and deeply immersive. The film doesn&#39;t rely on loud nationalism or overdone spectacle; instead, it trusts its storytelling, visuals, and characters to do the heavy lifting.<br/><br/>Aditya Dhar&#39;s approach to character-building deserves special mention. Every character feels intentional, layered, and grounded in reality. You can sense the time spent in shaping their motivations, silences, and moral conflicts. Nothing feels rushed or decorative-each arc serves the larger narrative. Dhar proves once again that he understands how to make patriotism feel earned rather than announced.<br/><br/>The performances across the board are exceptional. There isn&#39;t a single weak link-each actor brings depth and authenticity, making the world of Dhurandhar feel lived-in and believable. The acting doesn&#39;t scream for attention; it pulls you in subtly, which makes the impact even stronger.<br/><br/>What truly sets Dhurandhar apart is how it redefines the Indian spy universe. It chooses intelligence over noise, tension over theatrics, and realism over formula. The film respects the audience&#39;s intelligence and rewards patience, leaving a lasting impression long after the credits roll.<br/><br/>In essence, Dhurandhar is a masterclass in controlled storytelling-bold in vision, refined in execution, and refreshing in its intent. This is the kind of cinema that doesn&#39;t just entertain; it elevates the genre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022407/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010675",
              "author": {
                "username": {
                  "text": "pritptl-58130"
                },
                "userId": "ur169076782"
              },
              "summary": {
                "originalText": "Blockbuster"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After a long time a bollywood which won&#39;t disappoint. Casting was great and storytelling and character buildup was upto the mark. Hope more such films are made and indian cinema standards are raised. Movie was a bit long but totally justified. Very much excited for the next part to release soon, bar is raised and expectations are high for the next one."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010675/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014016",
              "author": {
                "username": {
                  "text": "ShreyasR-60"
                },
                "userId": "ur210581645"
              },
              "summary": {
                "originalText": "Just Mind blowing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;This isn&#39;t just a movie; it is an absolute masterpiece. It is damn super good! I am 27 years old and I have hardly seen even three Hindi movies in theaters because I&#39;m very picky, but this one completely blew me away. I am already planning to go watch it in the theater for a second time-imagine that! To say it is just &#39;good&#39; is the biggest understatement of the year. It is mind-blowingly next level compared to anything else out there. If you haven&#39;t booked your tickets yet, do it now. It is worth every penny.&quot;"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014016/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018154",
              "author": {
                "username": {
                  "text": "rahul-5617"
                },
                "userId": "ur211625213"
              },
              "summary": {
                "originalText": "Fantastic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar, the legendary cartoonist! I just can&#39;t get enough of his incredible work! His cartoons are like a breath of fresh air, always hitting the nail on the head with wit and humor. The way he captures the essence of Indian society and politics is simply amazing!<br/><br/>His creations like &quot;Garam Chai&quot; and &quot;Gayabari Gopinath&quot; are iconic, and his ability to poke fun at everyday situations is unparalleled. His art is simple yet powerful, making us laugh and think at the same time. It&#39;s no wonder he&#39;s considered one of India&#39;s greatest cartoonists!<br/><br/>What I love about Dhurandhar&#39;s work is how relatable it is. His cartoons are like a mirror to our society, reflecting our quirks and flaws in a way that&#39;s both entertaining and thought-provoking. He&#39;s a true master of his craft, and I&#39;m a huge fan!<br/><br/>If you&#39;re not familiar with Dhurandhar&#39;s work, do yourself a favor and check him out. Trust me, you won&#39;t be disappointed! His cartoons will make you smile, nod in agreement, and maybe even make you think twice about the world around you. A true legend in Indian cartooning!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018154/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014042",
              "author": {
                "username": {
                  "text": "Aryan_Tiwari"
                },
                "userId": "ur211593882"
              },
              "summary": {
                "originalText": "Waitt what a movieee"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Simply phenomenal movie...🎥\nCast can&#39;t be better\nAkshaye khanna acting is just fire 🔥🔥<br/><br/>My opinion just don&#39;t listen to anyone and go and checkout the real cinema experience.<br/><br/>The music is by Sir AR rahman khan what a music<br/><br/>I am saying its complete pack of thriller,spy,crime ,movie...<br/><br/>Big shoutout to director."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014042/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012515",
              "author": {
                "username": {
                  "text": "lokeshbhandari-17828"
                },
                "userId": "ur157488249"
              },
              "summary": {
                "originalText": "One of the best spy thrillers of recent time"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "In recent years many we have seen many spy movies follows of a secret agent on a mission. Dhurandhar also follows the same pattern combining with a high obtained action presented in most brutel form also follows recent trend of action movies like Animal, Kill. Dhurandar presents a regular spy story in raw and real form provides a wholesome entertainment to audiance of action lovers. Whenever there is a talk of spy movies the first thing comes in audiance mind YRFs spy universe with a stylish look just opposite Dhurandhar presents a spy genre in raw and rusted manner may appeal more to the masses.<br/><br/>If we closely analsys the pattern of Bollywood audiance gave showered their love on action movies like Pathan, Jawan and Animal especially Animal tottaly redifined the term &quot;Action&quot; in brutal form Those who like animal brutality will find the brutality of Dhurandhar a level higher.but surprisingly both the movies comes from exactly different genres whereas Animal follows the pattern of a family drama on the other Dhurandhar is a spy thriller and other intersting thing both these movies are exrremely engaging despite being preditable but it is the screeplay act as a saving point for the movie is enough engaging to keep viewers glude to their seats.<br/><br/>(Sorry For Spoilers) The suspense of the movie disclose in the cilmax is quite predictable with elements like hardcore action and mass action may appeal the audiance in small centers with a certain kind of rawness in movie. The way action is shot looks perfect on the big scale wheather it is guns shots. Fight scenes provides a wholesome experience action lovers in India. And the other bonus point of the movie the presentation of Ranveer Singh in the movie. And keen to have strong characters wheather it is of Ranveer Singh, R Madhavan , Sanjay Dutt or Arjun Rampal and Sara Arjun has limited screen time but she looks pretty."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012515/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007250",
              "author": {
                "username": {
                  "text": "rameshlaad-33871"
                },
                "userId": "ur118094820"
              },
              "summary": {
                "originalText": "Stars, Action, and Pure Entertainment"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses viewers in a dangerous, morally complex world where every decision carries life-altering consequences. Ranveer Singh delivers an extraordinary performance, seamlessly balancing emotional vulnerability, intellectual strategy, and physical intensity. Sanjay Dutt brings commanding presence and gravitas, while Akshaye Khanna and R Madhavan provide cerebral support that enriches the story. Arjun Rampal&#39;s quiet menace heightens suspense, and Sara Arjun&#39;s emotional authenticity offers a human perspective on the stakes. Aditya Dhar&#39;s direction blends suspense, action, and psychological tension perfectly. Cinematography captures sprawling urban chaos and intimate character moments, while the score accentuates tension, drama, and action. The second half escalates with explosive revelations and confrontations, culminating in a finale that is both thrilling and emotionally resonant."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007250/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010638",
              "author": {
                "username": {
                  "text": "JayK-751"
                },
                "userId": "ur211568623"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a light-hearted, with simple storytelling. Performances are decent, humour is clean, and the pacing is smooth. Though not very unique, it offers feel-good entertainment and works well as a casual, relaxing watch that leaves you smiling. Akshay Khanna acting is just awesome and Madhvan has also done great work."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010638/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006549",
              "author": {
                "username": {
                  "text": "imdbfan-4531838808"
                },
                "userId": "ur198195795"
              },
              "summary": {
                "originalText": "Cinematic Excellence Unleashed"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A cinematic achievement that combines intelligence, intensity, and style, the movie demands attention from start to finish. Ranveer Singh&#39;s portrayal is layered and immersive, anchoring the story&#39;s emotional core. Dhar&#39;s direction balances high-stakes action with introspective character moments, giving every scene purpose. Supporting performances are memorable, each adding texture to the world of intrigue. Visual storytelling and sound design amplify tension, resulting in a film that is as gripping intellectually as it is viscerally thrilling."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006549/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004811",
              "author": {
                "username": {
                  "text": "vs-83042"
                },
                "userId": "ur150218195"
              },
              "summary": {
                "originalText": "Dhurandhar: I believe it's a truth"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an absolute triumph of intense, uncompromising filmmaking that deserves every bit of praise it is receiving. Directed by Aditya Dhar, this isn&#39;t the usual Bollywood spy spectacle; it&#39;s a raw, visceral, and creeping journey into the dangerous heart of international espionage and the global syndicate of terror. The film&#39;s greatness lies in its unflinching commitment to realism and its deliberate, slow-burn tension.<br/><br/>From the moment Ranveer Singh&#39;s character, Hamza, infiltrates the Karachi underworld of Lyari, the movie establishes a palpable sense of danger and moral murkiness. It is a dense, detailed world of gang wars and political machinations, all inspired by and woven around real-life geopolitical conflicts. The plot meticulously details the cold, calculating nature of covert operations, making the audience feel the weight of every difficult decision and the true cost of operating outside the lines.<br/><br/>The movie succeeds brilliantly in showing the truth of this gritty, unforgiving world. It is unapologetic, grounded, and focused on the emotional and physical toll on the operatives. The action is not glorified but presented as brutal, necessary, and realistic, especially the hand-to-hand combat sequences.<br/><br/>Ranveer Singh delivers one of his most powerful and restrained performances, carrying the weight of his mission with intense, brooding subtlety-a true beast on screen. However, it is Akshaye Khanna, as the menacing kingpin Rehman Dakait, who truly commands the film with his chilling, controlled presence. The entire ensemble cast is stellar, giving the massive 3.5-hour runtime a gripping, propulsive quality that prevents it from ever feeling slow. Backed by a phenomenal, goosebump-inducing background score, Dhurandhar is a masterclass in storytelling and technical craft. It is a must-watch film that offers both high-stakes action and a deep, thoughtful narrative, proving that Bollywood can deliver a world-class, great cinematic thriller."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004811/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006959",
              "author": {
                "username": {
                  "text": "shubhamshuuu"
                },
                "userId": "ur118087596"
              },
              "summary": {
                "originalText": "Drama That Keeps You on the Edge"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every element of this film-from performance to direction to technical execution-works in concert to create a gripping, unforgettable experience. Ranveer Singh&#39;s portrayal is layered and compelling, making the audience invest in his character&#39;s journey from the first scene. Action sequences are meticulously choreographed, blending tension, realism, and cinematic flair. Supporting actors provide depth, each scene reinforcing the stakes and motivations. The director&#39;s vision ensures a delicate balance between character development and plot progression. Cinematography captures both intimate moments and epic scale with equal artistry, while the score punctuates tension and emotion seamlessly. The finale delivers a powerful conclusion, leaving viewers in awe of the cinematic craftsmanship."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006959/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015030",
              "author": {
                "username": {
                  "text": "ankurvaid-38758"
                },
                "userId": "ur171205305"
              },
              "summary": {
                "originalText": "10/10 Haven't seen better movies than this"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "10/10 - A Cinematic Masterpiece That Transcends Time<br/><br/>Dhurandar is not just a film; it is a profound, soul-stirring experience that etches itself permanently into the viewer&#39;s consciousness. From the very first frame to the hauntingly beautiful final shot, this movie is a flawless symphony of impeccable storytelling, breathtaking visuals, and powerhouse performances.<br/><br/>The narrative is a masterclass in emotional depth and complexity, weaving a tale that is both intimately personal and grandly universal. It navigates the rugged terrain of human relationships, ambition, and sacrifice with a sensitivity and intelligence that is rare in cinema today. The screenplay is taut, layered, and rich with symbolism, demanding and rewarding the viewer&#39;s complete attention.<br/><br/>Every performance is a revelation, with the lead actors delivering career-defining work. Their portrayals are so raw, so authentic, that you forget you are watching a performance and instead feel you are witnessing real life unfold. The supporting cast is equally magnificent, adding layers of texture and authenticity to the world of the film.<br/><br/>Visually, Dhurandar is a canvas painted with light and shadow. The cinematography is nothing short of spectacular, using the Maharashtrian landscape not merely as a backdrop but as a vital, breathing character in the story. Each composition is a work of art, enhancing the film&#39;s emotional gravity. The music score seamlessly blends with the narrative, rising and falling with the characters&#39; journeys, amplifying every moment of joy, tension, and heartbreak.<br/><br/>Director Ravi Jadhav has crafted his magnum opus. His vision is clear, confident, and uncompromising, guiding this epic with a steady hand and a poetic heart. The film&#39;s pacing is perfect, allowing the story to breathe and the characters to grow, culminating in a climax that is both devastating and spiritually uplifting.<br/><br/>In an era of fleeting entertainment, Dhurandar stands as a monumental achievement-a film of immense beauty, intelligence, and heart. It is a powerful, moving, and unforgettable journey that deserves not just to be seen, but to be felt and contemplated. This is Indian cinema at its absolute finest. A perfect 10. An undisputed classic."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015030/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012593",
              "author": {
                "username": {
                  "text": "VikrantC-8"
                },
                "userId": "ur200092504"
              },
              "summary": {
                "originalText": "Epic Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A real dose of intensity, realistic action, emotions combined with superb cast each raising their bar with great acting. Great direction and good script writing. It is a must watch entertain that all patriots should watch. The plot is good with proper background build up. As you watch you journey with the character. The screenplay and background makes you feel you are standing there at the place of action. All the cast members have immersed themselves into their respective characters doing proper justice to their roles. The fighting sciences are gruesome, violent ,brutal but realistic."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012593/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007543",
              "author": {
                "username": {
                  "text": "Rajendra-167"
                },
                "userId": "ur211549813"
              },
              "summary": {
                "originalText": "Super casting"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Big bollywood to small TV actors, all in one..\nNo kiss, no vulgarity, full story, aura farming.. BGM going to be many&#39;s ringtones..\nWaiting for second part on march 2026\nRarely i wait or get excited for any movie like this.<br/><br/>Movie is 3 hour long, but you will feel like you want to see more..\nTotally recommended."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007543/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11069363",
              "author": {
                "username": {
                  "text": "priyalpotnis"
                },
                "userId": "ur126503346"
              },
              "summary": {
                "originalText": "Best Movie after long time"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is one of the best movies after a long time. I can put this movie with the best movies like 3 Idiots, Zindagi Na Milegi Dobara, Hera Pheri, and Baby type. I would like to salute the direction and storytelling of this movie. This type of story telling has not been seen before in bollywood. Everyone has done great acting. Definitely worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11069363/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010528",
              "author": {
                "username": {
                  "text": "shakmakk"
                },
                "userId": "ur132705204"
              },
              "summary": {
                "originalText": "Dhurandhar is a must watch !!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It starts slow with Ranveer Singh (spy) lands in Pakistan as a refugee from Balochistan who wants to make a mark in the Pakistan Underworld. The motive behind joining the underworld is to destabilize them and uncover the truths of the enemies which can be share with the India.<br/><br/>The music, energy, BGM goes really well with the scenes that is been shown in the movie.<br/><br/>The location and the characters shown in the movie looked unreal. It is beyond your imagination. The killings are so brutual that you will have to take your eyes off if you are weak hearted."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010528/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007922",
              "author": {
                "username": {
                  "text": "imssinghraj"
                },
                "userId": "ur184830542"
              },
              "summary": {
                "originalText": "Worth every penny"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Well done dhurandhar team. The story moves fast, the action feels real, and the lead actor shines throughout. Though a bit predictable at times, it still delivers a powerful and engaging cinematic experience. By the end, I felt genuinely invested in the character&#39;s journey - raw, relatable, and worth watching."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007922/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007051",
              "author": {
                "username": {
                  "text": "AmanK-2440"
                },
                "userId": "ur203913279"
              },
              "summary": {
                "originalText": "Stars Bring Emotion and Energy to Every Scene"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s intensity is matched by its thoughtful execution. Ranveer Singh delivers a gripping performance, portraying complex emotions alongside raw action, while Sanjay Dutt commands the narrative with authority. Akshaye Khanna and R Madhavan&#39;s contributions enhance the depth of every scene, and Arjun Rampal&#39;s presence adds tension that lingers. Sara Arjun&#39;s emotional depth makes the stakes tangible. Aditya Dhar balances suspense, drama, and action with precision, ensuring the story&#39;s pacing never falters. Cinematography highlights both expansive urban chaos and intimate character moments, while the soundtrack heightens suspense. The film culminates in a climax that is both thrilling and emotionally resonant."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007051/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044915",
              "author": {
                "username": {
                  "text": "riame-57743"
                },
                "userId": "ur172988095"
              },
              "summary": {
                "originalText": "In love with Ranveer Singh!!!!😍"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story, the direction, the songs, the actors - everything was so outstanding. Loved every bit of 3 hours and 30 minutes. I honestly wouldn&#39;t have complained if it was even longer. When a film is written and executed this well, audiences are more than happy to stay seated.<br/><br/>It&#39;s a must-watch that will boil your blood and leave you deeply unsettled."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044915/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022902",
              "author": {
                "username": {
                  "text": "sharmachetan-62284"
                },
                "userId": "ur80790210"
              },
              "summary": {
                "originalText": "Gripping cinematic experience - with amazing performances and super direction."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar from starts make it clear that - this is going to be grounded - the actor is not the star - he is just part of the whole story.<br/><br/>You will see Ranveer is background - while other characters take lead - like akshay khanna as rehman dacait.<br/><br/>With amazing acting performance - every dialogue and emotion is conveyed.<br/><br/>The agent maintains a low presence and slowly moves ahead - like a real world spy will do.<br/><br/>Then comes the music - it helps elevate each scene - used amazing with action choreography and great editing.<br/><br/>A must watch!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022902/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007019",
              "author": {
                "username": {
                  "text": "Kunal-701"
                },
                "userId": "ur211547809"
              },
              "summary": {
                "originalText": "Screenplay is on another level."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The way real audio of terrorists are shown, it gives goosebumps and movie is just superb what i have seen in recent years. Threater expiernece is also crazy. Cast is also fantastic and mature. Casting directer should get more appreciation he has done his work very well. Worth the time and money. Aditya Dhar you beauty."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007019/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}