{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4x6pbbsqyxdo6ia7svhxojzrdrmwaj22mkt37hoaho6qebgnesk2dc2oezfxjch34kq3crlkuwzjjvdmgh7kafjym",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11011488",
              "author": {
                "username": {
                  "text": "arungeorge13"
                },
                "userId": "ur30872044"
              },
              "summary": {
                "originalText": "An overlong but a pretty satisfying espionage action thriller. [+64%]"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Quick thoughts:<br/><br/>1. Patriotism getting the macho packaging is far from my favorite genre, that&#39;s for sure. Dhurandhar is very on the nose from a storytelling perspective, and it&#39;s 200% INTENDED to make your blood boil. Some of it, like the red-screen with a highly disturbing voiceover, works.<br/><br/>2. The writing is simultaneously smart and predictable, weaving in real incidents with fictional events. There are some really INTERESTING stretches, and then, there are some really UNINTERESTING ones. Soft propaganda and snide remarks on pre-2014 government aside, the film stays focused on its espionage-thriller core.<br/><br/>3. The 2-hour long first half only makes it obvious that Aditya Dhar had more material for a web series than a film. The screenplay is extremely dense, going deep into a Pakistani gang war with details that matter more for the moment than overall. The chapterwise divisions are a clear indication too.<br/><br/>4. With a properly etched character like Rehman Dakait, Akshaye Khanna is the standout performer here by a mile. Ranveer Singh only needs to play the silent infiltrator with a limited emotional range (until the end), so it feels like PART 2 will have him showcasing more of his acting chops. Sanjay Dutt&#39;s and Rakesh Bedi&#39;s parts feel like a concerted effort to make one section of Pakistanis look dumb and indecisive; there&#39;s some spontaneous fun to be had in the process, however. Also, Arjun Rampal might be the bigger (and more menacing) baddie that the film deliberately places less focus on.<br/><br/>5. Sara Arjun (the cute kid from Saivam and Deiva Thirumagal has hmm.. grown up!) looks amazing but has absolutely nothing to add to the plot, except be another addition to the &quot;dumb girlfriend universe.&quot; Even her chemistry with Ranveer feels a bit out of place.<br/><br/>6. Shashwat Sachdev&#39;s music is really what kept me hooked for 210+ minutes. Except for that item number and a romantic track, the rest of the OST is FANTASTIC! That also applies to the use of (remixed?) retro songs in various scenes.<br/><br/>7. The violence depicted has a slasher-like vibe at specific points, while sticking to the usual action-thriller aesthetic for the most part. Nothing here is particularly stomach-churning (except maybe THAT post-interval scene), but the director seems to have a clear sense of when to shock the viewer. Screw the insertion of CG blood, though.<br/><br/>8. The VFX in general (blood, explosions, etc.) could look better with the amount of money involved (right?). Yet, the staging of the set pieces and solid set designs deftly mask this.<br/><br/>P. S. Vishwaroopam déjà vu, anyone?"
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 4,
                "downVotes": 15
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011488/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11070048",
              "author": {
                "username": {
                  "text": "Fella_shibby"
                },
                "userId": "ur18970655"
              },
              "summary": {
                "originalText": "Watch Sarfarosh and learn something. Twice my reviews got deleted. Yeehaw!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Many people walked out the theatre midway.<br/><br/>Was it the length (almost 4 hours boredom) or was it the sick gore (shock value)?<br/><br/>Twice my reviews got deleted.<br/><br/>There r infinite losers in my beloved India that they cannot respect opinions. These losers love chest thumping jingoism.<br/><br/>Everybody involved in this movie shud learn from Sarfarosh.<br/><br/>Sarfarosh handled cross border terrorism, domestic terrorism, underworld mafia, corrupt cops, snitch network, corrupt businessman, etc so very well n Sarfarosh was way ahead of its time.<br/><br/>Coming back to this movie, during the end car scene when Hamza is driving Rehman towards Chowdhury, Rehman removes a pocket knife. Rofl. An underworld don not carrying a pistol? Also when Hamza runs away in the forest and Chowdhury n his team surrounds Rehman, that time Rehman very conveniently removes machine guns. Very conveniently for action sequence.<br/><br/>A daughter recording a father&#39;s political meeting to hand over to her paramour is beyond me.<br/><br/>Enemy country Pakistan having sophisticated guns n other weapons manufactured in their own backyard is again beyond me. I thot Pakistan is a poor country n backwards regarding technology.<br/><br/>Basically this movie is Gangs of Wasseypur part 3 set in Pakistan with gore, abusive language in Hindi n vulgarity.<br/><br/>This movie insulted an ex prime minister Manmohan Singh (a gem of a person n the best finance minister from India), glorified villains n promoted us vs them mentality."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 7,
                "downVotes": 39
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11070048/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11093922",
              "author": {
                "username": {
                  "text": "A_D_0068"
                },
                "userId": "ur206088185"
              },
              "summary": {
                "originalText": "Dhurandhar (2025): A Masterclass in Directorial Vision and Acting Ferocity"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar&#39;s Dhurandhar has transcended the typical &quot;action-thriller&quot; label to become a cinematic milestone. While its scale is massive, the film&#39;s true strength lies in the four pillars that support its weight: the visionary direction of Dhar and the transformative performances of Akshaye Khanna, Ranveer Singh, and Sanjay Dutt.<br/><br/>The Architect: Aditya Dhar With Dhurandhar-\nAditya Dhar proves that Uri was no fluke; he is arguably India&#39;s most precise technician of action. Dhar&#39;s mastery lies in his ability to maintain a &quot;tight&quot; atmosphere even on a &quot;wide&quot; canvas. He treats the lens as an observer, pulling the audience into the dusty, dangerous labyrinth of Lyari with a sensory richness rarely seen in Indian cinema. His decision to blend archival reality with high-stakes fiction creates a &quot;lived-in&quot; intensity that makes every gunshot feel consequential.<br/><br/>The Chameleon: Ranveer Singh (Hamza)\nIn a departure from his flamboyant public persona, Ranveer Singh delivers a masterclass in restraint. As the deep-cover operative Hamza, Ranveer uses his physicality to tell the story-his hunched shoulders and weathered face speak of a man who has lived in the shadows for too long. It is a simmering, soulful performance that acts as the film&#39;s moral heartbeat.<br/><br/>The Scene-Stealer: Akshaye Khanna (Rehman Dakait)\nIf there is one reason to watch Dhurandhar multiple times, it is Akshaye Khanna. Playing the sophisticated yet sociopathic Rehman Dakait, Khanna is electric. He brings a &quot;theatrical menace&quot; to the screen, delivering lines with an unpredictable cadence that keeps the audience on edge. It is perhaps the most iconic villainous turn in recent memory-charismatic, terrifying, and impossible to look away from.<br/><br/>The Enforcer: Sanjay Dutt (Chaudhary Aslam)\nSanjay Dutt provides the film with its raw, old-school muscle. As the relentless cop Chaudhary Aslam, Dutt brings a &quot;lion in winter&quot; gravitas to the narrative. His presence provides a perfect counterpoint to the calculated espionage of Ranveer and the madness of Khanna, grounding the film in a sense of grit and legacy.<br/><br/>Final Critical Note (my view)-\nDhurandhar succeeds because it respects the intelligence of its audience while delivering the &quot;masala&quot; thrills they crave. By leaning on the immense talent of its lead quartet, Aditya Dhar has crafted a film that will be studied for years to come as the gold standard of the Indian spy-epic."
                }
              },
              "authorRating": 9,
              "submissionDate": "2026-01-03",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11093922/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011243",
              "author": {
                "username": {
                  "text": "RekhaS-3870"
                },
                "userId": "ur211573040"
              },
              "summary": {
                "originalText": "Excellent movie with excellent performance and bgm, songs"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Excellent performance by everyone from each department. Ranveer Singh was really excellent as spy he has his performance very well, Aditya Dhar has done excellent as crew or director also to mention Akshay Khanna, Arjun Rampal, and Sanjay Dutt. Also excellent work by Shashwat Sachdeva. Everyone has excellent work by everyone in movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011243/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008573",
              "author": {
                "username": {
                  "text": "Jagannaths-46"
                },
                "userId": "ur211556153"
              },
              "summary": {
                "originalText": "Glory to Indian cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What a movie just wow\nStory is so much engaging that u don&#39;t feel bored...<br/><br/>I really enjoyed the movie...\nAkhaya khana acting just overrated.<br/><br/>Little dialogue..only face expression\nBut ranbir singh acting just wow ..arjun rampal ka acting bahut achha tha .<br/><br/>Overllaly sab achha tha salute to humare desh ka jawan."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008573/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027802",
              "author": {
                "username": {
                  "text": "govindmenon"
                },
                "userId": "ur70865815"
              },
              "summary": {
                "originalText": "Absolute Peak Cinema, must watch!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerhouse: tense storytelling, sharp staging, and a world that feels lived-in and dangerous. It balances espionage, crime-thriller energy, and raw intensity with impressive control. The direction feels confident throughout - every scene has purpose, and the atmosphere is thick with dread and momentum.<br/><br/>Performances are a major highlight. Ranveer Singh delivers one of his strongest, most committed turns, and Akshaye Khanna is magnetic whenever he&#39;s on screen. Add in strong craft across cinematography, production design, and action choreography, and you get a film that feels both large-scale and personal.<br/><br/>Even with a longer runtime, I stayed locked in - it&#39;s immersive, brutal, and genuinely cinematic. 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027802/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11030972",
              "author": {
                "username": {
                  "text": "shreyanshsharma-22965"
                },
                "userId": "ur148847719"
              },
              "summary": {
                "originalText": "Peak Cinema Experience🔥🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhar&#39;s Magic🔥🔥🔥. Master&#39;s all the profile - acting , music,direction, action. Top notch Movie. Mass Blockbuster 🔥🔥🔥. Every charcater is well writen. Every actor played its role with perfection 🔥🔥. And hats off to Sachdeva ,Hanumankind and Arijit ( Superb Music experience). Bgm adds the soul to every scene."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11030972/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009409",
              "author": {
                "username": {
                  "text": "JainilV-4"
                },
                "userId": "ur211561123"
              },
              "summary": {
                "originalText": "One of the best best movies I saw this year!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is one of the best movies I saw this year, especially in the spy genre. The main reason is that the film does not shy away from the nature of topic it&#39;s tackling. Film is honest, different, addictive and authentic. Something you haven&#39;t seen before. You will want to watch it again. The only nit pick would be it&#39;s length, but then again the movie does a good job to keep you hooked. So it&#39;s a 10/10 from me, and I highly recommend it. It&#39;s a must watch for every patriotic person."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009409/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026360",
              "author": {
                "username": {
                  "text": "shreejitha"
                },
                "userId": "ur167521590"
              },
              "summary": {
                "originalText": "dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Briliant just briliant.made a real rooted spy movie with briliant characters.it is not the perfect movie but almost a perfect one.some scenes r soo disturbing and soo exhausting which will dipict the real journey of a spy.the ending feels little bit streched.excited for the second part.akshay khanna nailed it."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026360/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11050789",
              "author": {
                "username": {
                  "text": "abhinavbom-450-306088"
                },
                "userId": "ur35729119"
              },
              "summary": {
                "originalText": "One of the few Bollywood movies to keep you engaged for 3.30 hours"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This should be the turning point of Indian Cinema where a 2.30 hour movie is filled with 1 hour content and 1.30 hour songs. Dhurandhar is pure entertainment and shows a much higher level of production that a comparable budget bollywood film.<br/><br/>Excellent story line, fantastic acting and dialogue writing. The movie scores high in every area."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-24",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11050789/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036379",
              "author": {
                "username": {
                  "text": "bits-devanshu"
                },
                "userId": "ur26237276"
              },
              "summary": {
                "originalText": "Could have done without the propaganda"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A little less of dramatisation and propaganda, a bit more mature story telling and this could&#39;ve been a good action movie. Performances were good for the most part, but seems like the marketing or social media machine is also on full throttle with overhyping Akshay Khanna&#39;s &quot;moves&quot; or whatever. Respect the actor, but this kind of promotion was a bit corny."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036379/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006542",
              "author": {
                "username": {
                  "text": "posttoricha"
                },
                "userId": "ur127680535"
              },
              "summary": {
                "originalText": "\"A Misguided Spy Drama That Confuses Noise with Narrative\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched Dhurandhar yesterday, and here is my review<br/><br/>To begin with, director Aditya Dhar appears to lack the essential depth and research required to create a convincing espionage thriller. A truly compelling spy film demands authenticity, narrative intelligence, and nuanced storytelling - qualities that Dhurandhar consistently fails to deliver.<br/><br/>Instead of substance, the film leans heavily on cosmetic glorification:\n<ul><li>thunderous background music,</li><li>hyper-stylized action,</li><li>exaggerated displays of physical strength, and</li><li>forced patriotic triggers designed to emotionally manipulate the audience.</li></ul><br/><br/>This formulaic approach turns the film into spectacle rather than meaningful cinema.<br/><br/>The script takes fragments of real incidents, distorts them for dramatic impact, and then labels the final product as a &quot;patriotic film.&quot; However, nothing in its treatment genuinely reflects patriotism.<br/><br/>What the audience ultimately receives is a third-rate, commercially motivated film whose primary intention seems to be box-office returns rather than artistic or ideological integrity.<br/><br/>The most disappointing aspect is the film&#39;s marketing. Dhurandhar is promoted as an Indian patriotic drama, but at its core, it revolves around Pakistan&#39;s low-grade local political landscape. The disconnect between promotion and actual content makes the film feel disingenuous and directionless.<br/><br/>On a personal note, watching this film with my 10-year-old son turned out to be troubling. Several scenes felt inappropriate and left me deeply uncomfortable as a parent. Throughout the screening, I kept questioning whether bringing him to this film was a mistake.<br/><br/>In fact, the director should take the time to watch an authentic espionage drama like The Spy-a film that succeeds without exaggeration, without glorification, and without manipulating emotions. It is a masterclass in honest storytelling about an intelligence operative. Unfortunately, Dhurandhar seems to operate on the assumption that the Indian audience lacks discernment. Even if that were partly true for some viewers, a filmmaker can never truly connect with an audience that values subtlety, realism, and narrative integrity. He may create a film purely for commercial gain, but he cannot reach those who genuinely appreciate well-crafted spy cinema. Casting R. Madhavan as Ajit Doval and inserting a few real Indian incidents does not automatically make a film patriotic. Instead, it comes across as a calculated attempt to lure attention by exploiting India&#39;s growing wave of performative patriotism. This feels less like a tribute to the nation and more like a strategic move to profit from the charged mindset of the masses."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 43,
                "downVotes": 388
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006542/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011215",
              "author": {
                "username": {
                  "text": "vishal-260"
                },
                "userId": "ur211573178"
              },
              "summary": {
                "originalText": "Best action movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Really great movie if you like stories on india Pakistan relations. Its all about Terrorism funded and supported by Pakistan and pakistani peoples.<br/><br/>Don&#39;t watch this movie if you are not comfortable with blood scenes.<br/><br/>Action is best\nStory is based on real life incidents\nHats off to Akshay Khanna....."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011215/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11032776",
              "author": {
                "username": {
                  "text": "ArvindS-028"
                },
                "userId": "ur211740496"
              },
              "summary": {
                "originalText": "It is a heart-pounding tribute that redefines the heroic biopic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After nearly 9 years I went to see a movie in cinema.<br/><br/>From the opening frame to the closing credits, this film is a relentless, pulse-pounding experience that demands your absolute attention. Rarely does a movie manage to balance non-stop, visceral action with such profound emotional depth.<br/><br/>Every actor, from the leads to the supporting cast, brings an incredible level of passion and raw emotion to their roles. You feel the weight of their choices and the intensity of their courage. The screenplay is lean and impactful, honouring the true story and legends.<br/><br/>Most importantly, the film serves as a deeply respectful tribute to the real-life heroes who sacrificed everything for their nation - Bharat. This stays with you long after the screen goes black."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032776/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011167",
              "author": {
                "username": {
                  "text": "prajwal-229"
                },
                "userId": "ur206452676"
              },
              "summary": {
                "originalText": "Real spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If you only want to watch mass masala then its not for you not like pathaan 50 logo ko ek banda mar raha he and akashy khanna stole the movie what a movie movie feels long but worth wathing.its real spy movie not like other bollywood propogenda movie and i can sense it some people dont like this movie bcz they dont want real anti pakistan nerrative they want movie like pathaan and tiger zinda he."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011167/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11034345",
              "author": {
                "username": {
                  "text": "nitindesner"
                },
                "userId": "ur97035494"
              },
              "summary": {
                "originalText": "Best movie like URI"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I like the story it based on TRUE story where involvement of the neighbour country, as that involves every time when something happens in india, salutes to the soldiers who dies to save our lives,\nFor movie is like you can watch alone, you can with family, feels like you watching reality so go and watch the movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11034345/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018544",
              "author": {
                "username": {
                  "text": "Satya_Sourav"
                },
                "userId": "ur132959569"
              },
              "summary": {
                "originalText": "Finally a Bollywood director gave some Justice to our SPYs"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Well, I can&#39;t write more things every one has their perspective regarding why the put the Srimad Bhagwat Geeta shlok when the movie started and the original recording but I enjoy it, it give the justice to whole narrative. Well It&#39;s a fantastic movie to watch for once. Excited for the sequel. Hope it satisfy the audience. Last but not the least Never forget Never forgive. Jay Hind."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018544/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031134",
              "author": {
                "username": {
                  "text": "anandsingh-38520"
                },
                "userId": "ur177207570"
              },
              "summary": {
                "originalText": "Probably the best movie till date"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Full marks on authenticity, dialogue, screenplay and music. 9 marks on engagement, but probably because of the rawness and colour palette, so I won&#39;t complain about this. I would put this in my favourite movie list. Never seen a movie that is both massy and documentary at the same time and perfect in all departments.<br/><br/>I think it beats all the best movies in the world. A few movies that I think are closer to this are Bahubali 2, Parasite, Animal, 1917 and The Imitation Game."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031134/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009734",
              "author": {
                "username": {
                  "text": "nitishtendiya10"
                },
                "userId": "ur38172564"
              },
              "summary": {
                "originalText": "Amazing - 3hrs of non stop entertainment"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerful, engaging film that delivers on every level. Akshay Khanna brings depth and calm intensity, while Ranveer Singh adds energy and emotional force. Aditya Dhar once again proves he&#39;s a brilliant storyteller, crafting a gripping narrative. Shaswat&#39;s music elevates every moment with the perfect tone and impact. A truly memorable cinematic experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009734/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11053468",
              "author": {
                "username": {
                  "text": "riyanshupadhyay"
                },
                "userId": "ur183998395"
              },
              "summary": {
                "originalText": "One of the best spy-films in General!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I already had high expectations for this... but this exceeded my expectations, I was amazed how good this film is. The acting, The story, The music, The Character arcs all of them, but there are some cons with the screenplay feeling dragged at certain points the story jumped around to much between characters and being too long! I got bored before the interval because the film was slow so my rating is: 9.2."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-25",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11053468/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011476",
              "author": {
                "username": {
                  "text": "SoumikBanerjee1996"
                },
                "userId": "ur46919419"
              },
              "summary": {
                "originalText": "A gritty, effective espionage drama!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s gritty and gory, packed with a wealth of research and information; kind of a rarity in Bollywood&#39; spy endeavours, where mindless entertainment often takes precedence over the significance of the source material.<br/><br/>Aditya Dhar, as the director, is breaking the mold without skimping on the entertainment factor, which is refreshing and appreciable.<br/><br/>The film is engaging and soars to incredible heights at certain moments, delivering what audiences typically seek from this genre.<br/><br/>That said, it isn&#39;t without its fair share of flaws. The exposition can feel a bit heavy at times, and the stretched-out screenplay eventually starts to weigh down the pacing and rhythm.<br/><br/>The way songs are integrated is interesting, though especially those that play in the background during key activities.<br/><br/>However, the dance number at the wedding felt unnecessary, as did the entire subplot of Hamza and Yalina&#39;s budding romance. They could have cut that off entirely and nothing would change.<br/><br/>On the plus side, the film does a fantastic job of drawing you into its expansive world filled with ruthless gangsters, smugglers, and corrupt officials.<br/><br/>A standout element is the performances from the main cast, particularly Akshaye Khanna. He doesn&#39;t just play Rehman Dakait, he owns the role, stealing every frame he features in."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011476/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033456",
              "author": {
                "username": {
                  "text": "akkid97"
                },
                "userId": "ur38250912"
              },
              "summary": {
                "originalText": "Inspired by true events is not based on real story"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is worth to watch as it is engaging , acting , storytelling and direction is good but movie used real events and not based on true story and aaditya dhar makes sure how to change story and show that in dramatic way-and modify it for some political party to make them happy and make people believe that it is real story for political agenda."
                }
              },
              "authorRating": 4,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 12
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033456/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025654",
              "author": {
                "username": {
                  "text": "snehajadhav-54579"
                },
                "userId": "ur109151052"
              },
              "summary": {
                "originalText": "Overall nice movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Being a hardcore action movie lover the fighting scenes are incredible but they have put music in fighting acene which is kind of turned off for me. Akshaye khanna is worth all the hype. One time watch movie definitely go for it. Will not give spoiler just don&#39;t get up early when it seems the movie has ended ;-)"
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025654/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019756",
              "author": {
                "username": {
                  "text": "BibekB-72"
                },
                "userId": "ur211637042"
              },
              "summary": {
                "originalText": "Totally matured film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film is genuinely mature. Although I may not fully grasp all of its political implications, it clearly takes a more thoughtful and grounded approach compared to movies like Pathaan and the Tiger series. Cinema should be made in this manner...honest, unfiltered, and rooted in logic.<br/><br/>In contrast, films like Pathaan and Tiger promote unrealistic and exaggerated scenarios that hide the actual narrative purpose behind a hero&#39;s sudden appearance. For example, Salman Khan&#39;s entry in Pathaan and Shah Rukh Khan&#39;s entry in Tiger happen without any meaningful explanation. This kind of storytelling can be harmful for younger audiences, as it encourages unrealistic expectations and distorts their sense of imagination..People may think those movies(pathan, tiger and many old )are made only for entertainment, but that isn&#39;t entirely accurate. Entertainment should still be logical and follow a clear path. If not, younger audiences may become overly unrealistic and may struggle to nurture real creativity."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019756/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011136",
              "author": {
                "username": {
                  "text": "HarshalM-74"
                },
                "userId": "ur211572169"
              },
              "summary": {
                "originalText": "Biggest Blockbuster in 2025."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a beautifully crafted film that blends emotion, tension, and storytelling with great balance. The performances feel honest, and the visuals put you right into the situation of the true events. It&#39;s the kind of movie that leaves you thinking long after it ends.<br/><br/>Unbelievable Movie, which I think will watch it again for sure."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011136/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}