{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6pdjmtazcwzy47wtxxnjtrtr42azz2mkd36hnaxcomqbdf4skydk3o4yvznzyod3op3serbocw3kvutiorwyfhgwa",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11047041",
              "author": {
                "username": {
                  "text": "patilnilesh-60754"
                },
                "userId": "ur132656953"
              },
              "summary": {
                "originalText": "It's not a movie it's about real ndian spy"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Star cast amazing, you can&#39;t get bored between the movie, nicely show the teresiom how Pakistan supports the terrorist. Nice acting by all star cast. It&#39;s a real story so many hide people doing there work in another country for safe the his own country first time this movie show the real story of spy not like YRF Film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11047041/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017872",
              "author": {
                "username": {
                  "text": "syedirfanahmed-51561"
                },
                "userId": "ur136410253"
              },
              "summary": {
                "originalText": "The Best Film Of 2025 In Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Since the beginning Movie pace and Story hook you that much, you&#39;ll forget about popcorn on your lap.<br/><br/>Background music 10/10, Highly Impressive. I was complimenting while watching itself.<br/><br/>Casting 10/10, every actor is fit to the role and each and everyone gives 100% Story 9/10, After a decade we are witnessing such a good story and no disturbance by any love song in switzerland.<br/><br/>Direction 10/10, every single shot is too notch. So impressive<br/><br/>Please watch this film in theatre for better experience in terms of music most. I&#39;m filled with compliments for this film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017872/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014093",
              "author": {
                "username": {
                  "text": "vspandita"
                },
                "userId": "ur70368500"
              },
              "summary": {
                "originalText": "Speechless and in awe of aditya dhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From cast, to the world of durandhar , And each and every aspect of film was a masterpiece of cinema and art, Ranveer kapoor, Akshay khanna, Sanjay dutt are dragons but the two Big Bulls R madhavan and Arjun Rampal really made their presence feel to the audience\nThis is the movie u must watch in big theaters🎥\nKudos to aditya dhar, desperately waiting for part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014093/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010884",
              "author": {
                "username": {
                  "text": "dhanushsai-25491"
                },
                "userId": "ur132997873"
              },
              "summary": {
                "originalText": "Dhurandhar: A Gripping Tale That Commands Your Attention"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those rare films that immediately pulls you into its world with a sense of intrigue and atmosphere that stays long after the credits roll. From the very first scene, the narrative establishes a mood that is both tense and deeply captivating, urging the audience to pay close attention to every detail. What sets Dhurandhar apart is not just its storyline, but the way it marries suspense, emotion, and intelligence into one cohesive experience.<br/><br/>The storytelling is exceptionally engaging. Instead of relying on predictable twists, Dhurandhar builds its tension through character depth, subtle clues, and emotionally grounded motivations. Each character feels real, layered, and purposeful, ensuring that even supporting roles add weight to the overall narrative. The protagonist&#39;s journey-filled with internal conflict, moral dilemmas, and moments of vulnerability-holds the audience&#39;s attention effortlessly. You don&#39;t just watch the character; you feel their struggle.<br/><br/>Visually too, the film stands strong. The cinematography enhances the intensity of every moment, whether it&#39;s a quiet emotional breakdown or a high-stakes confrontation. The lighting, framing, and pacing make the film feel almost like a visual novel-every shot contributing to the storytelling rather than just filling the screen.<br/><br/>What makes Dhurandhar truly captivating is its commitment to intelligence. The script respects the viewer&#39;s mind, giving space to interpret, analyze, and connect dots rather than spoon-feeding the spectacle. At the same time, it never becomes slow or overindulgent; instead, the film balances thought-provoking dialogues with thrilling sequences that keep you hooked from start to finish.<br/><br/>The background score deserves special mention. It amplifies emotions without overpowering them, subtly pushing the audience into the psychological tension of the plot. Combined with strong performances and well-crafted direction, the result is a cinematic experience that is both engaging and unforgettable.<br/><br/>Overall, Dhurandhar is a compelling watch-not just for thriller lovers, but for anyone who enjoys cinema that challenges the mind while entertaining the heart. It is captivating, engaging, and executed with remarkable finesse."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010884/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006823",
              "author": {
                "username": {
                  "text": "Ayushi30530"
                },
                "userId": "ur199125185"
              },
              "summary": {
                "originalText": "Stars Delivering Fire in Every Frame"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The tension is palpable from the very first frame, escalating as the story unfolds with calculated precision. The lead delivers a powerhouse performance, balancing vulnerability with commanding presence. Action sequences are intense, realistic, and fully integrated into the narrative. Cinematography and sound design heighten suspense while highlighting emotional beats. Secondary roles are thoughtfully written, each adding depth and nuance. The screenplay carefully seeds conflict and intrigue, rewarding attentive viewers with a layered payoff. The second half explodes with high stakes and emotional resonance. This film exemplifies how action, intelligence, and strong performances can coexist seamlessly."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006823/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006719",
              "author": {
                "username": {
                  "text": "avani78"
                },
                "userId": "ur199256468"
              },
              "summary": {
                "originalText": "A Grand Cinematic Showdown of Power and Passion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story begins quietly but steadily escalates into a tense and thrilling experience. The lead delivers a nuanced, emotionally rich performance, making every choice compelling. Action sequences are tightly executed, blending realism with cinematic flair. Cinematography emphasizes both chaos and quiet intensity, enhancing dramatic beats. Supporting cast members are memorable, adding layers to the narrative. The screenplay plants subtle seeds early on, which blossom into a gripping, tension-filled climax. The final sequences balance adrenaline and emotion, leaving viewers deeply satisfied. This is a film that respects intelligence while delivering high-stakes excitement."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006719/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023475",
              "author": {
                "username": {
                  "text": "Pushkar2504"
                },
                "userId": "ur207522979"
              },
              "summary": {
                "originalText": "BHARAT MATA KI JAI"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "India must make more movies like this.<br/><br/>We don&#39;t need YRF Pakistan ISI loving Spy Universe Movies like Ek Tha Tiger, Pathaan, Tiger Zinda Hai, Tiger 3 and other illogical movies. Pakistan should be portrayed as it is. It shows 26/11, IC814 Hijack and 1992 blasts. What the hell is wrong, they are real incidents."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023475/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012763",
              "author": {
                "username": {
                  "text": "siddy-84663"
                },
                "userId": "ur132453429"
              },
              "summary": {
                "originalText": "Patriotism, Sacrifice, and Reality"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping patriotic thriller that dives into the dangerous world of intelligence operations across the India-Pakistan border. The story follows a RAW agent on a covert mission deep inside Pakistan, showcasing the courage, strategy, and sacrifice required to protect the nation from unseen threats.<br/><br/>The film doesn&#39;t shy away from portraying the darker reality of state-sponsored terrorism and corruption, and it does so with a bold, unapologetic tone. The narrative keeps the tension high while highlighting the dedication of Indian intelligence forces. Performances are impactful, and the action sequences feel purposeful rather than over-the-top.<br/><br/>While the film clearly takes a strong nationalistic stance, its intent is to spotlight the realities faced by agents rather than simply entertain. A tighter runtime and slightly more nuanced character development could have elevated it further.<br/><br/>Overall, Dhurandhar is a powerful patriotic watch-engaging, intense, and thought-provoking for viewers who enjoy realistic espionage dramas with a strong emotional core."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012763/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003964",
              "author": {
                "username": {
                  "text": "saprem-kini"
                },
                "userId": "ur25442692"
              },
              "summary": {
                "originalText": "⭐⭐⭐⭐⭐MVP 'Rehman Dakait'"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After long time a grounded filmmaker delivers a Realistic spy universe. I always thought that no one can beat Raj &amp; dk&#39;s portrayal of building an universe. But Aditya dhar shines like a star. Dhurandhar feels like a grounded film, with great characters &amp; super direction. Even though movie is 3 &amp; half hour long, yet doesn&#39;t feel long. The Star of the show is Akshay khanna aka &#39;Rehman Dakait&#39;. He delivers absolute banger performance. Great screen presence &amp; top notch dialogues. Big shout-out to casting director &#39;Mukesh Chhabra&#39;. Cant wait for the Next chapter."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003964/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006895",
              "author": {
                "username": {
                  "text": "wcpntnay"
                },
                "userId": "ur177078717"
              },
              "summary": {
                "originalText": "Pure Star Power with Pulse-Pounding Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The brilliance of Dhurandhar lies in its ability to merge storytelling, performances, and direction into a seamless whole. The lead actor delivers a nuanced performance, effortlessly navigating moments of rage, strategy, and vulnerability. Supporting actors shine, each scene enhanced by their dedication and understanding of their roles. The director&#39;s craftsmanship is evident in the pacing, scene composition, and use of background score to heighten emotion. The geopolitical undertones are woven into the narrative organically, never feeling forced or preachy. The fight sequences and action choreography are exhilarating yet grounded, keeping the audience invested without distraction. Every frame has been meticulously planned, showing the director&#39;s eye for detail. Dhurandhar is not just a film to watch-it&#39;s a film to experience, with performances and direction that will set a benchmark for years to come."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006895/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018417",
              "author": {
                "username": {
                  "text": "amieshverma"
                },
                "userId": "ur121631307"
              },
              "summary": {
                "originalText": "Dhurandhar is a ruthless, raw masterpiece that shatters spy thriller norms."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a ruthless, raw masterpiece that shatters spy thriller norms.<br/><br/>At a daunting 214 minutes, Dhurandhar grabs you from the first frame with a cinematic punch so fierce, it sets an unyielding tone for the entire epic. It isn&#39;t just an action thriller, it&#39;s a brutal deep-dive into the raw, unfiltered underbelly of cross-border terror and pain, something our screens desperately needed.<br/><br/>After the shelving of his ambitious Ashwathama, perhaps Dhar unleashed years of bottled rage and truth onto the silver screen, birthing Dhurandhar, a larger-than-life juggernaut exposing ISI&#39;s brutal reality, flipping the script on typical spy thrillers that often paint them as reluctant allies.<br/><br/>This film draws from real-life events, even threading in archival footage, pressing every nerve of anguish connected to terrorism&#39;s scars on India.<br/><br/>The film&#39;s strength lies in its uncompromising realism.<br/><br/>The fragile romance, the gut-wrenching, hard-hitting action choreography that makes Kill look tame, the razor-sharp dialogues, all elevate Dhurandhar to legendary status.<br/><br/>No character is short-changed, be it the heroes or the villains. Rakesh Bedi&#39;s portrayal of a tenacious Pakistani politician who bites back adds a juicy, unexpected layer of venom.<br/><br/>Visually and audibly, it&#39;s a marvel. The recreated retro soundtrack stirs nostalgia while propelling the movie&#39;s fierce tempo. The background score doesn&#39;t just accompany scenes, it becomes their beating heart, injecting life and urgency into every frame.<br/><br/>From the dense, shadowy alleys of Karachi to violent street battles, you&#39;re sucked into a world so vivid, its sheer 3 hours 34 minutes don&#39;t feel heavy but immersive.<br/><br/>Sanjay, Ramphal, Akshay, Madhavan, and Ranveer lead this charge with powerhouse performances that demand your attention. The script doesn&#39;t just entertain, it educates and punches with lines that linger as life lessons.<br/><br/>If Animal redefined contemporary action brutality, Dhurandhar rewrites the entire rulebook with raw emotion and relentless pace. Part one is a ticking time bomb of tension, teasing an explosive second chapter arriving on March 19, 2026.<br/><br/>The awaited sequel promises a brutal revenge saga India has never seen, weaponizing human demons and cinematic mastery with equal ferocity.<br/><br/>Yes, some will call this propaganda. But the brutal truth embedded in every frame silences cynics.<br/><br/>With Dhurandhar, Indian cinema isn&#39;t just keeping pace with Hollywood; it&#39;s storming the gates with unmatched storytelling finesse. Aditya Dhar, seven years after Uri, returns with a viciously slick narrative, flawless editing, and a killer soundtrack that will leave you breathless and begging for the next chapter.<br/><br/>A must-watch for anyone hungry for realistic, hard-hitting cinema that doesn&#39;t flinch from the truth making this a cinematic revolution. Watch it on the biggest screen possible. The fire it ignites on screen will be lit in your hearts too.<br/><br/>#dhurandhar #indiancinema #spythriller."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018417/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016773",
              "author": {
                "username": {
                  "text": "ashutoshsaini-77367"
                },
                "userId": "ur117383335"
              },
              "summary": {
                "originalText": "Peak and fresh cinema no hold back for the sensor pure raw action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Wow just wow it&#39;s an experience also the reality behind this movie adds masala to it in dhurandar feels like bit of a reality what it would be this movie is not to satisfy for some community sentiments all the energy and concept ki ab ki baar terrorist ki side ki traf se dikhate hai ki kaisa lga unko terror plan which was quite a new approach and thats what I like."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016773/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014050",
              "author": {
                "username": {
                  "text": "vfx-42507"
                },
                "userId": "ur118588431"
              },
              "summary": {
                "originalText": "Well Made"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must say what an movie that all we were waiting for...:)\nNot only this it attracted even international attention and numbers to go with further.<br/><br/>Not only the plot even the star cast, storyline and narration was top notch and some thing that ISI spy universe won&#39;t like it to have in such movie must a stylised and serious thriller."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014050/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018338",
              "author": {
                "username": {
                  "text": "Pradhuman-8"
                },
                "userId": "ur211627159"
              },
              "summary": {
                "originalText": "Amazing movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Killing in the end was bit extending rest all the movie was spine chilling.<br/><br/>One more thing pakistan is more poorer in real than shown in the movie.<br/><br/>Contains real video clips of terror attacks on india.<br/><br/>Rest movie is amazing you will enjoy it.<br/><br/>Don&#39;t listen to paid critics just go and watch by yourself."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018338/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016448",
              "author": {
                "username": {
                  "text": "tomisaburo-77217"
                },
                "userId": "ur182453037"
              },
              "summary": {
                "originalText": "Must Watch!!! Bold, Unfiltered, and Long Overdue."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar does what most Bollywood films never had the courage to do-show the reality without sugarcoating it. No safe storytelling, no forced &quot;balance,&quot; no diplomatic gloss. Just the harsh truth of the conflict, presented with clarity.<br/><br/>Critics calling it &quot;propaganda&quot; are missing the point. The film isn&#39;t pushing an agenda; it&#39;s exposing what many already know but few dare to show. That discomfort is exactly why the label is being thrown around.<br/><br/>The performances are grounded, the writing is razor-sharp, and the direction keeps the tension tight from start to finish. No melodrama, no filler. The film respects the viewer&#39;s intelligence and refuses to talk down to them.<br/><br/>Technically solid and narratively fearless, Dhurandhar is worth watching simply because it&#39;s honest-and in today&#39;s landscape, honesty itself feels rebellious.<br/><br/>Must watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016448/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010166",
              "author": {
                "username": {
                  "text": "tosumitdhaka"
                },
                "userId": "ur65150080"
              },
              "summary": {
                "originalText": "A CINEMATIC MASTERSTROKE"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands as a cinematic triumph that blends power, intellect, and raw emotion into a breathtaking experience. Directed with precision and vision, the film redefines the boundaries of Indian storytelling - merging cultural depth with world-class technical finesse. From its opening scene, the narrative commands attention and never lets go, drawing viewers into a world where morality is tested, genius clashes with ambition, and human resilience takes center stage. The film&#39;s protagonist, portrayed with magnetic intensity by the lead actor, delivers a performance that feels both grounded and transcendent. Each expression, pause, and dialogue carries the weight of lived experience. The supporting cast complements him beautifully - every secondary character adds a layer to the story&#39;s complexity rather than merely supporting it. Visually, Dhurandhar is a feast. The cinematography captures India&#39;s stark contrasts - from bustling cities to hauntingly quiet landscapes - with a painter&#39;s eye. The background score, subtle yet evocative, amplifies every emotional beat without ever overpowering it. The screenplay balances sharp intelligence with moments of silence that speak louder than words. What truly sets Dhurandhar apart is its theme - the internal battle between brilliance and conscience. It doesn&#39;t preach; it invites contemplation. By the time the credits roll, you&#39;re left both exhilarated and introspective, as if the story has etched itself into your conscience. In an era crowded with formulaic thrillers and superficial drama, Dhurandhar stands tall as a masterclass in intelligent cinema. It&#39;s a rare film that satisfies heart, mind, and soul - earning every bit of its five-star rating."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010166/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012621",
              "author": {
                "username": {
                  "text": "shubhams-9782"
                },
                "userId": "ur211583546"
              },
              "summary": {
                "originalText": "Real, Authentic and FUN!!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie not only captures the real situations of that time but also mixed it with just enough fiction to have fun. I never realised how 3 hrs passed away. A true gem of a movie, cannot wait for part 2.<br/><br/>The names of characters are exactly as real life and the casting seems spot on. Finally a Bollywood movie tgat was actually good."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012621/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11065128",
              "author": {
                "username": {
                  "text": "manngolkiya"
                },
                "userId": "ur185415733"
              },
              "summary": {
                "originalText": "National best real story"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I got increable story for nation. The whole story tell as that how nation try to defend the people of nation. The India defense system try to be pre-ready of an disaster made by Enemy of india.<br/><br/>Jay Hind!<br/><br/>Jay Bharat!<br/><br/>Be one nation, Be one responding citizen<br/><br/>Thanks You.<br/><br/>By film crew and director."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11065128/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013351",
              "author": {
                "username": {
                  "text": "SurajS-17"
                },
                "userId": "ur200152025"
              },
              "summary": {
                "originalText": "Mind-blowing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best movie I have ever watched it&#39;s beginning of new Indian cinema.if I simply say about the movie it&#39;s very good because it resembles with the reality ! And the acting is really awesome ! Especially akshaya khanna his work in this movie again Nice mean can able forgot the character Rahman daket."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013351/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015959",
              "author": {
                "username": {
                  "text": "qjnwpcqddc"
                },
                "userId": "ur156597481"
              },
              "summary": {
                "originalText": "Best movie from Bollywood -2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurindar&#39; isn&#39;t just a film; it&#39;s an experience that immerses you from the first scene to the last. The storytelling is exquisitely layered-every event feels meticulously crafted and seamlessly connected. The narrative flows so naturally that not once do you feel a lull or a misstep. The performances are top-notch, with Akshaye Khanna delivering some of his finest work to date. Each character stands out distinctly, yet the ensemble moves together like a well-conducted symphony.<br/><br/>What truly amazed me is how &#39;Dhurindar&#39; kept me on the edge of my seat the entire time. Even as someone who often dozes off during lengthy films, I found myself utterly riveted. The pacing is pitch-perfect, and not a single scene feels unnecessary. The music and dialogues are equally impressive, enhancing the emotional depth and the overall grandeur of the film.<br/><br/>In the end, you truly understand why Ranveer Singh emerges as the hero who will carry the torch forward. With the next installment slated for March 19th, I&#39;m already counting down the days. &#39;Dhurindar&#39; is a cinematic triumph that sets a new benchmark for storytelling, and I can&#39;t recommend it highly enough."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015959/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015386",
              "author": {
                "username": {
                  "text": "Tulcharam"
                },
                "userId": "ur211604048"
              },
              "summary": {
                "originalText": "Shandar jabardast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar&quot; is an engaging and powerfully crafted film that impresses the audience with its storytelling, performances, and emotional depth. The movie revolves around the journey of an ordinary man who rises above challenges, struggles, and personal battles to become truly &quot;dhurandar&quot; - extraordinary in every sense. The narrative is inspirational and keeps the viewer connected from beginning to end.<br/><br/>The film&#39;s biggest strength lies in its acting performances. The lead actor delivers a remarkable portrayal, balancing vulnerability and strength with perfection. His expressions, dialogue delivery, and emotional range elevate the film to another level. Supporting actors also do full justice to their roles, adding realism and depth to every scene.<br/><br/>The direction is sharp and thoughtful. The filmmaker maintains a tight grip on the story, ensuring that every moment serves a purpose. The pacing is smooth - neither too fast nor too slow - allowing the audience to absorb the emotions and message of the film. The cinematography beautifully captures both the intensity and simplicity of the story&#39;s backdrop, enhancing the film&#39;s overall mood."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015386/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016723",
              "author": {
                "username": {
                  "text": "hdsjrhks"
                },
                "userId": "ur165802469"
              },
              "summary": {
                "originalText": "Superb Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Hats off to Aditya Dhar to give Ranveer Singh a blockbuster movie.<br/><br/>You beauty Akshaye Khanna .. Just loved his acting.<br/><br/>Now the Real story of congress govt is known to everyone .<br/><br/>I am just wondering how beautifully you have used all the big actors like Sanjay Dutt Sir , R madhavan and Arjun Rampal.<br/><br/>Best movie of the year so far."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016723/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007854",
              "author": {
                "username": {
                  "text": "Suryansh-84"
                },
                "userId": "ur211552332"
              },
              "summary": {
                "originalText": "Absolutely Terrific 💯"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What an amazing movie , worth the hype ,cast , cinematography,music ,story everything was top notch. Everyone delivered such great performances , Aditya Dharrr !! You killed it, same can be said for Akshay and Ranveer and rest of the cast , excited for 2nd part , definitely a theatre worthy movie.a Must Watch."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007854/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014086",
              "author": {
                "username": {
                  "text": "karniksun"
                },
                "userId": "ur116312612"
              },
              "summary": {
                "originalText": "Amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshay Khanna and Ranveer deliver incredible performances as convincing characters. The storytelling is fantastic and each character&#39;s introduction is handled well. The entire team deserves a big thank you. For the next part, a bit less gory violence would be appreciated. We understand it&#39;s a violent series but it doesn&#39;t need to be overly uncomfortable for viewers."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014086/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007011",
              "author": {
                "username": {
                  "text": "rajr-70172"
                },
                "userId": "ur115076901"
              },
              "summary": {
                "originalText": "A Blockbuster Feast of Drama and Stars"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From intense confrontations to quiet, introspective moments, every scene feels purposeful and meticulously constructed. Ranveer Singh dominates the screen with his magnetic presence, portraying internal conflict with subtle gestures and commanding dialogue delivery. Direction expertly balances sprawling action with detailed character arcs, maintaining narrative cohesion over a lengthy runtime. The supporting cast enhances the story, bringing authenticity to every subplot. Cinematography captures both chaos and stillness with equal artistry, while the sound design and score heighten tension at key moments. The film explores the murky intersection of politics and crime without resorting to clichés, and the climax delivers high stakes with emotional depth. This is a film that challenges viewers while providing thrilling, unforgettable entertainment."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007011/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}