{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4v6rdjsqyxdo6id7swh3nrwr3rmobj53qodd7hkalo6qebgnesk2dc3oy3ftjch52zwox3x5nekecbhzlvzfjfqoy",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11050352",
              "author": {
                "username": {
                  "text": "mobashir_rahman"
                },
                "userId": "ur62325123"
              },
              "summary": {
                "originalText": "Great Characters. Great looks. Story is intriguing. Action scenes are filmsy at best, stupid at worse. And all the propaganda is even worse."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is, at its core, a strong drama film with a compelling premise. The plot is ambitious and gripping, delivering a brutal spy thriller that does not shy away from R-rated violence. When the film works, it is genuinely intense-often shocking-and succeeds in creating a dark, unsettling atmosphere that keeps the viewer engaged.<br/><br/>One of the film&#39;s greatest strengths is its character development. The story of an Indian prisoner on death row being recruited by Indian authorities to infiltrate the Pakistani mafia is both morally complex and dramatically rich, and the film takes its time building this arc effectively. Ranbir Kapoor (or Ranbheer, as commonly referred to) convincingly embodies a battle-hardened Baloch spy-physically brutal, emotionally scarred, and psychologically convincing. His performance anchors the film and gives weight to the narrative.<br/><br/>The antagonists are equally well-realized. Akshaye Khanna&#39;s portrayal of Dacoit Rehman is particularly chilling. A man who murdered his own mother at the age of fifteen, Rehman is depicted as someone capable of a level of violence that goes far beyond normal human comprehension. Khanna brings a cold, restrained menace to the role, making Rehman feel genuinely dangerous rather than theatrically evil. Arjun Rampal also delivers a strong performance as a shrewd Pakistani intelligence officer, adding another layer of tension and strategic complexity to the story.<br/><br/>Unfortunately, many of these strengths are undermined by consistently weak action sequences. The action often feels random, poorly staged, and narratively incoherent. Scenes such as people casually opening fire to kill Rehman&#39;s son lack emotional grounding or logical buildup. The escape sequence involving Hamza and his partner is unintentionally laughable, draining tension instead of heightening it. Even the final killing of Rehman-a moment that should have been climactic and devastating-feels oddly flat and underwhelming. These issues are not isolated but symptomatic of Bollywood&#39;s long-standing struggle with believable, well-choreographed action.<br/><br/>More troubling than the action, however, is the film&#39;s overt ideological messaging. Beneath the surface, Dhurandhar strongly suggests that the previous secular Indian government was corrupt, weak, and unpatriotic, while implicitly aligning itself with the worldview promoted under the current ultra-nationalist, ultra-religious Modi government. Given the political climate, it is difficult to ignore the incentives to advance such narratives-particularly those that delegitimize Congress while reinforcing a nationalist moral framework.<br/><br/>The film claims to be fictional, yet it deliberately invokes real, sensitive terrorist attacks on Indian soil and even incorporates real audio tapes from actual events. This selective &quot;fictionalization&quot; feels disingenuous. Rather than serving the story, it functions as a tool to stoke fear, reinforce the idea of a perpetual external enemy, and subtly normalize suspicion toward India&#39;s Muslim minority. In this sense, the propaganda is not just heavy-handed-it is ethically troubling, using cinematic spectacle to legitimize political narratives and social pressure.<br/><br/>In the end, Dhurandhar is a film full of contradictions: strong performances, an intriguing plot, and impressive brutality weighed down by weak action execution and deeply problematic ideological messaging. What could have been a powerful, morally complex spy drama instead becomes a film that entertains, disturbs, and frustrates in equal measure."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11050352/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11092635",
              "author": {
                "username": {
                  "text": "IsfakR"
                },
                "userId": "ur206736353"
              },
              "summary": {
                "originalText": "Old Spy Formula, New Packaging"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The same concept has been made a thousand times. The director says the movie is fictional, but the entire film uses footage from real events, and the story clearly mirrors real incidents. The only part that deserves appreciation is Akshaye Khanna&#39;s acting. Otherwise, it&#39;s just a higher-quality version of the old India-Pakistan spy concept."
                }
              },
              "authorRating": 1,
              "submissionDate": "2026-01-03",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 4
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11092635/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018311",
              "author": {
                "username": {
                  "text": "DhirajK-020"
                },
                "userId": "ur211625765"
              },
              "summary": {
                "originalText": "Dhurandhar experience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar sets out to deliver a sharp action drama with a strong emotional core, and for the most part it holds your attention. The story follows a man trapped between loyalty, revenge and his own moral boundaries. The plot feels familiar at times, but the film keeps you engaged with its steady pace and a few solid twists.<br/><br/>The lead performance is the real highlight. The actor carries the film with confidence and brings weight to the emotional scenes. The supporting cast does a decent job, although some characters could have been written with more depth.<br/><br/>The action scenes are well-shot and pack good energy. The background score lifts many moments and gives the film a stylish feel. On the other side, the screenplay dips in the middle and a few scenes stretch longer than needed. A bit more polish in the writing would have made the experience tighter.<br/><br/>Overall, Dhurandhar is a watchable entertainer with strong moments, good action and a committed lead performance. It isn&#39;t perfect, but it delivers enough to keep you invested, especially if you enjoy gritty emotional dramas."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018311/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006683",
              "author": {
                "username": {
                  "text": "imdbfan-1043041545"
                },
                "userId": "ur198933650"
              },
              "summary": {
                "originalText": "Action, Drama, and a Star-Studded Powerhouse"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative&#39;s careful construction makes each revelation impactful. Ranveer Singh carries the film with a mix of intelligence and emotional depth, while Sanjay Dutt dominates every scene with authority. Akshaye Khanna and R Madhavan enrich the story through nuanced performances, and Arjun Rampal&#39;s controlled intensity contrasts beautifully with Sara Arjun&#39;s emotional weight. Director Aditya Dhar balances high-octane action with strategic storytelling. Cinematography captures both chaos and subtle character moments, while editing maintains a gripping pace. The climax combines suspense and emotion, leaving a lasting impression."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006683/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016649",
              "author": {
                "username": {
                  "text": "areeb-50613"
                },
                "userId": "ur150029143"
              },
              "summary": {
                "originalText": "A Canvas of Charm: Dhurandhar is a Delightful Masterpiece!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film Dhurandhar is an intense spy thriller powered by some incredible acting. The main actors are: Ranveer Singh, Akshaye Khanna, R. Madhavan, Sanjay Dutt, Arjun Rampal, and Sara Arjun.<br/><br/>Ranveer Singh (The Lead): Delivers a &quot;feral and electrifying&quot; performance. His commitment to the intense, gritty role is total, making his character the compelling anchor of the entire film. Critics are calling it one of his most powerful acts.<br/><br/>Akshaye Khanna (The Antagonist): He is the undisputed scene-stealer, giving a &quot;masterclass in acting.&quot; His portrayal of the menacing villain is hailed as chilling and formidable, commanding every moment he&#39;s on screen with magnetic, underplayed intensity.<br/><br/>R. Madhavan: Provides a strong, authoritative presence as the sharp intelligence strategist, rounding out the core team with gravitas and maturity.<br/><br/>Sara Arjun: Her performance is praised for providing essential emotional depth to the high-stakes narrative, showing great range opposite the veteran stars.<br/><br/>In short, you go for the action, but you stay for the phenomenal acting, particularly the powerhouse showdowns between Ranveer Singh and Akshaye Khanna!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016649/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010974",
              "author": {
                "username": {
                  "text": "anayjha"
                },
                "userId": "ur132713187"
              },
              "summary": {
                "originalText": "Must Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I know people might think that movie is too long but trust me when you sit too watch, it feels like you want more of it and keeps you on your toes for the whole session. Each character is well written and acted. Very eager to watch the second part and hope Aditya Dhar builds this into a spy universe and show the reality to Indian audience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010974/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013240",
              "author": {
                "username": {
                  "text": "synapsewithsachin"
                },
                "userId": "ur158415438"
              },
              "summary": {
                "originalText": "A MasterCLASS in moviemaking"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I had reluctantly gone to watch this with my wife and a friend group thinking 3 and 1/2 hr will be a drag watching heavy violence. It has been a while since I had enjoyed a movie in totality... time just went by.<br/><br/>The cast was like made for the film. Music show cases every new scene. Story, screenplay and cinematography was such a refreshing change from classic Bollywood. Watching this will will make it hard to go back to the regular Bollywood masala fare. In the trailer I felt there is a lot of violence but in context and the situations of the movie it feels organic... Quodos to Dhar and his team."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013240/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015720",
              "author": {
                "username": {
                  "text": "dubeyrishabh-78548"
                },
                "userId": "ur117017442"
              },
              "summary": {
                "originalText": "Blockbuster Movie Must Watch 🔥👍"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just finished watching this cinematic gem by\n@AdityaDharFilms\nand Wow!!<br/><br/>It&#39;s a raw, unapologetic tribute to India&#39;s unbreakable spirit! From heart-pounding action sequences that echo our real-world heroes to lyrics that hit like a thunderbolt:\n&quot;If you are an enemy of India, we will find you and eliminate you wherever you are.&quot; Chills, every time. This isn&#39;t just a movie; it&#39;s a rallying cry for every Bharatiya. The visuals? Stunning. The message? Timeless. In a world full of noise, this cuts through with pure deshbhakti. Kudos to the entire cast &amp; team behind it .<br/><br/>Don&#39;t Fall for the Propaganda by Leftists and Liberals.<br/><br/>Dhurandhar is an Amazing Movie.<br/><br/>Go and Watch Now!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015720/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022834",
              "author": {
                "username": {
                  "text": "PankajS-129"
                },
                "userId": "ur211663269"
              },
              "summary": {
                "originalText": "Epic Filmmaking skills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I have watched many Bollywood movies (not in cinema) but didn&#39;t liked many recently because of same love story, copied music and outdated concepts. This movie and Uri have put new horizons for Bollywood. You will like it and will not feel burden to watch. Go to cinema for good experience and to appreciate the work."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022834/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006516",
              "author": {
                "username": {
                  "text": "brlesmeq"
                },
                "userId": "ur176954043"
              },
              "summary": {
                "originalText": "A Firestorm of Feelings and Fights"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene feels purposeful, from dialogue-heavy political discussions to high-octane action sequences. The cast delivers consistently powerful performances, making this film unforgettable in both execution and impact\nFrom start to finish, Dhurandhar is anchored by remarkable performances guided by a director with a clear and bold vision. The lead actor&#39;s intensity and commitment are evident in every scene, portraying a character who is both relatable and larger-than-life."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006516/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013216",
              "author": {
                "username": {
                  "text": "vimarshmunsif"
                },
                "userId": "ur57259943"
              },
              "summary": {
                "originalText": "Dhurandar:- A Long And Engaging Bollywood Flick After A Long Time"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "/Dhurandar:- A Long And Engaging Bollywood Flick After A Long Time/<br/><br/>Amidst the ever reducing attention span of human beings, and the constant urge to chop and change, to do multi-tasking all the time, watching long movies has become almost obsolete. Even the makers have noticed this change of guard and are not indulging in making long flicks. Thus, knowing beforehand that Dhurandhar was a long movie made me a tad bit sceptical. But still, as has been the norm of late, I didn&#39;t watch the trailer and was keenly looking forward to watch the movie on the big screen.<br/><br/>The presentation of chapter wise progression was different and unique. It enabled succession and gradual movement of the plot towards its ultimate destination.<br/><br/>For a long time now, Bollywood has become propaganda driven and tilted history in the name of showing new reality or hidden reality. Thus, believing stuff has become difficult. Hence, for this movie, I went with a clear mindset of only watching it as a movie. It helped in staying put throughout without seemingly reaching to any sort of conclusion or judgements.<br/><br/>Dhurandhar is a typical Bollywood masala flick, comprising of all the relevant ingredients required for providing entertainment and content. It has a lot of violence, set-up, strategising, deceits, suspense, thrill, action and some songs too. The chapters are well compiled, with the perfect Bollywood touch, making for a delightful experience of watching the movie on the big screen.<br/><br/>The length of the movie is 3 hours 32 minutes with the first half being over 2 hours long. Some of the Bollywood movies these days end by the time this movie&#39;s first half got over. I had no issues with the length of the movie though. Yes, some scenes could surely have been removed or shortened, but never did it feel like the movie was boring in parts. There was always some twist, some new plot, some new character, that brought excitement and the urge to know what&#39;s next as such.<br/><br/>What I find amusing every time I watch a Bollywood movie is the writing of the fight sequences. Please make it believable man! Too much cinematic liberty spoils the fun. I would suggest the makers to hire some WWE script writers to officially write proper fight sequences for Bollywood movies, so that they can seem a tad bit believable too.<br/><br/>The writing and direction by Aditya Dhar was engaging and compelling. The chapter wise setup made it feel like a long web series being shown on the big screen. Again, just like the web series&#39;, the ending left a lot to be desired. We would have to cling on to what next now to see where it all ends. There was a big disclaimer in the beginning of the movie, which felt a bit too much. Some real life clips were slipped in amidst the written script, to boast the movie watching experience. Still, the kind of intense buildup which the first half had, I expected it to go up a notch in the second half. But the film fell flat instead.<br/><br/>The casting by Mukesh Chhabra was brilliant. I would point out on some amazing picks later. The ensemble cast together did a really good job. The look, the get up, were all outstanding too.<br/><br/>Cinematography by Vikash Nowlakha was good. The colours used, a nice blend of dark and light, the frames captured, some really close and difficult for the eyes, were all terrific.<br/><br/>I don&#39;t know if editing was bad or needed polishing coz I didn&#39;t feel bored. Yes, the second half should have been more intense and some scenes could have been removed or cut short. But I would say that Shivkumar V. Panicker has done an average job as an editor for this movie.<br/><br/>The dialogues were heavy, with abuses being hurled for fun too. There were adult dialogues aplenty. There were some over the top Urdu dialogues too, which gave a good listening without much understanding!<br/><br/>The music of the film was composed by Shashwat Sachdev. I felt the music was decent, given the dreadful quality of it these days. Nothing outstanding, but still, quite okay.<br/><br/>However, the film has used so many of the yesteryear gems. I don&#39;t know if enough credits were given to the original makers or not. But songs like Chupke Chupke Raat Din, Ramba Ho, Om Shanti Om, remix version of Monica Oh My Darling, Piya Tu Ab To Aaja, Hawa Hawa and Dum Maaro Dum were used big time in the movie. Again, it just shows how they ain&#39;t able to make proper music and have to go back to the old gems for survival. Surely, these gems added to the plus points of the movie.<br/><br/>Coming to the performances, I have never been a fan of Ranveer Singh. I have only liked his performance in Lootera. However, he has done a really good job here. He hasn&#39;t gone overboard this time. A bit bulky, with long hair, looking a tad bit like Ishant Sharma, he stuck to his role and did a decent job.<br/><br/>The look of R Madhavan was outstanding. He spoke his dialogues brilliantly and showed some emotions perfectly too.<br/><br/>Akshay Khanna was good too. He had that constant look and persona that defined him. Also, I loved the couple of instances wherein he danced a bit, especially the dance sequence in Balochistan, with the Valla Valla and marshmallow song.<br/><br/>Chapter 5 was titled Jinn and the way the Chapter 4 had ended, I surely knew it was time for Sanju Baba to arrive. There&#39;s an aura of awesomeness that governs Sanjay Dutt. I just loved his screen presence. They had mentioned &quot;Special Appearance&quot; in his name but I didn&#39;t feel like it was such a role. He was an integral part of the movie.<br/><br/>Danish Pandor had a big role and he did a really good job. I loved his performance. Rakesh Bedi was in a pivotal role and he delivered a great performance too. Arjun Rampal had a good role and he surely made an impact too.<br/><br/>Saumya Tandon came in as a surprise in the movie and it was good to see her again on the big screen. Also, the girl Sara Arjun impressed with her looks and dialogue delivery.<br/><br/>Now, lemme focus on the 3 best performances in the movie for me. First, it was an absolute delight to see Akash Khurana in a role in the movie. He&#39;s still got it and his look was really good too. I&#39;ve been a fan of Naveen Kaushik since Rocket Singh days. He was outstanding as Donga here, as the loyal servant. Such a phenomenal performance from him it was. He has also become a bit bulky now.<br/><br/>And now, guess what, the best performance for me was that of Gaurav Gera, as Mohammad Aalam. Remember him, yeah! It is difficult to even recognise him but what a sheer class performance it was from him! I totally didn&#39;t expect him and was pleasantly surprised with both seeing him and also him delivering an excellent performance overall.<br/><br/>All in all, there&#39;s a lot of violence, action, fights and revenge in the movie. The efforts that have gone into making the looks of the cast is commendable.<br/><br/>Also, some chapters started and ended. However, there&#39;s still more to come from how things unfolded in the end.<br/><br/>Thus, Dhurandhar was a long but an engaging movie. The first half was incredible. Comparatively, the second half left a bit more to be desired. The usage of old songs felt bad but added so much to the flavour of the movie.<br/><br/>I would rate the movie 3.5/5."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013216/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044980",
              "author": {
                "username": {
                  "text": "JonnyR-40"
                },
                "userId": "ur206898747"
              },
              "summary": {
                "originalText": "Waste of time and money"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Worst movie i have seen ever, 4 hours waste. No spy kind of story and action which was expected.<br/><br/>Ha Ranveer has been downgraded after this movie.<br/><br/>I wont recommend this movie as its just total waste of time and money.<br/><br/>Ending is also worst, and there is a second part coming in 2026, do not watch it. It may be of 6 hours."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 4,
                "downVotes": 40
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044980/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004614",
              "author": {
                "username": {
                  "text": "Rahulb-3067"
                },
                "userId": "ur208274250"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I just finished watching *Dhurandhar*, and I really enjoyed it. The film is based on real-life events, which makes it even more engaging. It&#39;s a spy-themed movie and a bit long, but not once did it feel boring. The pacing, story, and performances kept me hooked throughout. Overall, it&#39;s a gripping and well-made film that&#39;s absolutely worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004614/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006783",
              "author": {
                "username": {
                  "text": "imdbfan-9058522362"
                },
                "userId": "ur198933839"
              },
              "summary": {
                "originalText": "Edge-of-Your-Seat Action and Emotion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From its first frame, the film establishes a world of danger, loyalty, and moral ambiguity. Ranveer Singh shines as a conflicted protagonist, his performance oscillating between fierce determination and inner turmoil. Sanjay Dutt anchors the story with gravitas, while Akshaye Khanna and R Madhavan elevate the narrative with their intelligence and subtlety. Arjun Rampal&#39;s understated menace creates constant tension, and Sara Arjun&#39;s innocent yet impactful performance adds emotional depth. Aditya Dhar&#39;s direction balances suspense, strategy, and visceral action, ensuring the pacing never falters despite the long runtime. Cinematography captures both sprawling urban chaos and intimate character moments, while the soundtrack enhances tension without overwhelming the story. By the climax, every thread converges in a meticulously crafted, high-stakes finale."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006783/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020158",
              "author": {
                "username": {
                  "text": "iamrochoudhary"
                },
                "userId": "ur122074447"
              },
              "summary": {
                "originalText": "Aditya dhar Certified GOAT at ragebaiting indian cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ngl the cast slayed akshaye khanna&#39;s oscar wale aise hi hote hai performance never stopped aura farming 🛐📈\nWhat truly sets Dhurandhar apart is its score and soundtrack.the music fuses classical Indian ragas with contemporary beats, creating anthems that linger long after the credits roll. Tracks like the title song are instant earworms, perfectly syncing with the film&#39;s patriotic fervor without feeling forced."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020158/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006451",
              "author": {
                "username": {
                  "text": "ufixksgr"
                },
                "userId": "ur176952974"
              },
              "summary": {
                "originalText": "A Cinematic Clash of Grit and Glory"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What sets the film apart is its ability to balance intense action with deep emotional resonance. Ranveer Singh&#39;s portrayal of a morally conflicted protagonist is riveting, bringing humanity to every perilous situation. The director expertly navigates complex plotlines, making each twist feel earned."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006451/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023471",
              "author": {
                "username": {
                  "text": "pmd-05026"
                },
                "userId": "ur112398831"
              },
              "summary": {
                "originalText": "Fabulous....!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The performances are outstanding - every actor has done complete justice to their role, especially the lead, who delivers a commanding and memorable performance. The dialogues are powerful, the background score perfectly elevates key scenes, and the cinematography adds great depth and realism to the narrative.<br/><br/>What truly stands out is the film&#39;s raw intensity and emotional impact. The direction is confident, the screenplay is tight, and the execution feels authentic and impactful.<br/><br/>Overall, Dhurandhar is a must-watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023471/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013826",
              "author": {
                "username": {
                  "text": "AmitB-3837"
                },
                "userId": "ur211592851"
              },
              "summary": {
                "originalText": "Dhurandhar - bharat mata ki Jai"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A movie which tells you india has come of age. A far cry from the spy movies where the ISI spy gyrates her hips in a scanty swimsuit. Just sick of watching the love thy neighbour kinda stories. When the neighbour is your sworn enemy hellbent on hurting india the response shown must be the same. What is the truth should be shown, if you don&#39;t have the stomach for seeing what the neighbour does then please migrate there."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013826/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11047110",
              "author": {
                "username": {
                  "text": "gijuroshan"
                },
                "userId": "ur165275205"
              },
              "summary": {
                "originalText": "Durandhar movie.my review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A good mesmerising movie thriller in the present Era. Good acting and direction by all crew and skill to be pIsed for keeping us rooted to the seats until the movie ends and still picture aby backy Hai yaar, A small contribution to the struggle of soldiers who work undercover. But how pak people would take this movie is to be seen."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11047110/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018003",
              "author": {
                "username": {
                  "text": "Avinash-91"
                },
                "userId": "ur204845662"
              },
              "summary": {
                "originalText": "PKMB"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;PKBM - Aditya Sir is truly top-notch.<br/><br/>This is the kind of reality all other directors should show us. It&#39;s a film that some groups in Pakistan wouldn&#39;t want us to watch.<br/><br/>The 26/11 scenes gave real goosebumps.<br/><br/>For the next part, I&#39;d like to see a sequence involving an Indian spy and the pressure tactics used during intelligence operations."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018003/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11035358",
              "author": {
                "username": {
                  "text": "abhishekgkt"
                },
                "userId": "ur68445125"
              },
              "summary": {
                "originalText": "An overrated Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The actual rating of the movie should be around 7. The acting and cast selection is good but a few characters were overly added. Songs, music and their placement is excellent. Story is average. Direction is good but disappoints sometimes. Action is average and dialogue do not amused much. Some scenes appear to be just inserted for making it a lengthy movie, having no logic and all. The MLA&#39;s house and daughter at some scenes appear to be heavily guarded as expected but at sometimes totally unguarded making it easier for the Hero to intervene at ease and at his will. No strong story or plot."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11035358/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012855",
              "author": {
                "username": {
                  "text": "jayendrayechuri"
                },
                "userId": "ur118978196"
              },
              "summary": {
                "originalText": "Unprecedented"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every thing about the movie reflects the intent with which it is made, from the gore to, picturesque shots, character building, the amount of minute storylines going behind the scores of the entire movie. Even the theme songs accurately convey the emotions, the setting of the scenes. Without giving any spoilers, I&#39;d say you&#39;ll never be ready for what&#39;s coming from either of the starcast."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012855/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010804",
              "author": {
                "username": {
                  "text": "deeptivikas"
                },
                "userId": "ur129393218"
              },
              "summary": {
                "originalText": "Loved it"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Amazing just amazing 3.5hr movie and i was on the edge of the seat the whole time. The movie stick to reality and shows how at ground level these spy works.<br/><br/>Each and every actor fits perfect for their role.<br/><br/>And Akshaye Khanna is surreal. Kudos to Aditya Dhar for such an amazing direction.<br/><br/>Absolute Banger."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010804/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029509",
              "author": {
                "username": {
                  "text": "Jayalakshmi-6"
                },
                "userId": "ur211712404"
              },
              "summary": {
                "originalText": "Best movie of 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I like the way the director show the Pakistan as this and the story was real and I just like the movie. Mumbai 26/11 attack that is true and the audio recording scene my blood was boiling in that moment and the whole theatre was silent pain drop silent. I am waiting for the part to eagerly I will go and first day first show for the part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029509/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010674",
              "author": {
                "username": {
                  "text": "officialshubham-26194"
                },
                "userId": "ur154312575"
              },
              "summary": {
                "originalText": "⭐ 11/10 - \"Dhurandhar\" is a must-watch!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar grabbed my attention right from the first scene. The story is tight, engaging, and never drags for a moment. The direction is sharp, and every frame feels purposeful.<br/><br/>The performances are outstanding. The lead actor, especially, brings so much depth and emotion that you genuinely feel connected to the character. The film&#39;s visuals are stunning, and the background score adds the perfect amount of tension and atmosphere.<br/><br/>What I loved most is how the movie balances entertainment with meaning. It&#39;s thrilling, emotional, and leaves you thinking even after it ends.<br/><br/>Overall, Dhurandhar is a brilliantly made film that stays with you. Highly recommended!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010674/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}