{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6rcrntazcwzy47wwxznjqrltmwcjy3mntx6pma7b6mqbdf4skydk3oy2vvnjyodba57k3v23fyhl6ilqb3osqn64q",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11082666",
              "author": {
                "username": {
                  "text": "satendersingh-70167"
                },
                "userId": "ur89260638"
              },
              "summary": {
                "originalText": "Dhurandhar is an absolute powerhouse of a film."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is pure cinematic fire.<br/><br/>From the very first frame, the film grips you with its raw energy and never lets go. The storytelling is sharp, intense, and unapologetically bold, exactly the kind of cinema that reminds you why the big screen still matters.<br/><br/>The performances are powerhouse-level, dripping with conviction and grit. Every character feels lived-in, every emotion earned. The direction is confident and stylish, balancing mass appeal with depth, while the background score elevates key moments to goosebump territory.<br/><br/>What truly sets Dhurandhar apart is its attitude, it doesn&#39;t play safe. It&#39;s fearless, immersive, and packs a solid punch, leaving a lasting impact well after the credits roll. This is the kind of movie that sparks conversations and stays with you.<br/><br/>A must-watch for anyone who loves strong performances, high-voltage drama, and cinema that dares to go all in. Absolute applause-worthy stuff."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-01",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11082666/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044294",
              "author": {
                "username": {
                  "text": "chummu-20270"
                },
                "userId": "ur165230147"
              },
              "summary": {
                "originalText": "It was awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie based on real story. Durandar is a indian hero story as a indian must watch support this type of movies it&#39;s an inspiration for all young generation. Overall, Durandar is not just a movie-it is an experience that reflects real-life truth, bravery, and resilience. A must-watch movie 🍿🎥🍿🍿🍿🍿🍿🍿"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044294/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010937",
              "author": {
                "username": {
                  "text": "vglingaraj"
                },
                "userId": "ur73937855"
              },
              "summary": {
                "originalText": "Must watch for Indians"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping, high-octane thriller that keeps you hooked from start to finish. Ranveer delivers a fierce, outstanding performance, and Akshaye Khanna adds real depth. The action, visuals, and pacing are top-notch, making this a must-watch for fans of intense, stylish cinema.<br/><br/>Mera bharath mahan."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010937/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017766",
              "author": {
                "username": {
                  "text": "AshutoshN-95"
                },
                "userId": "ur211619605"
              },
              "summary": {
                "originalText": "Amazing showing the reality"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Acting superb.everyone did fabulous job and the reality hita hard . Never felt like 3.5 hrs movie.akhaye khanna did wonderful portraying rehman dakait.this movie unlike other agents movie felt real and emotional too. The pace of the movie and sequencing was very good . The guts to show the reality is teuly inspiring."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017766/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013014",
              "author": {
                "username": {
                  "text": "deepsaug"
                },
                "userId": "ur173331086"
              },
              "summary": {
                "originalText": "Blasting!! Mr.Dhar you nailed in your craft!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is 3h30 min long but you will be glued to the screen... Ranveer Singh &amp; Akshaye khanna show it was! Movie has fantastic music &amp; you gonna dance while watching specially the retro music which is used! Ramba ho ho &amp; hawa hawa! Mind-blowing. Aditya dhar has created a masterpiece with real clips &amp; scenes in the movie..it&#39;s heartbreaking to see. Waiting for 19 march for the next part! 10/10 #adityadhar #dhurandar."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013014/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016073",
              "author": {
                "username": {
                  "text": "ChinmayG-66"
                },
                "userId": "ur211608659"
              },
              "summary": {
                "originalText": "Superb movie. All should watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Review of the 2025 Hindi Film Dhurandhar<br/><br/>&quot;Dhurandhar&quot; (2025) steps into Bollywood as a gritty action-drama built around honour, revenge, and the fight against a corrupt system. The film aims to deliver a mix of emotional intensity and larger-than-life heroism-and for the most part, it succeeds.<br/><br/>---<br/><br/>🎭 Story &amp; Screenplay<br/><br/>The plot centres around a man pushed to his limits by injustice. When his family becomes a victim of political greed, he transforms from a quiet, determined worker into a force that refuses to be silenced."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016073/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020570",
              "author": {
                "username": {
                  "text": "ManishS-4323"
                },
                "userId": "ur211643405"
              },
              "summary": {
                "originalText": "BESTEST MOVIE"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is the best movie &amp; the only one so far which has best performances, best reality shown as its not a fictional story &amp; best directed movie. A must watch for everyone. Akshay Khanna is absolutely show stealer. I want to watch action but enjoyed every single thing in the movie. You are thoroughly engaged with the movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020570/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006985",
              "author": {
                "username": {
                  "text": "rohan-4508517241"
                },
                "userId": "ur199124797"
              },
              "summary": {
                "originalText": "A Pulse-Racing Story with Incredible Performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s strength lies in its layered storytelling and compelling performances. Ranveer Singh anchors the narrative with remarkable nuance, navigating internal conflict and external danger. Sanjay Dutt&#39;s presence commands attention, while Akshaye Khanna and R Madhavan enrich the ensemble with depth and complexity. Arjun Rampal&#39;s quiet intensity adds unpredictability, and Sara Arjun&#39;s performance brings a human touch to high-stakes drama. Under Aditya Dhar&#39;s direction, suspense builds organically, balancing explosive action with thoughtful character arcs. Cinematography and sound design enhance immersion, and the narrative&#39;s escalating tension culminates in a thrilling, emotionally satisfying climax."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006985/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011547",
              "author": {
                "username": {
                  "text": "rishavraj-65988"
                },
                "userId": "ur69799598"
              },
              "summary": {
                "originalText": "Loved the music, the action, the thrill."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ranveer singh was made for this role. He suits perfectly in the role of Jaskirat aka Hamza. And to note that this movie was actually inspired by our Indian soldier Major Mohit Sharma, famous Ajit Doval(the devil) sir.<br/><br/>One can never forget our dynamic Akshay khanna sir, man that guy just molds himself in any role, and the moment he started choosing negative, he shone brighter as an actor. Personally, I always loved his acting, his scenes were always passionate.<br/><br/>And for those who love patriotic themes, this one is definitely for you. You would also love the music, the kawwalis, the famous khanna entrance scene.<br/><br/>Overall, a patriotic movie with a perfect blend of spy and thrill with it."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011547/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008399",
              "author": {
                "username": {
                  "text": "Satyajeet_Rathore"
                },
                "userId": "ur182867551"
              },
              "summary": {
                "originalText": "Dhurandhar (2025): Shadows of Fury Unleashed"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar unleashes a 214-minute beast of a thriller, fusing Raazi&#39;s subtlety with Extraction&#39;s brutality. Ranveer Singh&#39;s Jaskirat/Hamza infiltrates Lyari&#39;s chaos as a RAW pawn, unraveling terror webs tied to 26/11 ghosts. Real-inspired ops pulse through betrayals, forbidden love, and explosive set-pieces that grip like a vice.<br/><br/>Akshaye Khanna&#39;s Rehman Baloch? A chilling maestro of malice-elegant evil incarnate. 5/5. Ranveer&#39;s feral transformation roars with heart; Arjun Rampal&#39;s ISI wolf prowls with lethal poise; Sanjay Dutt&#39;s rogue cop thunders justice. 4.5/5 each. R. Madhavan&#39;s chessmaster vibe seals the stellar cast. Rahman&#39;s score thrums tension; action&#39;s a blood ballet. Minor pacing hiccups, but this is 2025&#39;s espionage crown-fierce, unflinching, unforgettable."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008399/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006900",
              "author": {
                "username": {
                  "text": "Rutuja66"
                },
                "userId": "ur199121598"
              },
              "summary": {
                "originalText": "A Mega-Scale Story with Unstoppable Momentum"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The tension in the film escalates gradually, making every confrontation meaningful. Ranveer Singh delivers an intense, layered performance, while Sanjay Dutt commands presence with gravitas. Akshaye Khanna and R Madhavan provide thoughtful, subtle performances, and Arjun Rampal&#39;s quiet menace is consistently palpable. Sara Arjun&#39;s emotional depth raises the stakes for every scene she inhabits. Aditya Dhar&#39;s direction fuses action, suspense, and narrative sophistication effortlessly. Cinematography captures both sweeping vistas and intimate character moments, while the music heightens every dramatic turn. The climax delivers thrilling spectacle and emotional payoff simultaneously."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006900/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11069249",
              "author": {
                "username": {
                  "text": "sanjaykothari-66247"
                },
                "userId": "ur131206103"
              },
              "summary": {
                "originalText": "A landmark"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film is fantastic on so many levels. I will be very surprised if Ranveer Singh doesnt become an international star. The direction, production, set design, casting, music, tempo and most importantly how the director has woven all of it together fearlessly. Its one of the best Indian films of all time."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11069249/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017382",
              "author": {
                "username": {
                  "text": "hazolite"
                },
                "userId": "ur25282585"
              },
              "summary": {
                "originalText": "One word: Awesome!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar delivered an experience that honestly felt like a celebration of Indian cinema&#39;s evolving power. It wasn&#39;t just a movie; it was a full-blown theatrical storm that swept the audience into its world. After witnessing films like Animal and Kantara Chapter 1, which raised the stakes and redefined what mainstream Indian storytelling can look like, I genuinely didn&#39;t expect another film to hit this hard so soon. But Dhurandhar stepped in with confidence and said, &quot;Watch this.&quot; And it absolutely blew the screen apart.<br/><br/>From the moment the movie began, the atmosphere inside the theatre shifted. The visuals had that rugged, earthy authenticity we associate with strong Indian storytelling, while the background score carried the kind of raw, pounding energy that makes your heartbeat sync with the scene. Every frame felt deliberate, every moment felt crafted to pull the viewer deeper into its universe. That&#39;s honestly what makes cinema unforgettable - when the screen stops being just a screen and turns into an experience.<br/><br/>The performances in Dhurandhar were another huge win. Every actor came prepared, delivering intensity, emotion, and presence that you just can&#39;t fake. There&#39;s something magical about watching a movie where the cast and the story feel perfectly aligned, feeding off each other&#39;s energy and building momentum scene after scene. It reminded me of the way traditional blockbuster Indian films used to grip the audience - but with a refreshing, modern execution that today&#39;s generation connects with instantly.<br/><br/>What really stays with you, though, is the film&#39;s unapologetic mass appeal. It embraces the culture, the emotions, the folklore, and the cinematic tradition we grew up adoring - but it upgrades everything in a way that feels forward-thinking and powerful. That combination is rare, and Dhurandhar nails it.<br/><br/>Overall, it&#39;s a film that makes you proud of where Indian cinema is heading.<br/><br/>Massive respect to the makers. Keep it up, Indian cinema! 🙌🔥👌🏻"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017382/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013731",
              "author": {
                "username": {
                  "text": "deepakdeepudeepak-86322"
                },
                "userId": "ur157706881"
              },
              "summary": {
                "originalText": "Singh!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just Ranveer things....\nInsane cast, excellent music, great performance , Brilliant movie.<br/><br/>Cast 10/10\nVisiual10/10\nMusic 10/10\nAction. 7/10\nOverall 8/10\nFavourite episode 8\nFavourite song title track and gehra hua\nFavourite character none other than singh\nPart to is just 3 months away still it&#39;s a long wait..."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013731/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006567",
              "author": {
                "username": {
                  "text": "imdbfan-8468221430"
                },
                "userId": "ur198243630"
              },
              "summary": {
                "originalText": "Emotions Stronger Than Steel"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a cinematic masterpiece that demands attention from the very first frame. The lead actor delivers a performance layered with intensity and subtlety, perfectly capturing the moral conflicts and emotional depth of his character. The supporting cast complements him beautifully, each performance adding texture and nuance to the story. The director&#39;s vision shines through in the way the narrative balances high-octane action with complex political and emotional threads. Every scene is meticulously crafted, and the pacing ensures the audience remains engrossed for the full runtime. The action sequences are realistic, yet stylized, reflecting a perfect blend of choreography and storytelling. The dialogues are sharp, occasionally laced with dry humor that provides brief respite from the tension. The cinematography paints the subcontinent&#39;s geopolitical backdrop vividly, making real-world events feel integrated and authentic. Dhurandhar is not just a movie; it&#39;s an experience that lingers long after the credits roll."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006567/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029293",
              "author": {
                "username": {
                  "text": "mohitarpit"
                },
                "userId": "ur118648599"
              },
              "summary": {
                "originalText": "Absolutely master class"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an absolute triumph in Indian cinema, blending high-octane action with a gripping narrative that keeps you hooked for all 3.5 hours. Aditya Dhar crafts a world that feels authentic and intense, taking us deep into the underbelly of Karachi and the shadowy corridors of espionage.<br/><br/>Ranveer Singh delivers a career-defining performance as Hamza Ali Mazhari, portraying layers of vulnerability, grit, and sheer brilliance. Akshaye Khanna is magnetic as Rehman Dakait, bringing menace and charm in equal measure. The supporting cast-R. Madhavan, Arjun Rampal, and Sanjay Dutt-add gravitas, making every scene count.<br/><br/>The cinematography is stunning, capturing the chaos of Lyari and the tension of covert operations with breathtaking precision. The action sequences are raw and realistic, far from the over-the-top spectacle we often see. The background score is excellent master piece, amplifies the drama without overpowering it, and the dialogues are sharp, leaving a lasting impact.<br/><br/>Yes, the runtime is long, but not a single moment feels wasted. Every frame builds toward a climax that is both shocking and satisfying, setting the stage for the next chapter.<br/><br/>Dhurandhar isn&#39;t just a movie-it&#39;s an experience. If you love intelligent thrillers with emotional depth and stellar performances, this is a must-watch for every Indian !!! Jai Hind\nPS: Ignore leftist and liberals negetive reviews, there is absolutely no negetives about this movie..."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029293/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019558",
              "author": {
                "username": {
                  "text": "deecee-94363"
                },
                "userId": "ur128725575"
              },
              "summary": {
                "originalText": "Gripping"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must watch. Very well made. Stellar performances by the cast. Brings to life the reality of the atrocities orchestrated by the ISI in Baluchistan and cross border terrorism in India. Pakistan is the hub of global state sponsored terrorism and the film brings it out strongly. Take time and invest the 3.5 hours - it is an eye opener."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019558/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003187",
              "author": {
                "username": {
                  "text": "movfun"
                },
                "userId": "ur84895225"
              },
              "summary": {
                "originalText": "Amazing Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I was very worried that would I be able to sit through 3 hr 34 mins of movie, but man was I so wrong. The movie was gripping and amazing. The gore was epic and action sequence were good too and obviously the patriotism angle was good too.<br/><br/>The acting by every single actor is amazing. I think I would deduct just 1 star for a few gun scenes which were unnecessary too long."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003187/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006891",
              "author": {
                "username": {
                  "text": "Hazal222"
                },
                "userId": "ur199121488"
              },
              "summary": {
                "originalText": "Drama That Burns Bright, Action That Hits Hard"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film blends intellectual intrigue with visceral action seamlessly. Ranveer Singh commands the screen, portraying a character full of internal conflict and moral ambiguity. Sanjay Dutt adds authority and menace, while Akshaye Khanna and R Madhavan enrich the ensemble with subtle, impactful performances. Arjun Rampal&#39;s presence brings constant tension, and Sara Arjun&#39;s performance adds human vulnerability. Aditya Dhar&#39;s direction masterfully balances storytelling and action, while cinematography and sound design heighten suspense. By the climax, the narrative delivers both an adrenaline rush and emotional resonance that lingers."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006891/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001841",
              "author": {
                "username": {
                  "text": "anshmahendru-15437"
                },
                "userId": "ur150483701"
              },
              "summary": {
                "originalText": "This one is to be remembered"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The actors. The background score. The screenplay. The direction. The cinematography. Its a movie that got most parts right. Well made spy espionage thriller. The runtime might be an issue. Some scenes featuring the female lead might feel stretched. Its a film to remember for the sheer effort put in by the team that actually comes out beautifully on screen. December&#39;s and gruesome hindi films are getting synonymous for good."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001841/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021374",
              "author": {
                "username": {
                  "text": "imdbfan-5104494259"
                },
                "userId": "ur198026052"
              },
              "summary": {
                "originalText": "Banger of a movie!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Finally a star-studded cast and not only that, the entire cast is so well utilised and none of the characters feel left out. Akshaye khanna having the most screen presence completely stole the show! Loved the techno remixes of older songs which lifted up the entire vibe of the fighting sequences. Loved the soundtrack and all the songs in the movie. Very good storyline and very gripping movie overall. The movie is long but I left the cinema wanting more of everything this movie offered! Absolutely must watch in cinemas if you want to have this experience to the fullest!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021374/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016580",
              "author": {
                "username": {
                  "text": "vikashkranand"
                },
                "userId": "ur37828693"
              },
              "summary": {
                "originalText": "Dhurandhar - A Spy Saga Elevated by Akshaye Khanna"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a riveting espionage drama that thrives on its layered narrative and taut direction. The film plunges viewers into a world of covert operations, betrayals, and national intrigue. While the ensemble cast delivers commendable performances, it is Akshaye Khanna who emerges as the film&#39;s beating heart. His portrayal of a seasoned intelligence officer is both commanding and emotionally resonant, elevating the film beyond a conventional spy thriller.<br/><br/>Aditya Dhar&#39;s Dhurandhar is not just another espionage drama-it&#39;s a high-voltage thriller that redefines the genre. With its layered storytelling, gripping pace, and emotionally charged performances, the film detonates like a well-planned covert operation.<br/><br/>🎬 The Story\nAt its core, Dhurandhar is a tale of spies caught in the shadows of Indo-Pak intrigue. Ranveer Singh plays an undercover agent navigating Karachi&#39;s dangerous alleys, while R. Madhavan and Sanjay Dutt add gravitas to the narrative. The screenplay is ambitious, weaving together political conspiracies, personal sacrifices, and the moral dilemmas of espionage.<br/><br/>Akshaye Khanna - The Showstopper\nWhile the ensemble cast is impressive, it is Akshaye Khanna who steals the spotlight. His portrayal of a seasoned intelligence officer is magnetic-commanding yet nuanced. Critics have noted that Khanna&#39;s performance not only overshadows Ranveer Singh but also marks a career resurgence reminiscent of Bobby Deol&#39;s comeback arc. His dialogue delivery, subtle expressions, and ability to balance authority with vulnerability make him the film&#39;s emotional anchor.<br/><br/>Performances &amp; Direction *****\nRanveer Singh delivers a feral, brooding energy, perfectly complementing Khanna&#39;s calm intensity.<br/><br/>Aditya Dhar&#39;s direction ensures that the film, despite its lengthy runtime, remains engaging with high-octane staging and sharp emotional beats.<br/><br/>The supporting cast, including R. Madhavan and Sanjay Dutt, enriches the narrative with gravitas and depth.<br/><br/>Technical Brilliance:-\nThe background score heightens tension, while the cinematography captures both the grit of espionage and the grandeur of its stakes. Dhar&#39;s vision transforms the spy thriller into a character-driven saga rather than just a spectacle.<br/><br/>Verdict:-\nDhurandhar is a mind-blowing performance-driven spy thriller where Akshaye Khanna shines with unmatched brilliance. His role elevates the film from a conventional espionage drama to a memorable cinematic experience. If you&#39;re a fan of spy sagas, this is a must-watch-both for its gripping narrative and Khanna&#39;s outstanding artistry."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016580/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014060",
              "author": {
                "username": {
                  "text": "ssshelke"
                },
                "userId": "ur92939113"
              },
              "summary": {
                "originalText": "Movie casting saying all truth"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Very good movie everyone should watch. Director, writer did awesome job and he tried to expose Pakistan real face how they work with internally and play a game with india and indian soldiers.<br/><br/>Story, star casting, acting, music, BGM and the most important the aura of akshay khanna 🔥<br/><br/>Each and every actors did fabulous job 👏🏻"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014060/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014065",
              "author": {
                "username": {
                  "text": "absheksrivastava"
                },
                "userId": "ur175339069"
              },
              "summary": {
                "originalText": "Journey to a fact based world"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "For too long Indian spy movies have been dwelling in fictional world. It&#39;s very likely the first Indian spy movie which narrates a fact based account of real world events.<br/><br/>1. Ranvir kapoor: A representation of all &#39;unknown men&#39;. As usual, he ensures that he embeds the character&#39;s soul.<br/><br/>2. Rakesh Bedi: stands out as a slimy punjabi politician.<br/><br/>3. Akshay Khanna: He has gone back to drawing board and came back brilliantly.<br/><br/>4. Sanjay Dutt: The kind of roles that he revels in.<br/><br/>5. Director: Honest to his vision. He had a certain framework in his mind and has stuck to it mostly."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014065/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006473",
              "author": {
                "username": {
                  "text": "sunjay-35490"
                },
                "userId": "ur197686518"
              },
              "summary": {
                "originalText": "Goosebump-Worthy Cinematic Moments"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film grips you immediately with a tension that refuses to ease, showcasing Ranveer Singh at his career-best, navigating the moral complexities of a covert mission. Director Dhar&#39;s vision ensures every frame is meticulously composed, balancing intense action with quieter, introspective moments. Supporting actors add depth, making each encounter layered with stakes. The cinematography and background score heighten suspense while maintaining a grounded realism that lingers long after the credits roll."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006473/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}