{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4vofdjsqyxdo6ia7cwxrmzxrdrm4bb53ektt6hedpj3qflanes22c2sou3u7wygjykdblfyg2tkeinq72vw7jze",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11026858",
              "author": {
                "username": {
                  "text": "pradeepthakur-09208"
                },
                "userId": "ur94122184"
              },
              "summary": {
                "originalText": "Dhurandhar: Strong Start, Mixed Impact"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a movie based on a true event that took place between India and Pakistan.<br/><br/>The star cast has been chosen wisely; however, a few actors could have been ignored and replaced with more suitable choices.<br/><br/>The movie revolves around an incident where an Indian agent is sent to Pakistan to infiltrate and take control of internal gangs, with the objective of curbing anti-India and terrorist activities.<br/><br/>Ranveer Singh plays the role of the Indian agent who enters Pakistan and joins the gang led by Akshay Khanna, a powerful local goon operating there.<br/><br/>Violence scenes are limited, but whenever they appear, they are extremely impactful and executed so effectively that they create a palpable sense of fear in the audience.<br/><br/>Ranveer Singh&#39;s acting is good compared to some of his other films. However, Akshay Khanna&#39;s performance feels average. It&#39;s unclear why there is so much hype around his role, as his acting appears quite normal.<br/><br/>The first half of the movie is very strong. The second half feels slightly stretched, but the climax ultimately covers up the shortcomings and leaves a satisfying impact.<br/><br/>Overall, Dhurandhar is an engaging watch with a strong first half, impactful action sequences and a well-executed climax.<br/><br/>#IndomitablePradeep."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026858/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11072076",
              "author": {
                "username": {
                  "text": "nishithp-4"
                },
                "userId": "ur212037957"
              },
              "summary": {
                "originalText": "Experience of Dhurandhar movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie story is outstanding overall content is also perfect , very much disappointed about using bad words , galis abusive words during the movie absolutely pathetic .. Nowadays it is trend going on then &amp; then only the movies can make a crores but I m totally against about abusive languages it can also work and get success &amp; more crores without galis abusive language as if the story &amp; content r perfect or up to the mark . Don&#39;t use this profanity languages any more it&#39;s my humble request ..."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 9
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11072076/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007865",
              "author": {
                "username": {
                  "text": "doonite-44302"
                },
                "userId": "ur151151208"
              },
              "summary": {
                "originalText": "Good movie after a long time !!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar (2025) is a fast-paced, super engaging thriller that keeps you hooked from scene one. Ranveer Singh absolutely smashes it - his acting is powerful, emotional, and totally believable. The storyline is tight and full of moments that make you go, &quot;Wow, yeh toh next level hai.&quot; The film isn&#39;t afraid to ask tough questions, which definitely ruffles a few feathers, but that&#39;s exactly why it hits so hard. Surprising baat yeh thi ke Bollywood ne itna support nahin dikhaya, but honestly, the movie doesn&#39;t need it. Dhurandhar stands tall purely on solid storytelling and outstanding performances."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007865/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010232",
              "author": {
                "username": {
                  "text": "yuvraajkumar"
                },
                "userId": "ur110316349"
              },
              "summary": {
                "originalText": "A Real Action Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Hardly any bollywood movie can come close to the action in this movie. Everything felt realistic, especially the fight sequences which most movies get wrong in hollywood even today. The punches, the kicks, the swings felt real. And the biggest plus point- it didn&#39;t focus on dance numbers, rather on a fantastic and thrilling story line. Every character had a story to tell, not like a typical bollywood movie which only revolves around 2-3 charaters.<br/><br/>Didn&#39;t know Ranveer Singh had this in him, he has turned me into his fan. Every actor did a terrific job even the supporting actors. Usually in movies you might find the actors with small roles doing an okayish job amd the movie makers completely relying on the main actor&#39;s performance. It truly felt like R Madhvan, Arjun Rampal, Akshaye Khanna, Sanjay Dutt, Sara Arjun, Rakesh Bedi and every other actor played their character exactly how they were meant to. Even the set potrayed pakistan&#39;s environment so well.<br/><br/>I&#39;m glad I watched it in the theatre. A smaller screen wouldn&#39;t have done this movie justice. This movie made me feel like there is still hope for Bollywood. Thank you Aditya Dhar and team."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010232/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006940",
              "author": {
                "username": {
                  "text": "Dhruv727"
                },
                "userId": "ur199122240"
              },
              "summary": {
                "originalText": "A High-Energy Spectacle Driven by Big Emotions"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses audiences in a complex world of crime, politics, and loyalty. Ranveer Singh&#39;s layered performance showcases both inner conflict and physical bravery. Sanjay Dutt brings authority and menace, while Akshaye Khanna and R Madhavan enrich the narrative with subtlety. Arjun Rampal&#39;s quiet threat elevates tension, and Sara Arjun&#39;s emotional scenes give the story human stakes. Aditya Dhar&#39;s direction balances suspense, strategy, and action flawlessly. Cinematography captures chaos and intimacy with equal skill, and the score heightens tension. The second half delivers breathtaking action and deep emotional resonance."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006940/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036559",
              "author": {
                "username": {
                  "text": "vatson-33148"
                },
                "userId": "ur121059410"
              },
              "summary": {
                "originalText": "Exceptional & Brilliant Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I can say with absolute certainty that this movie is not just a brilliant masterpiece, but this movie forever changes what Indian Cinema will be in future. Audience have long awaited this kind of movie. Just mind boggling. Anyone who loves India even a little will find himself/herself going through a roller-coaster of emotions (agony, anger, helplessness), especially during the 26/11 scene. Aditya Dhar has changed Indian Cinema forever!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036559/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013934",
              "author": {
                "username": {
                  "text": "nischal111"
                },
                "userId": "ur97094882"
              },
              "summary": {
                "originalText": "#DhurandharkaDhamaka"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerful, unapologetic film that proudly reflects true Indian spirit. From start to finish, it commands attention with its strength, intensity, and fearless storytelling.<br/><br/>For those who feel jealous-let them be. This movie isn&#39;t made to please everyone; it&#39;s made to stand tall. The performances are impactful, the emotions feel raw, and the pride it evokes stays long after the credits roll.<br/><br/>A film for those who value courage, conviction, and the real essence of being Indian. 🇮🇳🔥\nMust watch!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013934/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011392",
              "author": {
                "username": {
                  "text": "hqbs-93339"
                },
                "userId": "ur167178265"
              },
              "summary": {
                "originalText": "One of the best spy movies"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya dhar has outdone himself in this movie. Story, casting, creating story in between incidents of real life is typical. Screen play is so tight that you cannot leave your seat for 1 minute. You are always on edge of seat. From starting to end story keeps you entangled . Bgm is awesome. Fits perfectly with screenplay. It gives me memories of munich movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011392/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011164",
              "author": {
                "username": {
                  "text": "iambalajiyuvaraj"
                },
                "userId": "ur150665530"
              },
              "summary": {
                "originalText": "A theatrical must watch!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gritty, high stakes spy thriller that shines thanks to powerhouse performances from Ranveer Singh and Akshaye Khanna with strong support from Sanjay Dutt, Madhavan and Arjun Rampal. The world-building and direction pull you in, making it a tense, immersive ride despite its long 214-minute runtime. For a full-on theatrical action experience, it&#39;s a solid watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011164/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11082248",
              "author": {
                "username": {
                  "text": "Randy-904"
                },
                "userId": "ur212106009"
              },
              "summary": {
                "originalText": "BEST MOVIE OF THE DECADE!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "THIS MOVIE (DHURANDHAR) IS THE BEST MOVIE OF THIS DECADE, AND THE HATERS MIGHT BE THINKING WHY??? THIS MOVIE TELLS US THE PEOPLE AND THE MOTIVES BEHIND ALL THE ATTACKS WHICH HAPPENED IN INDIA. THIS MOVIE PORTRAYS IT SO WELL THAT THIS MOVIE SHOULD ACTUALLY WIN SOME OSCARS FOR THE FOLLOWING STUFF; MUSIC, DIRECTION, ACTING, AND ACTION. I JUST CAN&#39;T WAIT FOR PART 2!!!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-01",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11082248/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11053813",
              "author": {
                "username": {
                  "text": "alwaysalearner"
                },
                "userId": "ur190830203"
              },
              "summary": {
                "originalText": "Good Movie. Great Director."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Poor actors- real life AL47 gun yielding Sanjay Datt and actor always high- Ranveer singh.<br/><br/>Great actors- Akshay Khanna, R. Madhavan and Rakesh Bedi,<br/><br/>Surprise scintillating acting- Manav and Saumya<br/><br/>Bike chase and over 12 minute fight should have been done away with. Did not go well.<br/><br/>Think carefully before release the next. Don&#39;t lose the plot."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-25",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11053813/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006848",
              "author": {
                "username": {
                  "text": "Piyush562"
                },
                "userId": "ur199121027"
              },
              "summary": {
                "originalText": "A Thrilling Tale Fueled by Emotions"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Each scene feels meticulously designed to pull the audience deeper into its world of strategy and danger. The lead performance is extraordinary, portraying moral dilemmas and courage with subtlety. Action sequences are visceral, precise, and narratively justified. Cinematography captures both the chaos of the underworld and intimate character moments beautifully. Supporting characters contribute meaningfully to the story, enriching the narrative fabric. The screenplay skillfully interweaves political tension with personal stakes. By the finale, the film delivers a climactic blend of suspense, action, and emotional depth. This is a masterful cinematic experience that lingers in memory."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006848/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008344",
              "author": {
                "username": {
                  "text": "harshitbansal-51560"
                },
                "userId": "ur155513090"
              },
              "summary": {
                "originalText": "Great depiction"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Each actor delivered a standout performance, portraying their characters with depth and authenticity. The narrative flowed beautifully, maintaining a perfect balance of emotion and pacing. Even though the film was 3.5 hours long, it remained gripping from start to finish without a single dull moment."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008344/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009607",
              "author": {
                "username": {
                  "text": "pranavkarve"
                },
                "userId": "ur150707996"
              },
              "summary": {
                "originalText": "Just watched Dhurandar, and honestly... WHAT A FILM!*"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is an absolute powerhouse of a film! From the very first scene, it grabs your attention and doesn&#39;t let go for a single moment. The performances are intense, the dialogues hit hard, and the background score elevates every emotion perfectly. The story is gripping, full of attitude, style, and moments that stay in your mind long after the movie ends. The director has delivered a bold, confident, and entertaining masterpiece. Dhurandar isn&#39;t just a movie... it&#39;s a complete cinematic experience. A must-watch! 🔥🎬"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009607/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019020",
              "author": {
                "username": {
                  "text": "kunalshera"
                },
                "userId": "ur89529118"
              },
              "summary": {
                "originalText": "Durandar: A Spy Story Without the Masala"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just finished Dhurandar and honestly, what a banger of a film.<br/><br/>First thing the music is insane. Every track hits perfectly. I was literally vibing on empty roads after the movie because the soundtrack stays with you.<br/><br/>The realism is next level. Real names, real photos, real locations, real clips-it all makes the story feel crazily authentic. And the way they show an actual spy&#39;s struggle is so raw, nothing like those over-the-top &quot;spy universe&quot; movies. This one genuinely makes you think, &quot;Damn, this is what a real spy&#39;s life looks like.&quot;<br/><br/>Aditya Dhar, you&#39;ve done something incredible. No flashy hero entries, no glam, no unnecessary mass moments. Everyone-Ranveer Singh, Akshaye Khanna, Arjun Rampal, R. Madhavan, Sanjay Dutt-just enters like normal people, and that subtlety makes the film feel so real.<br/><br/>Ranveer is raw and brilliant, and Akshaye Khanna is effortlessly charming throughout. The locations, fight scenes, and production design are all super authentic.<br/><br/>My ratings:\nMusic: 10/10\nActing: 10/10\nCasting: 100/100 (Mukesh Chhabra, what a job.)<br/><br/>The suspense holds you from start to end-even the build-up is gripping. Honestly, this film is a gem, and everyone should watch it. In a world of glam and commercial masala, Durandar feels refreshing and real.<br/><br/>Big salute to Aditya Dhar and the whole team."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019020/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008320",
              "author": {
                "username": {
                  "text": "yudhveermainijsr"
                },
                "userId": "ur104932827"
              },
              "summary": {
                "originalText": "Just Outstanding !"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Never ever had imagined that apart from Zack Snyder&#39;s Justice League which had a run time of 4 hours long would be able to experience same from Bollywood(in terms of duration of movie). Dhurandar just kept me hooked to the seat that too the late night show of Saturday, even after leaving the theatre after 4 hours almost in the morning around 4:15 Am it felt like so ascending which can&#39;t be explained in words.<br/><br/>Cinema lovers can&#39;t afford the opportunity to skip the theatre experience of this pure masterclass!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008320/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007716",
              "author": {
                "username": {
                  "text": "deeppandya-64105"
                },
                "userId": "ur88783011"
              },
              "summary": {
                "originalText": "Unmissable"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Edge of the seat thriller. Bollywood has finally come of age ! The story is part fiction about Indian agent woven with true stories of Pakistani gangs, intelligence and terrorist connections. Ranveer seems like a collective story of many undercover agents trying to protect their country. Excellent acting by Akshay and Rakesh Bedi."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007716/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002932",
              "author": {
                "username": {
                  "text": "RajT-495"
                },
                "userId": "ur207284790"
              },
              "summary": {
                "originalText": "A must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I won&#39;t give spoilers about story but only i can say that is you won&#39;t regret for a single minute on this movie, just go for it. The performances and the story which is mostly true is mind blowing.<br/><br/>This movie is specially recommended for liberals and islamist jihadi sympathisers and also for the new generation who don&#39;t know much about the attacks that used to happen before 2014..."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002932/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009739",
              "author": {
                "username": {
                  "text": "krishnamvasistha"
                },
                "userId": "ur150709956"
              },
              "summary": {
                "originalText": "Amazing movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshay Khanna&#39;s performance overshadowed everyone. Madhavan&#39;s all the 4th wall breaking scenes are impact full. The use of contemporary music titles and true references of the stories timeliness are smooth. People born in 80&#39;s and 90&#39;s will definitely find the instances relatable. Truly an amazing Hollywood movie after long time. Kudos to Aditya Dhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009739/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044737",
              "author": {
                "username": {
                  "text": "denilkatariya"
                },
                "userId": "ur66719754"
              },
              "summary": {
                "originalText": "Spy thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "As far as spy thrillers go, only a handful manage to leave a lasting impression on the big screen. Dhurandhar comes close to joining that list, largely due to its gripping premise and powerhouse performances.<br/><br/>Ranveer Singh delivers a deeply immersive performance as Hamza Ali, an Indian spy embedded as part of a long-term intelligence operation to destabilize enemy forces from within. His infiltration into the Karachi underworld brings him face to face with Rehman Dakait (Akshaye Khanna), a formidable gangster whose influence extends into the political power structure. Akshaye Khanna is excellent-calm, authoritative, and quietly intimidating-making their dynamic one of the film&#39;s biggest strengths.<br/><br/>Set against the backdrop of real-life events like the IC-814 hijacking and the Parliament attack, the film also explores the strategic mind of Ajay Sanyal (R. Madhavan), the IB chief attempting to outmaneuver systemic corruption and internal failures by planting assets deep inside enemy territory. As Hamza earns Rehman&#39;s trust, he gains access to key ISI players, steadily climbing the ladder in a dangerous game of deception.<br/><br/>Sanjay Dutt is menacing as SP Aslam Choudhary, a ruthless cop determined to wipe out the underworld. The performances across the board are strong, supported by striking cinematography and an effective background score that maintains tension.<br/><br/>Where Dhurandhar falters is its runtime and climax. The narrative becomes dense as multiple plotlines unfold simultaneously, and the ending feels underwhelming compared to the buildup. While the action is fast-paced and several scenes land well, tighter editing could have elevated the impact.<br/><br/>Overall, Dhurandhar is largely a Ranveer Singh-Akshaye Khanna show, offering an engaging glimpse into the dangerous, unseen world of intelligence operatives. Despite its flaws, it stands as a solid and ambitious spy thriller."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044737/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008884",
              "author": {
                "username": {
                  "text": "r-kharsani"
                },
                "userId": "ur49410014"
              },
              "summary": {
                "originalText": "Seriously 😣?! Over hyped rubbish."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "First of all this movie has been coming from a very good team of producer, writer &amp; director. But sadly a big disappointment of 2025 from them. Story of the movie full marks (this director is known for that- all true story) but the way story has been stretched is making it difficult to watch till the end. Main action scene of the movie related to Akshay khanna at the end has been so poorly directed &amp; written that lot of people were on a verge of leaving the cinema at the time including me. This isn&#39;t a 70s movie in which villain always shot few police but dozen of police can&#39;t hit single! WTF? Overall it is an over hyped...i would recommend people to watch on Netflix rather than cinema."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 4,
                "downVotes": 28
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008884/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006774",
              "author": {
                "username": {
                  "text": "imdbfan-0591827581"
                },
                "userId": "ur199124456"
              },
              "summary": {
                "originalText": "Cinematic Brilliance Wrapped in Action and Emotion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening frame, the movie commands attention with a taut, intricate narrative. Ranveer Singh delivers a standout performance, showcasing both emotional depth and physical prowess in high-stakes action. Director Dhar weaves together suspense, political intrigue, and intense personal drama, ensuring each element supports the overarching story. Action sequences are thrilling yet grounded, balancing spectacle with narrative logic. The supporting cast adds meaningful contributions, giving the underworld and political landscape texture and credibility. Cinematography enhances mood, capturing tension, danger, and fleeting moments of vulnerability with finesse. The soundtrack subtly amplifies suspense, while editing maintains a relentless yet coherent pace. The climax ties together emotional arcs and narrative threads in a way that is both shocking and satisfying, leaving the viewer impressed and emotionally invested."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006774/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007896",
              "author": {
                "username": {
                  "text": "itachiuchihasays"
                },
                "userId": "ur187811192"
              },
              "summary": {
                "originalText": "Pathbreaking"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The Rubicon has been crossed and the era of hard-hitting, realist movies with zero leftist propaganda is here.<br/><br/>Aditya Dhar has really cooked with this one.<br/><br/>Dhurandhar is a gripping and intense spy thriller that keeps you hooked from start to finish. The story feels inspired by real-world events, and the screenplay is engaging enough that the runtime never feels boring. The performances are powerful across the board, with Ranveer Singh, Akshaye Khanna, Sanjay Dutt and Arjun Rampal delivering standout work in both the undercover and gang-war sequences.<br/><br/>On the technical front, the film is top-notch, with gritty cinematography, grounded and realistic action, and a background score that builds tension and truly elevates the big-screen experience. The balance of violence, emotion and patriotism feels organic, making the world of the film believable and immersive rather than over-the-top."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007896/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007312",
              "author": {
                "username": {
                  "text": "choudhuryr-98068"
                },
                "userId": "ur125981984"
              },
              "summary": {
                "originalText": "Tribute to the multiple Unknown Men"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Might be the one of the best Hindi movies of this century. Be it the direction, the story telling, the cinematography, the acting, the sound design, literally everything is perfect. Aditya Dhar is one hell of a director for sure. The cast hit the ball out of the park. Ranveer Singh deserves all the limelight but the co-actors, omg.. Akshay Khanna has an aura of his throughout the entire movie.<br/><br/>A must watch in the theatres."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007312/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006956",
              "author": {
                "username": {
                  "text": "Zain86670"
                },
                "userId": "ur199122505"
              },
              "summary": {
                "originalText": "A Bold Tale Where Action Never Sleeps"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film is an intricate blend of suspense, action, and emotional storytelling. Ranveer Singh anchors the narrative with a performance rich in nuance and intensity. Sanjay Dutt exudes gravitas, while Akshaye Khanna and R Madhavan add intelligent, understated support. Arjun Rampal&#39;s quiet menace enhances tension, and Sara Arjun&#39;s vulnerability provides emotional resonance. Aditya Dhar&#39;s direction balances cerebral plotting with explosive action, creating an immersive experience. Cinematography and sound design amplify both chaos and intimacy. By the finale, the story delivers both adrenaline-charged sequences and heartfelt emotional payoff, leaving a lasting impact."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006956/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}