{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6ddrktazcwzy476xhrmrvrhrmqaj22mkdt4hladdp6tttfjrkydc3oeyv5mblb4dza6af4mx5jbwvkngcj5yejqqsi",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11006619",
              "author": {
                "username": {
                  "text": "swarasharma-46225"
                },
                "userId": "ur188401617"
              },
              "summary": {
                "originalText": "A Story Driven by Stars and Explosive Moments"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tension mounts with each scene, combining slow-burn suspense with sudden bursts of high-intensity action. The lead delivers a performance of depth and precision, making every choice and moral dilemma resonate. Action is raw and gripping, seamlessly integrated into the story rather than serving as spectacle. The cinematography balances chaos and stillness, emphasizing both personal and societal stakes. Supporting cast performances are equally engaging, adding layers to the narrative. The pacing is deliberate, allowing suspense and intrigue to develop organically. The climax is an intense, emotionally resonant payoff that validates the film&#39;s careful construction. This is intelligent, immersive, and unforgettable cinema."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006619/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007055",
              "author": {
                "username": {
                  "text": "TarunM-99"
                },
                "userId": "ur203913678"
              },
              "summary": {
                "originalText": "Drama That Feels Real and Action That Feels Epic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The cinematic world is detailed, immersive, and tense from the very first scene. Ranveer Singh excels in a role requiring intelligence, restraint, and boldness, while Sanjay Dutt brings gravitas and menace. Akshaye Khanna and R Madhavan provide subtle, layered support, and Arjun Rampal&#39;s quiet menace enhances suspense. Sara Arjun brings humanity and emotion, highlighting the personal stakes. Aditya Dhar&#39;s direction balances narrative depth with thrilling action, and the cinematography captures both the scale and intimacy of the story. The musical score accentuates every emotional and dramatic beat. By the final act, the narrative reaches a crescendo that is thrilling, emotional, and unforgettable."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007055/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006801",
              "author": {
                "username": {
                  "text": "raghavrane"
                },
                "userId": "ur196193759"
              },
              "summary": {
                "originalText": "Thrills Unleashed with a Stellar Ensemble"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story unfolds with a calculated patience, inviting audiences into a world where danger and loyalty collide. Ranveer Singh&#39;s portrayal is a masterclass in subtle intensity, while Sanjay Dutt exudes the calm menace of a seasoned underworld figure. Akshaye Khanna and R Madhavan are impeccable in supporting roles, each scene enriched by their presence, and Arjun Rampal&#39;s understated menace leaves a lasting impression. Sara Arjun&#39;s scenes are quietly devastating, reminding viewers of what is at stake. Director Aditya Dhar orchestrates the narrative with precision, seamlessly blending strategic storytelling with explosive action. The action sequences are meticulously choreographed, each punch, chase, and confrontation serving the story rather than mere spectacle. Editing maintains a gripping pace, and the score heightens suspense at exactly the right moments. By the climax, the film has woven an emotionally charged web of suspense, loyalty, and betrayal, proving that thoughtful storytelling can coexist with blockbuster thrills."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006801/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015880",
              "author": {
                "username": {
                  "text": "krishnaksp-46946"
                },
                "userId": "ur184054446"
              },
              "summary": {
                "originalText": "Amazing movie. it shows reality"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "10/10 amazing it shows the reality of Pakistan how they sprade terrorism in the world production is amazing acting was amazing and also they have shown the truth very well truly worth to watch it shows the quality of Pakistani and how much they did India and all their hatred towards Indians. Everybody sweet watch the movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015880/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11062007",
              "author": {
                "username": {
                  "text": "guptachetna-10739"
                },
                "userId": "ur160961496"
              },
              "summary": {
                "originalText": "Overhyped"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A completely overhyped movie. I sat through the whole movie just to witness the hype this movie has. But to my disappointment it didn&#39;t live upto that standard. No doubt songs were good but was there the need of adding songs in a movie featuring spies. Ranveer Singh&#39;s performance was good as always but what remained in mind was acting of all of them in that particular scene of 26/11 ...."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 25
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11062007/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11030681",
              "author": {
                "username": {
                  "text": "maityarpita-51772"
                },
                "userId": "ur136415679"
              },
              "summary": {
                "originalText": "Goated truth"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a roaring triumph that blends raw emotion, gripping drama, and unforgettable performances. Its powerful storytelling, striking visuals, and thunderous music keep you hooked, celebrating courage, grit, and destiny. A film that lingers long after the final frame. It defines cinematic pride."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11030681/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026452",
              "author": {
                "username": {
                  "text": "hinguaakash"
                },
                "userId": "ur193477756"
              },
              "summary": {
                "originalText": "Finally some realism in bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a surprisingly solid film. No overdramatic dialogues, no unnecessary hero monologues just straight, grouned storytelling. Action finally feels realistic, with raw combat and gore that don&#39;t look artificial or forced. What really works is how real events are woven into the fiction, the transitions are smooth and non distracting. Despite being almost three hours+ long, the movie never drags- it actually feels short. Most importantly, it accurately depicts real instances without diluting their seriousness. Definitely one of the more honest films in this space in recent times."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026452/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015663",
              "author": {
                "username": {
                  "text": "AshokM-128"
                },
                "userId": "ur211604477"
              },
              "summary": {
                "originalText": "That's how you make a realistic spy thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya dhar has shown how great he is as a director , casting on point , realism on point , writing on point , directing on point , acting on point. Throughout the movie ranveer has very less dailogues and that&#39;s how a spy should be , every word from his mouth has value one wrong word amd he will be gone , ranveer potrays all his emotions through his expression and eyes , definately a must watch movie 🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015663/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012035",
              "author": {
                "username": {
                  "text": "AmanN-279"
                },
                "userId": "ur211579974"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every single minute of the film was worth watching. The story flows with purpose, well supported by thoughtful planning, strong writing, and precise direction. Dhurandhar keeps you engaged throughout and showcases how powerful a well-crafted movie can truly be.<br/><br/>Everyone should go and do watch this film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012035/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009391",
              "author": {
                "username": {
                  "text": "priyankarchanda"
                },
                "userId": "ur150251874"
              },
              "summary": {
                "originalText": "Bollywood's first real spy thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Three hours and 32 minutes passed without a single boring scene. It was the first time I felt like I was watching a real Bollywood spy film. The casting and directing were excellent, as was the acting and the story, which was a raw depiction of reality. It was totally worth the time &amp; money. Blockbuster of the year!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009391/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006673",
              "author": {
                "username": {
                  "text": "Byomokeshbaxi"
                },
                "userId": "ur211546948"
              },
              "summary": {
                "originalText": "Stars Deliver Thrills in Full Force"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling unfolds with a meticulous attention to detail, drawing the audience into a tense and immersive world. Ranveer Singh delivers a nuanced, magnetic performance, embodying both strength and vulnerability in his character. The supporting actors provide layered portrayals that elevate the story, each interaction charged with significance. Director Dhar excels in blending high-stakes action with intricate character development, creating sequences that are both thrilling and meaningful. Cinematography captures the stark realities and quiet moments with equal finesse, while the editing ensures a seamless flow that maintains suspense throughout. The action scenes are intense but never gratuitous, carefully choreographed to enhance narrative impact. A haunting and effective musical score reinforces mood and tension. By the final act, the audience is fully absorbed, experiencing a cinematic journey that combines adrenaline, emotion, and intelligent storytelling."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006673/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013285",
              "author": {
                "username": {
                  "text": "Aditya-5754"
                },
                "userId": "ur211588345"
              },
              "summary": {
                "originalText": "Highly recommended"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s a great movie . Highly recommended. The music , cinematography , actors , direction . Everything was perfect. And the description were also very well made. I loved that they didn&#39;t compromise on quality because of duration.<br/><br/>The running time is 3hr22min but you&#39;ll never once get bored . The pace is also perfect and it keeps you engaged throughout. The timeline of the events , their description. Everything was well matched . I just loved the movie . And all the actors were really mind-blowing."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013285/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015865",
              "author": {
                "username": {
                  "text": "keshavbansll"
                },
                "userId": "ur201772000"
              },
              "summary": {
                "originalText": "A Different Kind of Chess Game."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Exceptional filmmaking with precise direction and quality performances by all the actors.<br/><br/>Instead of a typical &quot;Hero vs Villain&quot; template, it rolls out like a twisted chess game. We have two players, India and Pakistan, playing against each other. But there are multiple assets and players from each team. Some are playing along, some are having their own game. No team among both is perfect among themselves as well. Remember &quot;Siyaasat mein koi sagaa nahi hota&quot;.<br/><br/>This is nearly perfect for its genre. An espionage thriller film that does not lean heavily on action to create massy moments.<br/><br/>The Main Protagonist is overshadowed by an antagonist in 80% of the film!! This is a good thing when you have to show your hero as an undercover agent.<br/><br/>The action was not disgusting. It was real. It was brutal where it had to be. It was raw where it had to be. Politics plays a major role, but it never feels boring.<br/><br/>AND THE MOST IMPORTANT THING - It does not feel repetitive. Bollywood has produced numerous content on the Ind vs Pak formula, but this is not the same. It shows internal gang wars, connections, struggles, a story told from a different perspective, from a grounded perspective of a person on the other side of the border."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015865/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028777",
              "author": {
                "username": {
                  "text": "Deepaky-485"
                },
                "userId": "ur211706686"
              },
              "summary": {
                "originalText": "Best' spy movie recommended to watch this masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best spy movie i ever seen i recommend to watch this movie.thats really best movies all character acting was so outstanding exept Akshay Khana.story was so excellent mixed fictional and real life incident show in this movie. And song bgm are so good perfect syncing with the scene perfect entry best brutal scene."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 8
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028777/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003672",
              "author": {
                "username": {
                  "text": "giriarpit-79670"
                },
                "userId": "ur196085807"
              },
              "summary": {
                "originalText": "Walked in Blind, Walked Out Speechless"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I went into Dhurandhar with absolutely no expectations, but I walked out completely blown away. Being from Nepal, I had previously studied the history of the terrorist attacks in India, but reading about it is one thing, seeing it visually represented is another.<br/><br/>When the film utilized real footage mixed with the cinematic scenes, it was absolutely heartbreaking and thrilling at the same time. It brought a level of reality that just shocked me.<br/><br/>Performance-wise, everyone talks about Ranveer Singh, but for me, Akshaye Khanna is the soul of this film. He completely outplays everyone, including Ranveer. You can tell it was designed that way, his presence grounds the movie in a way that is hard to describe until you see it.<br/><br/>Don&#39;t let the runtime scare you. Every minute is worth it; the movie needs that time to let the story grow and unfold properly. Huge praise to director Aditya Dhar. The man is genuinely changing the landscape of cinema. Highly recommended!"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003672/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015877",
              "author": {
                "username": {
                  "text": "Mrinal-32"
                },
                "userId": "ur211605157"
              },
              "summary": {
                "originalText": "A must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Everything about the movie was amazing, acting was top notch, special mention akshay khanna his performance was phenomenal. Action scenes were amazing. Story also shows the reality of India Pakistan relation. Direction of the movie was good ..at 2 or 3 places, the direction cloud be better,i would put this movie in a must watch category. Movie is a package of action,drama,suspense, betrayal,and much more."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015877/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012277",
              "author": {
                "username": {
                  "text": "aixsatish"
                },
                "userId": "ur83414829"
              },
              "summary": {
                "originalText": "One of the well executed movies with nice music"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Awesome direction, music, Background score and acting<br/><br/>Didn&#39;t get bored not even a single minute\nDuration of the movement: 3 hrs 30 min<br/><br/>Choice of music\nCast superb.<br/><br/>I would watch it atleast another time. I wish they release it in IMAX or dolby or biggest possible screens.<br/><br/>It can be best experienced only on big theater screen with nice sound system.<br/><br/>Akshay khanna\nRanveer\nAnd sevaral actors<br/><br/>Wow simply wow."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012277/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010797",
              "author": {
                "username": {
                  "text": "Ajay-145"
                },
                "userId": "ur205591119"
              },
              "summary": {
                "originalText": "Intense, long but effective"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is undoubtedly long, but for anyone who enjoys spy thrillers, the length never feels like a burden. The story grips you from the start and rarely loosens its hold.<br/><br/>Ranveer Singh delivers an intense performance and looks convincing in Pathani suits as a Baloch character, thanks to his muscular build and height.<br/><br/>A pleasant surprise in the film is Rakesh Bedi. Known mostly for comic sidekick roles, he shines here as a cunning politician. Full credit to the casting director for this unexpected yet effective choice.<br/><br/>Sanjay Dutt plays a character that suits his persona perfectly.<br/><br/>But the highlight of the movie is undoubtedly Akshay Khanna. We always knew he was a brilliant actor, but here his brilliance dominates the screen. After Chhava, this film becomes another milestone where he fully lives the character.<br/><br/>Arjun Rampal&#39;s character seems underdeveloped for now-almost as if he walked straight from the sets of Rana Naidu Season 2. Not very impressive, but his arc will likely build in the next chapter.<br/><br/>R. Madhavan is impactful in a short role and bears a striking resemblance to Ajit Doval-credit to the makeup team.<br/><br/>Sara Arjun looks beautiful and shows immense promise; she definitely has a bright career ahead.<br/><br/>The script is tight and engaging, but one noticeable drawback is the accent work. The accents do not resemble Karachi&#39;s Baloch or local dialects; they should have invested more effort here.<br/><br/>Overall, it&#39;s a beautifully made movie with great performances, and the sequel will surely be even more intense.<br/><br/>However, I personally did not like the part involving an Indian handler supplying ammunition to terrorists, especially those responsible for massacres in India.<br/><br/>A message to the screenplay writer: Sir, we don&#39;t need this type of twist - real or fictional. Let the villains be villains without giving them unnecessary Indian li."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010797/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008553",
              "author": {
                "username": {
                  "text": "pradeep44"
                },
                "userId": "ur19824799"
              },
              "summary": {
                "originalText": "Holding the mirror to Pak lovers in B'wood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie was really good and different from normal Bollywood films. I liked that the makers didn&#39;t do the usual thing of trying to please Pakistan or hide their crimes. They showed the facts clearly and didn&#39;t add unnecessary drama.<br/><br/>The story was straight and strong. Madhavan and Akshaye Khanna both gave very real and powerful performances. Because of them, the movie feels real and meaningful.<br/><br/>Overall, it&#39;s a must watch for people who like honest and bold films."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008553/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005022",
              "author": {
                "username": {
                  "text": "SaikatChoudhury2602"
                },
                "userId": "ur118123523"
              },
              "summary": {
                "originalText": "Dhurandhar: A Masterstroke in Spy Action Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar establishes itself as a one-of-a-kind spy action thriller, staying true to its vision and delivering on every promise. The dialogues are sharp and thoughtfully crafted, while the screenplay-arguably the film&#39;s strongest pillar-fires on all cylinders. The narrative remains uniquely and beautifully structured, and the background score goes absolutely wild, elevating every moment. Each of these elements is tightly executed and contributes immensely to the film&#39;s overall impact.<br/><br/>Akshaye Khanna delivers a career-defining performance, commanding such a powerful aura that he effortlessly overshadows every other character. His screen presence is nothing short of exceptional.<br/><br/>R. Madhavan&#39;s intensity is unmatched-lethal, gripping, and compelling enough to make you crave more of him on screen.<br/><br/>Arjun Rampal appears with thunderous dialogue delivery and sheer brutality, instantly dominating every frame he enters.<br/><br/>Sanjay Dutt, even amidst such an extraordinary ensemble, manages to leave a strong mark with his commanding delivery.<br/><br/>Aditya Dhar pulls it all together masterfully, not faltering even for a moment.<br/><br/>If Part 1 was explosive, Part 2 is poised to blow the roof off the house."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005022/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016030",
              "author": {
                "username": {
                  "text": "lohiashubham"
                },
                "userId": "ur147985701"
              },
              "summary": {
                "originalText": "me and wife yesterday watched this movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;We loved this movie! We didn&#39;t even realize when the 3 hours went by. The story and the cinematic experience felt so real, and the BGM and songs were amazing. The eight-chapter format was very informative as well.<br/><br/>I hope Bollywood and other industries make more movies like this in the future. My wife is still talking about it-we love the cinematography, and overall I&#39;d giv."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016030/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007593",
              "author": {
                "username": {
                  "text": "sanjayysingh-70677"
                },
                "userId": "ur154427151"
              },
              "summary": {
                "originalText": "Stars, Drama, and Non-Stop Excitement"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From start to finish, the movie constructs a world that feels dangerously close to reality. The lead actor&#39;s performance is nuanced, effortlessly transitioning from quiet introspection to explosive action. The director&#39;s attention to detail is evident in the set design, lighting, and camera work, which all work together to create a tense, immersive atmosphere. The action scenes are thrilling but never gratuitous, while the emotional beats are resonant and well-earned. The second half delivers a crescendo of suspense and revelation, leaving the audience both shocked and satisfied by its intricate plotting and careful execution."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007593/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019569",
              "author": {
                "username": {
                  "text": "rockpints"
                },
                "userId": "ur109402202"
              },
              "summary": {
                "originalText": "A Bold, Uncompromising Masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I just watched Dhurendar, and I have to say - it takes real courage to make a film like this. The director deserves full credit for showing the truth without sugar-coating or hiding anything, whether it&#39;s from the India side or the Pakistan side. It&#39;s rare to see a movie that presents facts with such honesty and guts.<br/><br/>The performances are outstanding. Every actor fits perfectly into their role, delivering powerful, emotional, and believable scenes. The background music elevates every moment and gives the film that larger-than-life feel.<br/><br/>What truly makes Dhurendar special is the patriotic energy running through the entire movie. It reminds you of the sacrifices our soldiers make every single day, and the strength of a nation that stands tall no matter what. The film fills you with pride and respect for those who defend the country with their lives.<br/><br/>A gripping story, brilliant execution, and a fearless message - this is cinema with a backbone.<br/><br/>Highly recommended. 🇮🇳🔥"
                }
              },
              "authorRating": 2,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 26
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019569/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018498",
              "author": {
                "username": {
                  "text": "mayankpachauri-03827"
                },
                "userId": "ur150681791"
              },
              "summary": {
                "originalText": "Dhurandhar is Masterpiece."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a true masterpiece that stands out for its powerful performances and compelling storytelling. The film grips you from the very first scene and keeps you deeply engaged till the end. Every moment feels purposeful, supported by an ultimate screenplay and brilliant direction that make it a must-watch cinematic experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018498/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010361",
              "author": {
                "username": {
                  "text": "rishitsharma"
                },
                "userId": "ur67641620"
              },
              "summary": {
                "originalText": "Great spy movie unexpected from bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I was expecting another slop from bollywood but this isnt it. Its really thought out film, even though on paper the length looks long, its really engaging and gripping. The story is very organised , which i felt was lacking in movies like salaar. But its not a passive film, in the first half i had to remember names of the characters to really enjoy the movie dynamics."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010361/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}