{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6fbbitazcwzy472ux7nbqrxrmuaby3qktv6pmatc6mqbdf4skydk3pazf3nryodm72iyisnf3cyy75cu6pmo7ve3a",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11007259",
              "author": {
                "username": {
                  "text": "gargkuhi"
                },
                "userId": "ur123184097"
              },
              "summary": {
                "originalText": "Star-Studded Entertainment for Everyone"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s narrative unfolds with deliberate precision, drawing viewers into a world teeming with danger and ethical ambiguity. Ranveer Singh&#39;s performance is both commanding and introspective, reflecting the inner conflict of a man caught between loyalty and personal morality. Sanjay Dutt dominates the screen with gravitas and subtle menace, creating an air of unpredictability. Akshaye Khanna and R Madhavan deliver intelligent, restrained performances, adding depth to the story&#39;s secondary arcs. Arjun Rampal&#39;s quiet menace permeates scenes with tension, while Sara Arjun brings a haunting innocence that highlights the stakes. Aditya Dhar&#39;s direction orchestrates suspense, dialogue, and high-octane action seamlessly. Cinematography balances expansive cityscapes and intimate interiors, while the score amplifies tension and emotional resonance. The second half escalates with strategic confrontations, shocking twists, and a satisfying, emotionally charged climax."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007259/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11088387",
              "author": {
                "username": {
                  "text": "cyberbobsoumya"
                },
                "userId": "ur90916230"
              },
              "summary": {
                "originalText": "Amazing script done with great execution"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film brings out the real stories and sacrifices made by nationalistic Indian people against Paki Zombies and their demonic intentions to harm India and beg around the world at the same time.<br/><br/>The Book is the real Evil which influences its cult followers to harm the non believers. They will do bomb blast decapitate people make their cousins pregnant. They domt want peace neither Kufrs are offering peace. They will be taught lesson in the same language they understand. Wild dogs cant be domesticated only hunted and roasted."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-02",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11088387/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11046950",
              "author": {
                "username": {
                  "text": "SayandipD-5"
                },
                "userId": "ur200959205"
              },
              "summary": {
                "originalText": "One of the greatest films of all time"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "All aspects of the film including the music, bgm, acting, cinematography, directing was really great and the footage of the real events were truly spine chilling, mainly the 26/11 call records. Dhurandhar is a powerful cinematic experience that leaves a lasting impression through its intensity, craft, and emotional depth. The film stands out for its gripping narrative, which balances raw realism with strong dramatic moments. From the very beginning, Dhurandhar pulls the audience into its world and refuses to let go, maintaining a tight pace while allowing key scenes to breathe and resonate.<br/><br/>The performances are one of the film&#39;s greatest strengths. The lead actor delivers a commanding portrayal, capturing both the vulnerability and ferocity of the character with remarkable authenticity. Supporting performances add further depth, making the relationships feel grounded and believable. Each character feels purposeful, contributing meaningfully to the overall story.<br/><br/>Visually, Dhurandhar is striking. The cinematography enhances the mood with well-composed frames, effective lighting, and a color palette that reflects the film&#39;s darker themes. The background score complements the narrative perfectly, heightening tension without overpowering the scenes.<br/><br/>What truly elevates Dhurandhar is its thematic weight. The film explores power, resilience, and the consequences of one&#39;s choices in a way that feels both relevant and thought-provoking. It does not rely on spectacle alone but uses substance to leave an impact. Overall, Dhurandhar is a bold, well-executed film that deserves appreciation for its storytelling, performances, and technical excellence."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11046950/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024160",
              "author": {
                "username": {
                  "text": "iswaryabethapudi"
                },
                "userId": "ur102824548"
              },
              "summary": {
                "originalText": "super movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Brilliant action direction must watch ranveer singh best performance based on true events it&#39;s not a propaganda movie most of the movie based on true event loved akshay arjun sara performance and all are versatile don&#39;t listen negative reviews waiting for part 2 one of the best movie of the year. Good movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024160/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006725",
              "author": {
                "username": {
                  "text": "prahi45"
                },
                "userId": "ur199256539"
              },
              "summary": {
                "originalText": "High-Voltage Drama with Non-Stop Thrills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film creates a world of high tension and complex moral landscapes, pulling audiences into every twist. The lead performance stands out for its emotional depth and subtle intensity. Action sequences are thrilling, realistic, and integral to the story. Cinematography balances visual grandeur with intimate character moments. Secondary characters enhance narrative complexity, making the world feel lived-in. Pacing is deliberate, building suspense and anticipation organically. The second half delivers explosive action and emotional payoff, weaving together personal stakes and broader political intrigue. This is bold, intelligent, and gripping cinema."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006725/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006875",
              "author": {
                "username": {
                  "text": "obzgrqmd"
                },
                "userId": "ur177078520"
              },
              "summary": {
                "originalText": "Breathless Battles and Soulful Scenes"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every element of the film is crafted with precision, from the tense screenplay to the high-octane action sequences. Ranveer Singh&#39;s portrayal is deeply compelling, bringing authenticity and depth to his morally complex character. The supporting actors enhance the narrative with memorable, well-defined roles. Director Dhar&#39;s direction ensures that even the most complex sequences are coherent and impactful, balancing action, emotion, and political intrigue. The cinematography is both elegant and raw, capturing the nuances of character and environment with equal skill. Editing maintains a consistent pace, allowing suspense and tension to escalate naturally. The sound design, coupled with a gripping score, enhances the film&#39;s intensity. By the end, the story leaves a profound impression, highlighting human resilience amid chaos."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006875/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036519",
              "author": {
                "username": {
                  "text": "abhijitdodiya"
                },
                "userId": "ur147327548"
              },
              "summary": {
                "originalText": "Most Cinematic and Apex Spy Thriller of India"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Finally a Great Cinematic Spy Thriller of India.<br/><br/>I just cannot describe how compelling this movie is. The story, the great starcast, their acting, the music, everything from top to bottom is just amazing in this movie. Aditya Dhar really raised the bar for himself and even the whole Bollywood for that matter. Because this is really a unique movie of its own Indian Cinema has never seen. Whole movie is great, resilient, violent and intriguing. I just loved it. I really wasn&#39;t expecting this much from this movie, I barely touched the trailer or teaser. But the movie really changed my mind. From start to finish, it&#39;s perfect. The way they have handled the characters, connected the dots. Showing some incidents, that too with real footage and gore is really a bold step that I really appreciate. I am glad that Aditya Dhar took that risk and delivered an S-class Spy Thriller Masterpiece of Indian Cinema. This story couldn&#39;t have been represented better. The direction, the storytelling, the acting, there are many scenes where it makes you feel for your nation, and the people who have suffered for the nation. Whether it&#39;s from the lead role, or the antagonistic role, the acting and the representation feels so grounded, real, impressive and entertaining in every way. This is what Indian Cinema should be. This can be the revolutionary step in Indian Cinema. After a big gap I have felt that finally a good Hindi movie that will stay in some best movies of such category - corner of my mind. The title track is still roaming in my mind and some scenes are still playing in my head again and again. S-tier Cinematic Experience. Really top of the class. Must be experienced in cinemas.<br/><br/>Jai Hind."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036519/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018902",
              "author": {
                "username": {
                  "text": "S0-12"
                },
                "userId": "ur211631733"
              },
              "summary": {
                "originalText": "i luv it"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s a movie I would totally recommend to everyone Although it is gory it still does capture the raw and precise elements of what it was to feel the terror of those attacks I love how each character is written, they&#39;re so well rounded and have good depth to them Aditya Dhar is such a genius for this, it&#39;s been a while since such a good film has come out Everyone did a fabulous job in their acting especially Akshay Khanna."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018902/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025891",
              "author": {
                "username": {
                  "text": "singhaaryush"
                },
                "userId": "ur193867281"
              },
              "summary": {
                "originalText": "Dhurandhar: Peak cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the finest and most gripping film produced in india for sure. A must watch for every indian. None of the actors felt low not even the side actors .for the genz its the most aura farming films ever. Inspired by incredible truue events ,The movie is obviously anti pakistanti but its truue that pakistani government is directly envolved in the terrosits attacks around the world."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025891/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019018",
              "author": {
                "username": {
                  "text": "LokyFreedom"
                },
                "userId": "ur136069291"
              },
              "summary": {
                "originalText": "Reminds me of Quinton Tarantino style of Filmmaking"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What a terrific film, inspite of the duration being so long not for a moment you feel bored. Every character stands out and is a delight to watch. Akshaye Khanna&#39;s performance deserves a special mention. Ranveer singh is such stoic and focused on his mission in the movie is inspiring. The scale of the movie is breathtaking And some classic old songs used in the BG was so cool. Totally worth watching for everyone."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019018/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025606",
              "author": {
                "username": {
                  "text": "ListMist02"
                },
                "userId": "ur211683913"
              },
              "summary": {
                "originalText": "Absolute Cinema."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Never had I ever thought I would be captivated by a film for straight 212 mins without getting bored for a single second. The sheer amount of aura everyone possessed during the film was mind blowing. Proper direction through and through. When you have these Personas you are bound to deliver beyond everyone&#39;s imagination. And it&#39;s just Part 1!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025606/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021481",
              "author": {
                "username": {
                  "text": "princeva"
                },
                "userId": "ur114191879"
              },
              "summary": {
                "originalText": "Must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I felt So bad after first chapter. Felt like so helpless even being a vibrant country with greatest culture.<br/><br/>Gradually felt like things r getting better.<br/><br/>Looking at the amount of hard work and research was done to put this together is just amazing. Story is going in chapters describing each incident in detail. I thought that there r too many characters to remember but now I can name each of them.<br/><br/>All the actors have done justice to its role.<br/><br/>This is MUST watch and do not miss.<br/><br/>Waiting for part 2......."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021481/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023223",
              "author": {
                "username": {
                  "text": "akthesedays"
                },
                "userId": "ur118653105"
              },
              "summary": {
                "originalText": "Authentic and full on entertaining"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Brilliantly made movie by Aditya Dhar after Uri. No heroism, no over the top dialogues or acting. An authentic yet stylish espionage spy movie based on real events.<br/><br/>The film is so true to the ground reality that even Pakistanis are praising it for getting their accent and culture correctly.<br/><br/>There is no single hero in this movie except the BGM. I am blown away by the music that Shaswat Sachdev has given.<br/><br/>Don&#39;t miss it, experience it on big screen."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023223/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006604",
              "author": {
                "username": {
                  "text": "LovelyS-520"
                },
                "userId": "ur210345917"
              },
              "summary": {
                "originalText": "Star-Studded Entertainment That Delivers"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film meticulously constructs a layered underworld where danger, loyalty, and strategy intersect. Ranveer Singh delivers a powerhouse performance, alternating between reflective vulnerability and high-intensity action, while Sanjay Dutt exudes authority and menace. Akshaye Khanna and R Madhavan provide intelligence and weight to the ensemble, Arjun Rampal&#39;s quiet menace keeps viewers alert, and Sara Arjun&#39;s innocence amplifies stakes. Aditya Dhar directs with a keen sense of pacing, balancing character-driven drama with explosive action sequences. Cinematography captures Karachi&#39;s streets, interiors, and tense interactions with equal skill, and the score punctuates suspense. The finale delivers both emotional and adrenaline-fueled payoff."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006604/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11040720",
              "author": {
                "username": {
                  "text": "rudranshjasathy-82496"
                },
                "userId": "ur110004650"
              },
              "summary": {
                "originalText": "A must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an outstanding film that showcases the power of strong storytelling, intelligent writing, and compelling performances. From start to finish, it maintains a gripping atmosphere that keeps you fully invested without relying on unnecessary spectacle. The performances are excellent across the board, with the lead delivering a nuanced and powerful portrayal that feels completely authentic. The supporting cast adds depth and balance, making every character feel meaningful. Direction is confident and precise, allowing the story to unfold naturally while maintaining steady tension throughout. Visually, the film is polished and immersive, complemented by a background score that enhances the mood without overpowering the narrative. What truly elevates Dhurandhar is its respect for the audience, trusting viewers to engage with its themes and characters. A thoroughly satisfying cinematic experience and easily a 10/10 film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11040720/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022427",
              "author": {
                "username": {
                  "text": "Sachin-107"
                },
                "userId": "ur211658747"
              },
              "summary": {
                "originalText": "Movie do justice to its name \"Dhurandhar....\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Director did his analysis around the geography of Lyari, and also did well with cinematography and the presentation is awesome. It&#39;s so tough to explain everything.....And at last Akshay Khanna rocked with his performance....\nSanjay, arjun, ranveer singh they also did so well. But don&#39;t forget to give credit to Director.<br/><br/>Just watch the movie and enjoy the show."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022427/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044024",
              "author": {
                "username": {
                  "text": "manishnair-44565"
                },
                "userId": "ur65908204"
              },
              "summary": {
                "originalText": "Dhurandar: Hype Aside, This Is Ranveer Singh's Film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watched Dhurandar in theatres today, and it was a magnificent theatrical experience overall. The plot, characters, and storyline are well conceived, with meaningful connections to real-time scenarios that make everything fall into place seamlessly.<br/><br/>That said, I find it slightly difficult to understand the excessive hype around Akshaye Khanna&#39;s performance when it is Ranveer Singh who delivers a smashing act from the very first frame to the last. Interestingly, much like the social-media narrative around the film, Ranveer often remains in the side frame for a large part of the movie, an approach that is understandable and justified given the plot and the presence of larger-than-life characters.<br/><br/>Akshaye Khanna is undoubtedly terrific, and the appreciation he&#39;s receiving may be long overdue. His character portrayal is strong and impactful, second only to Ranveer&#39;s. But it is Ranveer who truly nails it.<br/><br/>All in all, Dhurandar is a deeply satisfying Bollywood cinematic experience after a long time."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044024/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006521",
              "author": {
                "username": {
                  "text": "imdbfan-5758893976"
                },
                "userId": "ur199122778"
              },
              "summary": {
                "originalText": "The Experience You'll Remember Forever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tension builds steadily throughout the film, refusing to release the audience until the climactic finale. Ranveer Singh&#39;s lead performance is a remarkable balance of subtlety and intensity, making his journey both compelling and relatable. Dhar&#39;s direction combines narrative sophistication with action-packed sequences that never feel gratuitous. Supporting characters are rich in detail, making even secondary arcs impactful. The visual storytelling and music elevate the film&#39;s emotional resonance, making it an unforgettable cinematic experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006521/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009940",
              "author": {
                "username": {
                  "text": "Hemant-34"
                },
                "userId": "ur211564062"
              },
              "summary": {
                "originalText": "Best Spy movie of the decade"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "ChatGPT<br/><br/>Log in<br/><br/>You said:\nWrite positive review for movie dhurandhar with words like patriotic, engaging, pak sponsered terrorism\nChatGPT said:\nHere&#39;s a safe and polished positive review you can use. I&#39;ve framed the sensitive phrase clearly as part of the film&#39;s fictional narrative, not a claim about real-world events:<br/><br/>Review: Dhurandhar<br/><br/>Dhurandhar is a gripping and patriotic drama that keeps you engaged from start to finish. The film skillfully portrays the challenges faced by its protagonists as they confront Pak-sponsored terrorism within the movie&#39;s fictional storyline, weaving action and emotion into a powerful narrative.<br/><br/>What truly stands out is how the film balances intense sequences with heartfelt moments that highlight courage, sacrifice, and national pride. The direction is sharp, the performances are compelling, and the pacing ensures there&#39;s never a dull moment.<br/><br/>Overall, Dhurandhar is an inspiring and engaging watch-perfect for audiences who enjoy patriotic thrillers with meaningful storytelling."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009940/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018482",
              "author": {
                "username": {
                  "text": "Ujjwals-891"
                },
                "userId": "ur211628608"
              },
              "summary": {
                "originalText": "A Grounded and Gripping Spy Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands out because it stays rooted in logic and realism. You won&#39;t find over-the-top sequences with people flying from a single punch or the choppy action seen in pathan and jawan type movies. Instead, the action is clean, sharp, and believable.<br/><br/>Every actor delivers a strong performance, and what&#39;s truly impressive is how no one overshadows the other-each character gets room to shine. Credit goes to Aditya Dhar, whose direction brings everything together with precision. The Lyari Town set deserves special praise; it feels so authentic that it&#39;s hard to believe it&#39;s a constructed set.<br/><br/>Overall, Dhurandhar is a tightly executed spy-action espionage film that keeps you engaged throughout. If you haven&#39;t watched it yet, it&#39;s definitely worth your time."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018482/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005716",
              "author": {
                "username": {
                  "text": "RohitB-2957"
                },
                "userId": "ur211541672"
              },
              "summary": {
                "originalText": "Captivating story, great acting"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I dont usually like gory movies , but the story kept me glued to my seat the entire duration. Great acting by entire cast. Ranveer Singh looks and plays the part. Akshaye as always a pleasure on the screen. Direction is top class and the director plays to the actors strengths. Music is so fresh and nothing I have heard before, top notch!"
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005716/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009475",
              "author": {
                "username": {
                  "text": "SamirV-00"
                },
                "userId": "ur211561581"
              },
              "summary": {
                "originalText": "Only for rating this movie made a I'd on imdb"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best Spy movie ever and targeted rating to 1 and 2 star for making movie flop but trust me you are not ready for this it&#39;s not a song it&#39;s reality of this movie 🔥<br/><br/>India&#39;s biggest movie ever but you are not going to get bored for a single second I bet you I bet you<br/><br/>Even you are going to see this movie again and again\nMusic is just tremendous not a single song is okay okay each and every song brings something new background and bgm are just lit you are not going to get bgm during fight scenes like other films bgm it is calm composed and awesome\nActing skills of each and every single actor and actress was waaoo but Akshay Khanna is just lit no words are there to describe Akshay Khanna even you are going to search Akshay Khanna entry scenes on you tube again and again and also you watch this movie many times just because of Akshay Khanna trust me guys this movie is more larger than bahubali and kgf even I like both movie kgf and bahubali but this movie is really awesome than both of this two."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009475/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016087",
              "author": {
                "username": {
                  "text": "virogenpune"
                },
                "userId": "ur165268989"
              },
              "summary": {
                "originalText": "Class in all"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar has earned its status as a cult classic because it combines sharp storytelling, bold political commentary, and gripping drama. The film stands out for the way it portrays India&#39;s internal political environment and its complex relationship with Pakistan-elements that are woven into the narrative without diluting the entertainment value.<br/><br/>One of the strongest aspects of Dhurandar is its unfiltered depiction of the functioning of the Indian government during the era in which the story is set. The film does not hesitate to show bureaucratic delays, political power struggles, and the influence of the ruling Congress leadership. While the portrayal may feel controversial to some viewers, it adds realism and depth, making the audience reflect on how political decisions impact common citizens."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016087/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015858",
              "author": {
                "username": {
                  "text": "ratan-31764"
                },
                "userId": "ur147667790"
              },
              "summary": {
                "originalText": "Excellent movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Unlike other bollywood spy movies this movie jumps deep into the world building and shows the progression of an actual spy.glad they made it into two parts instead of one and gave more importance to its antagonists...the movie also has aspects of romance but it does not ruin the theme infact it is connected to the main activities of main character."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015858/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008300",
              "author": {
                "username": {
                  "text": "mayank-94914"
                },
                "userId": "ur120290331"
              },
              "summary": {
                "originalText": "EPIC MOVIE"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Someone please tell YRF that this is how you make a spy thriller and not that soft porn excuse of a movie. The whole cast, madhavan, Akshay, Ranveer, Sanjay Dutt everyone carried such a good movie! Crazy crazy. Awesome performance and awesome story. And the former NSA Daulat expose was damn good. Epic movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008300/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}