{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6jbjsqyxdo6ib7wwx3mrsrxr42cbt3ymdx7xnalo6qebgnesk2dk4om4vtjchg4jayqtrhvtqutkwz2gayka2um",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11015938",
              "author": {
                "username": {
                  "text": "jkg-25225"
                },
                "userId": "ur153421244"
              },
              "summary": {
                "originalText": "Most of it is copied from SISU"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The music is copied from SISU, the BGM, the presentation is copied Chapter wise as well. Ranveer Singh has copied the whole personality of Turgut from Dirilis: Ertugrul but has looked a cheap copy. The only good thing about the movie is Akshaye Khanna, what an actor. It is more of a propoganda film, as if the government has assured Aditya Dhar some more movies in his kitty without any issues like Censor board, etc. In one scene, Madhavan says we are waiting for a government that will help us fight against terrorism, as a matter of fact, most of the terrorist attacks have really happened under the government he is talking about. Even the 1999 Kandhar attack and 2001 parliament attacked happened under that government which Madhavan&#39;s character is supporting in the movie. When there is propoganda attached to any artistic venture, it doesn&#39;t remain art, it becomes cheap business. That&#39;s what Dhurandhar is."
                }
              },
              "authorRating": 2,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 12,
                "downVotes": 50
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015938/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011280",
              "author": {
                "username": {
                  "text": "alpeshp-83"
                },
                "userId": "ur211571686"
              },
              "summary": {
                "originalText": "One of best Masterpiece in last 5 years in Bollywood."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Okay, the movie was long, but I never felt that it was long while watching it since it was very engaging. Usually, I have a low attention time span but here I was rarely distracted.<br/><br/>Akshay Khanna and Sanjay Dutt were the recipe that made it a masterpiece. And of course Ranveer was good as well.<br/><br/>The sound and music were blended well in this movie. The action was superb; it had plenty of gore but nothing over-the-top. Basically, the depiction was as it should be.<br/><br/>On a side note: Sanjay Dutt&#39;s entry was so damn good. It was perfect with that song. Anyway, I would give it a good 10 since it has been a long time since I watched a good Bollywood movie. The last one that came close was Animal. Animal IMO was a good 8.5."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011280/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013773",
              "author": {
                "username": {
                  "text": "Neev-63"
                },
                "userId": "ur211592760"
              },
              "summary": {
                "originalText": "Best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; is a must-watch for fans of the spy and action-thriller genres. It&#39;s a high-voltage cinematic experience driven by a gripping script and exceptional acting, particularly by Ranveer Singh and the scene-stealing Akshaye Khanna. While its length might require patience, the sheer spectacle and performances make it a &quot;paisa vasool&quot; (worth the money) entertainer."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013773/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11034501",
              "author": {
                "username": {
                  "text": "vedantartist"
                },
                "userId": "ur135783456"
              },
              "summary": {
                "originalText": "Damn it is a must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "3 hours worth of cinema, even the post credits, must watch, aditya dhar nailed it, yrf fans please stay away, 1000 times better than pathaan, tiger..ranveer, akshay, and sanjay dutt nailed it in every scene, all negative reviews are either paid or pro pakistani, just book the tickets and go, don&#39;t think much."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11034501/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11030966",
              "author": {
                "username": {
                  "text": "Akhil-34"
                },
                "userId": "ur211302465"
              },
              "summary": {
                "originalText": "A Ranveer Vs Akshaye khanna show 🔥🔥🔥🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Positives::\n1. Magnificiant Visuals\n2. Great shots\n3. Excellent actors\n4. Killer music ( retro blends also)\n5. Good screen play.<br/><br/>Ranveer was like a roaring lion with calm body language and akshaye khanna is like a cheetah with anger .No need to feel anything bad about ranveer and sarah pairing .The maker knows what all this for and he gives us points about the thoughts we had about their age .its part of the character and movie. Overall the movie a decent watch with 3.30 hrs.if u love spy action movies and have some patience to watch entire movie. Ranveer says &quot;Hold my beer&quot;\nNegatives::\n1. Ranveer gets beaten up like a boxing bag and he spits blood like water but he Didn&#39;t need a medical help for recovery\n2. Some violent scenes were forcefully displayed."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11030966/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018159",
              "author": {
                "username": {
                  "text": "drvinaypandey"
                },
                "userId": "ur86463144"
              },
              "summary": {
                "originalText": "A Controlled, Well-Crafted Spy Thriller Elevated by Performances and Craft"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a rare Bollywood spy thriller that combines strong performances, tight technical craft, and an emotionally grounded storyline. The film&#39;s biggest strength remains its cast. Ranveer Singh delivers a remarkably restrained performance, portraying an intelligence operative with quiet intensity instead of loud heroism. Akshaye Khanna&#39;s sharp, calculating presence adds intellectual weight, while Sanjay Dutt&#39;s rugged authority anchors the narrative. In supporting roles, R. Madhavan and Arjun Rampal elevate the stakes with layered, convincing portrayals.<br/><br/>The background score deserves special mention. Instead of relying on generic patriotic notes, it uses subtle percussive tension and atmospheric themes that heighten suspense during covert operations. The score never feels overbearing; it moves with the emotion of each scene and helps maintain a gripping tone.<br/><br/>The storyline and plot revolve around cross-border espionage, internal betrayal, and a mission that tests loyalty, fear, and sacrifice. Aditya Dhar keeps the plot lean and focused, allowing characters to breathe without slowing the pace too much. The writing avoids unnecessary melodrama and sticks to mission-driven realism, though a few mid-act turns feel predictable. The buildup to the climax is strong and sets a compelling foundation for Part 2.<br/><br/>Narration is crisp, with limited voiceovers that actually add depth instead of spoon-feeding. The film uses visual storytelling: silent glances, coded exchanges, and detailed operation sequences that make the world feel lived-in.<br/><br/>The editing is tight and purposeful. Action sequences are cut cleanly, without shaky-cam excess. The transitions between narrative threads are smooth, and the film maintains momentum for most of its runtime. The second act slows slightly, but the well-paced final stretch compensates.<br/><br/>Surprisingly, the songs are minimal and placed thoughtfully. Instead of disrupting the pace, they serve as emotional anchors during transitional moments. No random item numbers, no unnecessary romance tracks; the soundtrack stays aligned with the film&#39;s tense tone.<br/><br/>Overall, Dhurandhar is a performance-driven, technically polished thriller that respects the viewer&#39;s intelligence. Its controlled acting, atmospheric score, sharp editing, and grounded plot make it one of the more refined spy dramas in recent years.<br/><br/>Rating: 8.8/10."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018159/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006950",
              "author": {
                "username": {
                  "text": "rajaryankhan-87030"
                },
                "userId": "ur118088406"
              },
              "summary": {
                "originalText": "A Thrilling Ride with Epic Performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the very first scene, the film establishes a tension that never lets up, drawing viewers into a meticulously crafted world of strategy, betrayal, and high-stakes action. Ranveer Singh shines in a role that demands both physical prowess and subtle emotional nuance, making each choice and reaction feel authentic. The supporting actors, including key veterans, add gravitas and complexity, enriching the storyline. Director Dhar&#39;s vision is evident in every frame, combining detailed production design with a hauntingly effective score that accentuates the narrative without overwhelming it. Action sequences are intense, yet grounded, serving the story rather than existing for spectacle alone. The film&#39;s pacing allows audiences to absorb character motivations and the political intrigue, making the explosive second half even more satisfying. The realism in the portrayal of corruption, crime networks, and moral dilemmas elevates the narrative, creating a cinematic experience that feels both thrilling and meaningful."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 9,
                "downVotes": 7
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006950/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007039",
              "author": {
                "username": {
                  "text": "krunaldesai-79352"
                },
                "userId": "ur115077391"
              },
              "summary": {
                "originalText": "Stars Shine in Action-Packed Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Each sequence is crafted with intention, balancing action, suspense, and emotional depth. Ranveer Singh delivers an immersive performance full of moral complexity, while Sanjay Dutt adds weight and menace. Akshaye Khanna and R Madhavan elevate the narrative with their intelligent portrayals, and Arjun Rampal&#39;s controlled intensity contrasts with Sara Arjun&#39;s vulnerable performance. Aditya Dhar&#39;s direction ensures that pacing, tension, and character arcs intertwine perfectly. Cinematography captures both chaos and quiet tension, and the music punctuates pivotal moments, culminating in a second half that is both adrenaline-fueled and emotionally satisfying."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 8,
                "downVotes": 6
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007039/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007714",
              "author": {
                "username": {
                  "text": "PKV07"
                },
                "userId": "ur19471915"
              },
              "summary": {
                "originalText": "A Bold, Riveting Spy Thriller Drenched in Grit and Gore"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is a bold and unflinching spy thriller soaked in raw intensity and bloody realism. Director Aditya Dhar pushes the envelope with visceral moments inspired by a true story, crafting a world that is brutal, immersive, and relentlessly gripping.<br/><br/>The action sequences are explosive and brilliantly staged, while the background score elevates every high-stakes moment - adding tension, urgency, and a cinematic punch.<br/><br/>Ranveer Singh shows remarkable maturity and evolution, delivering one of his most controlled performances.<br/><br/>Madhavan and Arjun Rampal amplify the screen with their commanding presence, each adding weight to the narrative.<br/><br/>Sanjay Dutt gets a meaty role and does complete justice to it.<br/><br/>But the biggest surprise is Akshaye Khanna - a silent, simmering force whose possessed rage and menacing aura take over the narration. His performance sends genuine chills down the spine.<br/><br/>The movie portrays the hardship of infiltration, the descent into darkness, and the desperate search for a sliver of light and a stable future.<br/><br/>Even at 3 hours and 30 minutes, the film&#39;s momentum never slows. The train keeps charging forward at full steam - and ends with an absolute banger of a climax.<br/><br/>A daring, high-voltage thriller that doesn&#39;t hold back."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 7,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007714/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11035434",
              "author": {
                "username": {
                  "text": "senbalaram"
                },
                "userId": "ur123216422"
              },
              "summary": {
                "originalText": "Good"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie was great absolutely no reasons are there for not liking the movie , but here comes a outrageous point where the movie feels like a very elongated movie which demands your full attention spam and many of the peoples lack that\nAlso the dance numbers are not so high but could have been avoided because u are making a movie on a spy not any avg bollywood movie where dance numbers are the main subject\nAnother point is my personal opinion i dont know its logical for the vast audience or not but the scenes of the actor with the actress is very exaggerated and very long it could have been easily trimmed and that could have added the next story of the movie in the same whole damn movie\nSo that&#39;s what i feel off about dhurandhar and it could have been a lot shorter but it delivered what its made for , pretty entertaining also\nAs we all know every artist gave their best in the movie to make the magic happen."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11035434/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025569",
              "author": {
                "username": {
                  "text": "chirags-0542"
                },
                "userId": "ur211683818"
              },
              "summary": {
                "originalText": "Blood wrenching Story telling"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Right story, much needed facts to be shown, but the way it was edited was a blunder for me. Was there a need to eloborate the blood wrenching scenes to give it an effect of the hooliganism? Was there a need to use foul language in every scene unnecessarily? Was there a need to show slow motion moves of akshay repeatedly? The first half was too slow and the 2nd half was too stretched with no suspense or thrill. Just pure violence in a glamorous way. A 1.5hr movie extended to 3+ hrs."
                }
              },
              "authorRating": 4,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 4,
                "downVotes": 11
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025569/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006522",
              "author": {
                "username": {
                  "text": "sohamsharma-69860"
                },
                "userId": "ur188346665"
              },
              "summary": {
                "originalText": "A Perfect Blend of Heart and High Intensity"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story grips from the first frame, drawing you into a web of strategy, betrayal, and moral conflict. The lead performance is quietly intense, conveying layers of fear, courage, and determination. Action sequences are meticulously choreographed, blending realistic combat with high tension. Background score and cinematography complement each scene, creating a cinematic rhythm that keeps the audience on edge. The narrative builds patiently, rewarding viewers with a climactic payoff that is both thrilling and emotionally charged. Every supporting role enhances the central conflict, giving depth to the underworld and political intrigue. This is storytelling that respects the intelligence of its audience, delivering a perfectly balanced mix of adrenaline and intellect."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006522/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007054",
              "author": {
                "username": {
                  "text": "dasj-61400"
                },
                "userId": "ur115061035"
              },
              "summary": {
                "originalText": "An Action-Packed Spectacle"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s first act establishes tension masterfully, introducing a world where power, loyalty, and danger intersect. Ranveer Singh delivers an immersive performance, skillfully portraying internal conflict and physical courage. Sanjay Dutt commands every confrontation, adding layers of menace and authority. Akshaye Khanna and R Madhavan enrich supporting sequences, while Arjun Rampal exudes a quiet, pervasive threat. Sara Arjun&#39;s emotional performance provides narrative grounding. Aditya Dhar&#39;s direction orchestrates pacing, suspense, and action with precision. Cinematography captures both scale and intimacy, and the score intensifies every beat. The climax ties together narrative arcs, delivering thrilling action and emotional resolution."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007054/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007196",
              "author": {
                "username": {
                  "text": "vihaanlaad"
                },
                "userId": "ur118092935"
              },
              "summary": {
                "originalText": "Action, Emotion, and Star Power Combined"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene is crafted with precision, balancing action, suspense, and emotional resonance. Ranveer Singh delivers a layered performance, portraying a man whose moral choices are as gripping as the physical risks he faces. Sanjay Dutt adds commanding authority and menace, while Akshaye Khanna and R Madhavan enhance the ensemble with nuanced performances. Arjun Rampal&#39;s quiet menace builds tension, and Sara Arjun provides emotional authenticity that grounds the story. Aditya Dhar&#39;s direction ensures that each twist, confrontation, and action sequence serves the narrative. Cinematography captures chaos and intimate beats with equal skill, and the score accentuates suspense. By the finale, the film achieves a combination of adrenaline, tension, and emotional depth that lingers."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007196/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007060",
              "author": {
                "username": {
                  "text": "srushtijha"
                },
                "userId": "ur123190126"
              },
              "summary": {
                "originalText": "Power, Action, and Ranveer's Energy"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is intricate, balancing political intrigue, moral ambiguity, and visceral action. Ranveer Singh&#39;s layered performance anchors the film, oscillating between cunning strategy and emotional vulnerability. Sanjay Dutt adds formidable gravitas, while Akshaye Khanna and R Madhavan provide subtle, intelligent performances. Arjun Rampal&#39;s understated menace maintains constant tension, and Sara Arjun&#39;s emotional depth highlights the human cost of the narrative. Aditya Dhar&#39;s direction ensures that suspense, pacing, and action coexist perfectly. Cinematography captures chaos and intimacy, while the score amplifies every emotional and suspenseful beat. The finale delivers a thrilling, emotionally charged payoff."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007060/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007154",
              "author": {
                "username": {
                  "text": "raghavjha-43317"
                },
                "userId": "ur118091153"
              },
              "summary": {
                "originalText": "A Perfect Mix of Action and Emotion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film builds tension gradually, immersing audiences in a morally ambiguous world filled with danger and intrigue. Ranveer Singh dominates with a performance that oscillates between calculated aggression, vulnerability, and moral contemplation. Sanjay Dutt adds gravitas, authority, and menace, his presence elevating every interaction. Akshaye Khanna and R Madhavan provide intelligence and subtle tension, enhancing narrative complexity. Arjun Rampal&#39;s controlled menace creates palpable suspense, while Sara Arjun&#39;s emotional depth highlights the stakes of each decision. Aditya Dhar directs with exceptional skill, balancing intense action with quiet, strategic plotting. Cinematography captures both sprawling cityscapes and intimate moments, while the score heightens every beat of suspense and emotion. The second half delivers shocking twists, meticulously staged action, and emotional resonance, culminating in a finale that is both thrilling and unforgettable."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007154/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005049",
              "author": {
                "username": {
                  "text": "AkashK-0393"
                },
                "userId": "ur211538838"
              },
              "summary": {
                "originalText": "Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Although the film was excellent, I believe that removing the unnecessary abusive language would not have affected its quality. In fact, it could have made the film more suitable for all audiences, including children and families. The issue the movie addresses is truly significant, and I wholeheartedly salute the unsung heroes of our nation who sacrificed their lives for the country. I would also like to advise the makers that, in the next part, please avoid using abusive language. It feels outdated now, and the strength of your subject matter is already self-justifying. The film is powerful and worth watching on its own, so adding such language may negatively affect its impact."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005049/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007123",
              "author": {
                "username": {
                  "text": "kapooramit-84650"
                },
                "userId": "ur115069955"
              },
              "summary": {
                "originalText": "Power-Packed Performances in Every Scene"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses viewers in a complex web of intrigue, danger, and moral conflict. Ranveer Singh&#39;s performance is captivating, alternating between calculated strategy, raw emotion, and intense action. Sanjay Dutt brings gravitas and a commanding presence, while Akshaye Khanna and R Madhavan provide subtle narrative depth. Arjun Rampal&#39;s menace is understated but palpable, and Sara Arjun&#39;s emotional scenes provide the story&#39;s heart. Aditya Dhar directs with meticulous precision, balancing suspense, strategy, and high-octane action. Cinematography highlights both chaotic cityscapes and intimate character moments. The finale delivers adrenaline, tension, and emotional payoff simultaneously."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007123/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006602",
              "author": {
                "username": {
                  "text": "kavyash-93312"
                },
                "userId": "ur196233751"
              },
              "summary": {
                "originalText": "A Blockbuster Wave of Thrill and Emotion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene feels intentional, with suspense building through carefully placed dialogue, gestures, and visual cues. The lead delivers a performance of remarkable subtlety, conveying moral struggle with understated intensity. Action sequences are gripping, designed to heighten tension while remaining believable. The cinematography captures both the sprawling chaos of urban landscapes and intimate personal moments. Supporting roles are thoughtfully written, adding complexity and texture. The score and editing work in tandem to maintain pacing, ensuring the long runtime never feels indulgent. The second half delivers a thrilling, emotionally charged crescendo, leaving viewers reflecting on the narrative long after the final frame."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006602/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029062",
              "author": {
                "username": {
                  "text": "RhishikeshA"
                },
                "userId": "ur206231228"
              },
              "summary": {
                "originalText": "Dhurandhar - Intense, Stylised, Violent... but Not Quite As Good As Uri"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a film that announces its intent very clearly... this is going to be intense, larger than life, and unapologetically violent. By Bollywood standards, it pushes the envelope on brutality, and that in itself makes it stand out.<br/><br/>Aditya Dhar deserves credit for attempting to stitch together real world inspired events and characters, clearly drawing parallels to known personalities and incidents. The effort is visible, even if the execution doesn&#39;t always feel fully real.<br/><br/>Ranveer Singh dominates the screen as a full blown alpha male. He looks dashing, aggressive, and physically overpowering... so much so that his built is too big for his clothes. His clothes were unable to contain the bulge of his muscular built.. :D\nHis presence is raw and commanding, and he fits perfectly into the alpha male protagonist&#39;s role!<br/><br/>Akshaye Khanna, however, is the real surprise. His portrayal carries a quiet but deeply unsettling violence. The smile, the posture, the controlled menace... everything is on point. His much discussed dance moves gaining traction on social media seem less about choreography and more about the aura of his character combined with the background score.<br/><br/>On the flip side, the female lead feels completely unnecessary. She adds neither narrative weight nor emotional depth. The film honestly didn&#39;t need a heroine at all, and her presence feels like a Bollywood necessity rather than a requirement of the story.<br/><br/>R. Madhavan&#39;s character strongly resembles Mr. Dobhal, but sadly, Madhavan doesn&#39;t get enough space to explore or elevate the role. It feels like a missed opportunity for an actor of his calibre. Arjun Rampal remains strictly average... no highs, no lows, just present. Sanjay Dutt, on the other hand, brings in a rugged, old school masculinity. Broad shouldered, raw, yet oddly classy... he proves once again that some actors genuinely age well.<br/><br/>A special mention goes to Rakesh Bedi, whose performance feels underrated. His Urdu lehza is authentic, his physicality matches the character, and he looks convincingly real in the role. He was excellent in Uri as well, and his consistency continues here.<br/><br/>That comparison with Uri is inevitable... and unfortunately for Dhurandhar, Uri was far more grounded, believable, and impactful. In comparison, Dhurandhar leans heavily into stylisation and violence, sometimes at the cost of realism.<br/><br/>Final verdict:\nDhurandhar is intense, ambitious, and visually aggressive. It doesn&#39;t quite reach the emotional or narrative strength of Uri, but it&#39;s still a solid one-time watch.. especially for those who enjoy gritty, masculine, high-voltage cinema.<br/><br/>Not flawless, not forgettable... but definitely not Dhar&#39;s best."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029062/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011623",
              "author": {
                "username": {
                  "text": "TenzinW-40"
                },
                "userId": "ur211576872"
              },
              "summary": {
                "originalText": "Authentic, Gritty, and True"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar genuinely surprised me-in the best way. As someone from the armed forces, I&#39;m usually very critical of how movies portray intelligence work, but this film felt real, grounded, and respectful of the profession. It didn&#39;t exaggerate the life of a spy with unnecessary glamour or over-the-top heroism. Instead, it captured the silent grit, the constant tension, and the unseen sacrifices that define real operatives.<br/><br/>The storyline is tight, the pacing sharp, and the character development subtle yet powerful. What impressed me most was how the film showed the emotional weight carried by those who work in the shadows-how every decision they make comes with consequences the world never hears about. The lead actor delivered a performance that felt authentic, restrained, and deeply human.<br/><br/>For me, Dhurandhar stands out because it offers respect to the intelligence community without turning them into caricatures. It reminds you that true heroes are often the ones who never get recognition."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011623/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009512",
              "author": {
                "username": {
                  "text": "padmakarlohatkar"
                },
                "userId": "ur165227471"
              },
              "summary": {
                "originalText": "Masterpiece of Indian cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Seems like #Dhurandhar is being LOVED by the audience for:<br/><br/>1. The DRAMA that unfolds, especially in the 2nd half<br/><br/>2. The placement of music and BGM for every character<br/><br/>3. The SONG where Akshaye dances is going CRAZY on the internet !<br/><br/>4. And the Performances by the ACTORS, especially #AkshayeKhanna !<br/><br/>So the BUZZ is INCREASING even more now as PEOPLE are RE - WATCHING it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009512/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008435",
              "author": {
                "username": {
                  "text": "dasaritra92"
                },
                "userId": "ur36631518"
              },
              "summary": {
                "originalText": "One of the best spy thrillers of Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After a very long time Bollywood has produced an amazing movie which is worth going to the theatres for. The story, background score, acting, action scenes everything was spot on. Ranveer Singh and Akshay Khanna were simply outstanding with Ranveer Singh outshining others. This is hands down one of the best spy thrillers coming out of Bollywood. Pathan tiger war these films will feel like Cartoon Network shows before this film. A big shout out to the director Aditya Dhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008435/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011593",
              "author": {
                "username": {
                  "text": "GunjeshKumarSharma"
                },
                "userId": "ur176668422"
              },
              "summary": {
                "originalText": "Facts revealing, and a great suspense thriller of 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshaye is really spreading Stockholm Syndrome. His dance moves will make you fall in love with this man. Perfect cast for the cast of Rahman Dakait.<br/><br/>Hamza (Ranvir) doing justice for his role. His long hair looks and physique will definitely not let you leave theatre for using washroom or buying snacks.<br/><br/>Not sure, why Madhavan agreed for this role but wherever he was in the scene he was totally outstanding. He performed like every time he does.<br/><br/>Saumya Tandon is so pretty in her character. She doesn&#39;t have much dailogue however she was in the frame and really made justice to her character without giving much effort."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011593/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007384",
              "author": {
                "username": {
                  "text": "Amritanshu-7"
                },
                "userId": "ur211547227"
              },
              "summary": {
                "originalText": "India's Boldest Intelligence Thriller Yet"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just a film it is a milestone in Indian cinema. A rare combination of realism, emotional depth, and electrifying intensity, this movie sets a new benchmark for the spy-thriller genre in India.<br/><br/>From the opening frame to the final shot, the film grips you with an unshakable sense of authenticity. There is no Bollywood glamour, no exaggerated nationalism, no cartoonish villainy just the harsh, unfiltered truth of intelligence work."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007384/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}