{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4sobczsqyxdo6id76ux5mbvr7smmar334kt777kaxo6qebgnesk2dk5pe4fjjchdlrgpq6nwd7bydf7bpj7fwetzi",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11010851",
              "author": {
                "username": {
                  "text": "prakashanand704"
                },
                "userId": "ur57624856"
              },
              "summary": {
                "originalText": "Outstanding Film 🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best films of the year. Go see it with family and friends. Don&#39;t miss it in theaters. Looking forward to the next installment. Ignore the negativity because they do not want to show the reality of terrorism in that country. So someone will give a negative review and will only talk about negativity but I will say again that do not forget to watch this movie in the theatre. I&#39;m rating it 10/10...🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010851/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015422",
              "author": {
                "username": {
                  "text": "pg-94439"
                },
                "userId": "ur83030708"
              },
              "summary": {
                "originalText": "What a feast! Bold and beautiful"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Nuanced, complex, and delicate play. Great movie. After Gangs of Wasseypur something that has kept me engaged for 3.5 hrs straight. Waiting for the next one.<br/><br/>Well made, complex, and delicate play. Great movie. After Gangs of Wasseypur something that has kept me engaged for 3.5 hrs straight. Waiting for the next one."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015422/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012915",
              "author": {
                "username": {
                  "text": "ashokkum-38472"
                },
                "userId": "ur85187820"
              },
              "summary": {
                "originalText": "A powerful, intense thriller - long but undeniably impactful."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a dark, gritty and high-voltage spy thriller that stands out for its scale and intense storytelling. Ranveer Singh delivers a fierce performance, while Akshaye Khanna steals the spotlight with a commanding presence that elevates every scene. The world-building feels immersive, the tension rarely drops, and the visual tone keeps you alert and invested throughout.<br/><br/>Though the runtime is long and occasionally heavy, the payoff is strong if you enjoy intense, layered thrillers. Its atmosphere, performances and emotional weight make it a memorable cinematic experience - bold, ambitious and gripping from start to finish."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012915/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013254",
              "author": {
                "username": {
                  "text": "OmrajK-55"
                },
                "userId": "ur211588969"
              },
              "summary": {
                "originalText": "Bollywood is back with the bang!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Amazing movie! Every single artist has done top notch acting. Best storyline. Please ignore negative reviews. Those are only because of some stupid controversy with south people.<br/><br/>Akshaye Khanna as Rehman Dakait has to be the best character. His acting, his aura, just brilliant performance.<br/><br/>Arjun Rampal the goat is back with his Banger action.<br/><br/>Sanjay Dutt is Sanjay Dutt he is has done fabulous job as an actor.<br/><br/>And finally the OG Ranveer Singh, the Hamza, he is a star! Great performance.<br/><br/>Must watch! This movie must break all the box office records."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013254/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023091",
              "author": {
                "username": {
                  "text": "dhananjaygole-27565"
                },
                "userId": "ur69861447"
              },
              "summary": {
                "originalText": "AKSHAYE KHANNA - THE REAL DHURANDHAR"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar presents a strongly written story undermined by weak direction and a poorly structured screenplay. The film feels unnecessarily long and stretched, with inconsistent sequencing that makes it difficult to understand what is happening and when. Instead of creating intrigue, the non-linear narration often leads to confusion.<br/><br/>The direction is the film&#39;s biggest drawback. Apart from the action sequences, the movie lacks narrative clarity, emotional flow, and pacing discipline. Poor scene transitions and an overextended runtime further dilute the impact.<br/><br/>However, the action choreography is top-notch and clearly stands out. The story writing holds the film together and prevents it from completely falling apart despite flawed execution.<br/><br/>Performances<br/><br/>Akshaye Khanna emerges as the film&#39;s strongest pillar, leading it almost single-handedly with an authoritative and controlled performance. Ranveer Singh supports the narrative with solid acting and impressive action sequences, though the story unrealistically bends around his character&#39;s will.<br/><br/>Sanjay Dutt appears distracted and oddly powerless in several scenes, reducing the weight of his character. Arjun Rampal has minimal screen presence and fails to add meaningful depth to the narrative.<br/><br/>R. Madhavan, portrayed as the head of the Intelligence Bureau and positioned as a &quot;charioteer of karma,&quot; ironically comes across as powerless-more like a silent observer than an authority figure. Rather than influencing events, he seems to suffer from karma himself, with little real control over the unfolding story.<br/><br/>Overall, events rarely feel planned or strategic, yet they unfold as if driven solely by Ranveer Singh&#39;s character, with negligible intervention from the intelligence machinery. This weakens the credibility of the narrative.<br/><br/>Final Verdict<br/><br/>Dhurandhar is a well-written film with excellent action and strong performances, but it is held back by confusing screenplay structure, weak direction, and excessive runtime. Despite its flaws, the acting and core story make it a watchable but frustrating experience."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023091/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004166",
              "author": {
                "username": {
                  "text": "ramanisahil-45314"
                },
                "userId": "ur133364686"
              },
              "summary": {
                "originalText": "Insult to Maj Mohit Sir"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Durandhar is a huge disappointment. The story is messy, facts feel twisted, and the emotional moments look forced rather than heartfelt. The performances are exaggerated, direction is weak, and the pacing makes it almost unbearable to watch. A movie that should have been respectful instead turns into a confused and insensitive drama. It fails to deliver any genuine impact and ends up feeling like a waste of time and money. Not recommended at all."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 12,
                "downVotes": 190
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004166/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012911",
              "author": {
                "username": {
                  "text": "ravirajsingh-83035"
                },
                "userId": "ur196449962"
              },
              "summary": {
                "originalText": "Aditya Dhar nailed it. And also actor done absolutely great work."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Before this movie i saw about all the characters of this movie and they are very messy people. But as expected Aditya Dhar done fabulous work. And i think after this he set bar as high that he have to do hard work for touch that. (Also i watched hall recorded because around my city there is no any cinema hall)"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012911/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015950",
              "author": {
                "username": {
                  "text": "sandipmalierl"
                },
                "userId": "ur112296779"
              },
              "summary": {
                "originalText": "Most striking elements is the use of archival footage"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the most striking elements is the use of archival footage, including 9/11 and other terror attacks, interspersed with chilling audio of attackers plotting against India. These sequences evoke patriotism without jingoism, reminding the audience of the stakes while highlighting India&#39;s strategic resilience. It&#39;s a cinematic call to awareness and courage that makes the story even more gripping."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015950/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11040656",
              "author": {
                "username": {
                  "text": "ashwinquestsucceed"
                },
                "userId": "ur62732887"
              },
              "summary": {
                "originalText": "Dhurandhar - A Bold, Honest, and Truly Path-Breaking Film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands out as a rare film that dares to be unapologetically honest. In an industry where comfort often outweighs courage, this movie chooses truth - and that alone makes it extraordinary.<br/><br/>What makes Dhurandhar truly path-breaking is its fearless storytelling. It doesn&#39;t dilute, sensationalize, or play safe. Instead, it presents its narrative with remarkable integrity, trusting the audience to engage, reflect, and feel. That honesty stays with you long after the screen fades to black.<br/><br/>The film challenges conventions - in tone, structure, and intent - and sets a new benchmark for meaningful cinema. It&#39;s not just a movie you watch; it&#39;s an experience that provokes thought and conversation. One can sense the conviction behind every creative choice, making it clear that Dhurandhar is driven by purpose rather than formula.<br/><br/>This is the kind of cinema that pushes boundaries and opens doors for more courageous storytelling in the future. Dhurandhar isn&#39;t just a film - it&#39;s a statement, and a powerful one at that."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11040656/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006543",
              "author": {
                "username": {
                  "text": "shreyashayer"
                },
                "userId": "ur185005223"
              },
              "summary": {
                "originalText": "Voices That Inspire, Scenes That Explode"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening scene, the film establishes a rhythm that balances suspense, strategy, and human emotion. Ranveer Singh embodies his character&#39;s moral complexity with a performance that captivates. Dhar&#39;s direction ensures that action scenes carry narrative weight, while quieter moments resonate emotionally. Supporting actors enhance every interaction with depth and nuance. The technical craftsmanship, including cinematography and editing, sustains tension and engagement throughout, making the film a masterclass in modern cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006543/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006600",
              "author": {
                "username": {
                  "text": "imdbfan-7865673841"
                },
                "userId": "ur198243869"
              },
              "summary": {
                "originalText": "Cinema That Talks to Your Heart"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar impresses with its scale, ambition, and precision in execution. The lead actor delivers a career-defining performance, showing a remarkable range that moves from calculated strategy to raw emotional turmoil effortlessly. The supporting cast is equally commendable, with characters that feel real and necessary to the story&#39;s progression. The director&#39;s skill is evident in the film&#39;s pacing, narrative structure, and visual storytelling. Each frame communicates purpose, whether it&#39;s a high-tension action sequence or a quiet character moment. Real historical and political events are woven into the screenplay naturally, adding depth without distracting from the plot. Music and sound design enhance the experience, accentuating suspense and drama perfectly. Dhurandhar demonstrates how Indian cinema can combine entertainment, intelligence, and realism, creating a film that is both thrilling and emotionally resonant."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006600/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026414",
              "author": {
                "username": {
                  "text": "devulapallic"
                },
                "userId": "ur43341370"
              },
              "summary": {
                "originalText": "A gritty, realistic big screen spectacle backed by solid performances."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar (2025), a big screen spectacle, is a high-stakes espionage thriller that follows a covert Indian intelligence operation to dismantle a powerful terrorist-gangster nexus operating out of Karachi, Pakistan.<br/><br/>Aditya Dhar&#39;s writing &amp; direction and the film&#39;s technical execution sets a very high standard for the spy thriller genre.<br/><br/>(This guy is no fluke. Another National Award in the offing.)\nThe film&#39;s events are set against the backdrop of real-life incidents that shook India, primarily the 1999 IC-814 hijacking, the 2001 Indian Parliament attack and the 26/11 Mumbai Attacks.<br/><br/>Blending facts with fiction, the sprawling narrative is divided into 8 chapters. This structure helps manage the extensive world-building and character development spanning nearly a decade of real-life events, making the story feel less like a single long film. As a stylistic choice, this format offers a deliberate, novelistic approach to storytelling, treating each segment as a movement within a larger, classified file or document.<br/><br/>Gritty, Realistic Action: The action sequences are meticulously choreographed and grounded in reality, avoiding over-the-top stunts. The brutal, visceral hand-to-hand combat and realistic set pieces enhance the film&#39;s raw feel. The action sequence in Chapter 3 is terrific and well-choreographed!<br/><br/>Immersive World-Building: The film excels at creating an authentic sense of place, transforming locations in India and Thailand into the dense, chaotic alleys of Karachi&#39;s Lyari district.<br/><br/>The cinematography uses muted tones and shadows to create a dark, gritty, and tense atmosphere.<br/><br/>The background score is relentless. The use of real audio recordings from the 26/11 Mumbai attacks is chilling and impactful, connecting fiction to a real tragedy.<br/><br/>The ensemble cast is the film&#39;s greatest strength, with every actor delivering powerful performances.<br/><br/>Akshaye Khanna Ji is the film&#39;s soul and scene-stealer. His portrayal of the complex, charismatic, and chilling gangster Rehman Dakait (~based on Sardar Abdul Rehman Baloch) is laudable for its depth and menace. A sureshot contender for the National Award.<br/><br/>Ranveer Singh churns out a restrained and intense performance, a departure from his usual energetic roles. He effectively embodies the quiet determination and inner conflict of an undercover agent, letting subtle gestures speak volumes. His character Hamza Ali Mazari/Jaskirat Singh Rangi is a composite of multiple Indian Para Special Forces (Para SF) and Research and Analysis Wing (R&amp;AW) operatives who have conducted covert operations.<br/><br/>R. Madhavan, Sanjay Dutt, Rakesh Bedi and Arjun Rampal all make significant impacts ensuring there are no weak links in the cast.<br/><br/>R. Madhavan&#39;s character, Ajay Sanyal, is inspired by India&#39;s current National Security Advisor, Ajit Doval.<br/><br/>Sanjay Dutt&#39;s character SP Chaudhary Aslam is inspired by the real Chaudhry Aslam Khan, a renowned Pakistani &quot;encounter specialist&quot; police officer who targeted and eliminated many major criminals, including Rehman Baloch.<br/><br/>Rakesh Bedi&#39;s character Jameel Jamali is inspired by the real-life Pakistani politician Nabil Gabol.<br/><br/>Arjun Rampal as Major Iqbal is modelled after Ilyas Kashmiri, a dangerous Pakistani ex-Special Forces operative who became a high-ranking Al-Qaeda commander linked to major terror attacks, including the 26/11 Mumbai attacks.<br/><br/>The film weaves these real-life figures and events into a fictional narrative centered around a large-scale covert operation in Karachi&#39;s Lyari district, known as &quot;Operation Lyari&quot;.<br/><br/>This film will be talked about for many years for its strong performances, gritty direction, and intense, grounded action.<br/><br/>Fact-checkers and critics will cry factual inaccuracies in the film. Just ignore! Propaganda accusations? None. Don&#39;t trust the negative reviews!<br/><br/>The sheer volume of information and characters may overwhelm the audience. (information overload)\nBut, if you loved Black Friday (2004), trust me Dhurandhar is much more and beyond.<br/><br/>This is an example of how a two-part film must be treated. Can&#39;t wait for the Part-2 of this film March 2026."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026414/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031321",
              "author": {
                "username": {
                  "text": "Vansh_Kumar"
                },
                "userId": "ur125415190"
              },
              "summary": {
                "originalText": "Absolute Banger"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After a very long time i watched a very brilliant spy movie with zero stylised action everything will be raw and real nothing like other spy movies like Pathan, War 2 and Tiger no unnecessary dance numbers in which the main leads are dancing specially like in Pathan and War they just bikini scenes just to add some spice in the movies but in Dhurandar they showed us what the actual spy means\nMakers of this movie created this movie so well I didn&#39;t feel it any long i don&#39;t know when this 3 hrs 34 min long movie starts and ends I just lost in the movie\nHatts off to the makers brilliant job👌🏻👌🏻"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031321/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006713",
              "author": {
                "username": {
                  "text": "vaidyakunal"
                },
                "userId": "ur123188802"
              },
              "summary": {
                "originalText": "Action, Drama, and Superstar Moments"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every sequence in the film is meticulously constructed to maximize tension and narrative depth. Ranveer Singh shines in moments of moral ambiguity, whether negotiating with dangerous players or confronting his own conscience. Sanjay Dutt is magnetic, his controlled menace providing a constant undercurrent of tension. Akshaye Khanna&#39;s strategic calm and R Madhavan&#39;s authoritative presence create a compelling ensemble, while Arjun Rampal&#39;s subtle intimidation keeps audiences alert. Sara Arjun&#39;s innocence heightens stakes in emotionally charged family scenes. Aditya Dhar&#39;s direction weaves together suspenseful plotting, intense action, and intricate character arcs seamlessly. Cinematography captures Karachi&#39;s sprawling underworld, contrasting it with intimate close-ups that reveal characters&#39; internal struggles. The musical score enhances every turn, from quiet, tense dialogues to explosive action sequences. The second half escalates with unrelenting energy, and the climax delivers both emotional and adrenaline-packed payoff, leaving a lasting impression."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006713/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007082",
              "author": {
                "username": {
                  "text": "nishakumariand"
                },
                "userId": "ur173978667"
              },
              "summary": {
                "originalText": "Every star brings force, every scene brings fire"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The brilliance of Dhurandhar lies in its unflinching portrayal of an underworld riddled with politics and power struggles. Ranveer Singh&#39;s performance anchors the film, delivering emotional depth amid chaos. Director Dhar&#39;s meticulous approach ensures that the narrative tension escalates naturally, blending psychological intrigue with pulse-pounding action. Supporting cast members shine in morally complex roles, enhancing the film&#39;s authenticity. Cinematography captures both the scale of action and the subtleties of character emotion, while the soundtrack intensifies each dramatic beat, creating a cinematic experience that lingers long after the final scene."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 4
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007082/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007737",
              "author": {
                "username": {
                  "text": "nikhilsrivastav-51032"
                },
                "userId": "ur127510954"
              },
              "summary": {
                "originalText": "Bollywood uprising"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie stands out and completely justified it&#39;s name, the lead is heroic, does planning plotting and execution equally well whether to convince the girl or killing of gangsters, This is good because it is based on half truth story that brings more essence this is a must watch but be aware contents/visuals may be alarming to some. But those who watch Netflix blood thirsty series, they can handle."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007737/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007134",
              "author": {
                "username": {
                  "text": "pksinghal-33944"
                },
                "userId": "ur100335414"
              },
              "summary": {
                "originalText": "Blockbuster Material"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The sets are very realistic, the music score is absolutely smashing and the story is great. Didn&#39;t even realise it was 200 minutes long.<br/><br/>Akshay Khanna&#39;s acting was top notch.<br/><br/>The whole cast was impressive. Ramvir Singh&#39;s hair stylist has my respect. Very realistic portrayal of how politics work in Pakistan."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007134/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006880",
              "author": {
                "username": {
                  "text": "Katrik-56"
                },
                "userId": "ur206824022"
              },
              "summary": {
                "originalText": "Mind-blowing Based on True Events"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A Must-Watch!<br/><br/>&quot;Durandhar&quot; is nothing short of epic. From the opening scene to the rolling credits, it delivers a high-octane cinematic experience that keeps you on the edge of your seat. It isn&#39;t just a movie; it is an emotion.<br/><br/>Key Highlights\nAdrenaline-Pumping Action: The film is loaded with action-packed sequences occurring one after another. The choreography is top-notch, delivering genuine goosebumps moments that action lovers will adore.<br/><br/>Stellar Performances: Every single actor brought their A-game. The performances were amazing, adding depth and intensity to the high-stakes narrative.<br/><br/>Rooted in Reality: What makes the movie hit harder is its foundation in true facts and a true story. The authenticity shines through, making the experience even more gripping.<br/><br/>Technical Brilliance: The film is exceptionally well-directed, with a tight screenplay that never lags. Complementing the visuals are the energetic songs that are spot-on and elevate the mood perfectly.<br/><br/>Final Thoughts\n&quot;Durandhar&quot; is a cinematic tribute to valour. It is an unapologetic celebration of the country. As the sentiment goes, haters of India won&#39;t like this movie, but for everyone else, it is a proud, powerful, and unmissable watch.<br/><br/>Just WoW!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006880/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014612",
              "author": {
                "username": {
                  "text": "gagankumarmusic"
                },
                "userId": "ur155935197"
              },
              "summary": {
                "originalText": "THE CINEMA!!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I mean yes, why not?<br/><br/>This is the cinema we always wanted.<br/><br/>But for years we got served pure garbage in the name of spy films, so I&#39;m not even shocked people can&#39;t recognize a good movie anymore. After being fed loud, empty films like Pushpa, KGF, RRR, the audience genuinely forgot what real cinema looks like.<br/><br/>Dhurandhar is everything those films pretend to be a sharp action, gripping storytelling, every scene landing exactly where it should. Aditya Dhar didn&#39;t just make a film; he reminded us what filmmaking actually means.<br/><br/>The versatality of Akshay Khanna and Ranveer Singh is just brilliant. BRILLIANT!!<br/><br/>Give them trash scripts and they survive.<br/><br/>Give them real cinema and they dominate.<br/><br/>3 hours 30 minutes and not a single dull second.<br/><br/>If this movie doesn&#39;t outperform the so-called &quot;blockbusters,&quot; then honestly, the audience has failed, not the film.<br/><br/>Go watch it.<br/><br/>It&#39;s a masterpiece, whether people get it or not."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014612/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013452",
              "author": {
                "username": {
                  "text": "rohanmh12"
                },
                "userId": "ur66922749"
              },
              "summary": {
                "originalText": "A must watch OG spy thriller!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is the best movie of 2025, an intense, stylish, and powerful ride from start to finish. With gripping action, strong performances, and a finale that leaves you craving more, it&#39;s a cinematic knockout. Can&#39;t wait for REVENGE!!!!!!! Just don&#39;t listen to other people who like Masala Spy ISI Universe movies. LOL."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013452/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007058",
              "author": {
                "username": {
                  "text": "RupeshJ-19"
                },
                "userId": "ur203912496"
              },
              "summary": {
                "originalText": "A Mega Ride of Power, Emotion, and Thrill"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every sequence contributes to a tense, gripping narrative. Ranveer Singh portrays internal struggle and outward determination with precision, while Sanjay Dutt commands the screen with a presence that heightens tension. Akshaye Khanna and R Madhavan provide supporting performances that enhance story depth, and Arjun Rampal&#39;s intensity adds unpredictability. Sara Arjun&#39;s performance grounds the narrative emotionally. Under Aditya Dhar&#39;s direction, suspense and action are blended seamlessly, and the cinematography emphasizes both scale and intimate detail. The soundtrack amplifies dramatic moments, and the film culminates in a satisfying and powerful climax."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007058/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006591",
              "author": {
                "username": {
                  "text": "PrinciD-5"
                },
                "userId": "ur210348068"
              },
              "summary": {
                "originalText": "Drama, Action, and Superstar Energy"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film blends cerebral storytelling with high-intensity action sequences that feel earned and purposeful. Ranveer Singh delivers a layered performance, moving effortlessly between reflection, moral conflict, and physical intensity. Sanjay Dutt commands attention in every scene, his gravitas and menace palpable. Akshaye Khanna and R Madhavan create tension and narrative depth, while Arjun Rampal injects suspense with his quiet but menacing presence. Sara Arjun brings emotional weight, humanizing the stakes. Aditya Dhar&#39;s direction balances multi-threaded plotting, suspense, and kinetic action beautifully. Cinematography emphasizes scale and intimacy, and the score accentuates suspense. The climax is emotionally charged and adrenaline-filled."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006591/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009215",
              "author": {
                "username": {
                  "text": "Pawan-6652"
                },
                "userId": "ur211560383"
              },
              "summary": {
                "originalText": "Gritty movie, fascinating storyline, full paisa vasool!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Star studded cast, well crafted story line, a gritty movie. Holds your attention all through. If you want to understand how dirty politics and keeping your country safe gets, a must watch. I&#39;ve got a deeper appreciation of all that goes into keeping a country safe, the sacrifices made, often times by people who will never be known by the public."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009215/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023769",
              "author": {
                "username": {
                  "text": "shivamsemwal"
                },
                "userId": "ur35689298"
              },
              "summary": {
                "originalText": "Engaging but Excessive"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar positions itself as a large-scale spy thriller inspired by real events, and from a technical standpoint, it does several things right. The background score, sound design, and overall audio treatment effectively build tension and add to the thriller atmosphere. Viewed purely as a genre film, it is engaging and works reasonably well.<br/><br/>However, the film relies more on emotional amplification than on strong storytelling. Instead of letting the narrative and characters naturally drive the impact, it often turns to exaggerated dramatic moments, heavy-handed dialogues, and repeated emphasis on familiar conflict themes. This comes across as an attempt to compensate for a weaker script rather than a confident storytelling choice.<br/><br/>The use of real-life footage and audio clips from past terrorist attacks adds shock value, but it feels excessive and avoidable in many places. Similarly, the level of on-screen violence and gore is pushed far beyond what the story actually demands. Rather than increasing tension, the excessive gore often feels like it is there purely for effect, reducing its overall impact.<br/><br/>The film also suffers from its length. At close to three and a half hours, Dhurandhar noticeably drags, and a tighter edit would have made the experience far more effective without sacrificing key moments.<br/><br/>Overall, Dhurandhar is a decent one-time watch if approached strictly as a spy thriller with strong technical execution. That said, its overreliance on heightened emotions, excessive violence, and overstated themes prevents it from becoming a sharper and more refined film. A more restrained approach and a stronger script could have elevated it significantly."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023769/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006999",
              "author": {
                "username": {
                  "text": "Kartikc-083"
                },
                "userId": "ur211547888"
              },
              "summary": {
                "originalText": "Boring -too long - watch if u are from Karachi"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is too slow .<br/><br/>Went with 7 office colleagues\nStart was too slow\nIn fact for a noon show we became so drowsy that we had to ask each other on what happened in scenes that we missed<br/><br/>Story is not what trailer shows - thats part2\nStory is abt Karachi slum gangs mostly<br/><br/>As Indian hard to find connect with Karachi\nFor slums I would rather watch gangs of wasseypur - atleast that had the masala<br/><br/>This one is a flat soda- no fizz."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 18,
                "downVotes": 326
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006999/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}