{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xohdzltazcwzy476vxhmbsrxu42ab33amd34hoadcomqbdf4skydk2oy3v5mbyodvy7e5kk5lpq5xk7gweh7gonfga",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11085663",
              "author": {
                "username": {
                  "text": "deepesh-211-922003"
                },
                "userId": "ur57883892"
              },
              "summary": {
                "originalText": "We were truly not ready for this"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping spy thriller that blends intelligence, emotion, and scale. Though fictional, it draws inspiration from real terror attacks in India, giving the film a chilling sense of realism. The story follows a covert counter-terror operation set in the shadowy world of espionage, where strategy and moral ambiguity dominate.<br/><br/>The use of real-life footage and authentic recordings of terrorists and their handlers adds raw emotional weight. The casting is exceptional-every actor embodies their role. While Akshaye Khanna and Rakesh Bedi shine, Ranveer Singh delivers a career-best performance with a restrained, understated portrayal that contrasts sharply with his real-life persona.<br/><br/>Sashwat Sachdeva&#39;s music elevates every scene, with songs that enhance tension and impact. Despite its 3 hour 34 minute runtime, the film never drags, building to a powerful final act. As the title song says, we were truly not ready for this.<br/><br/>Layered, non-stereotypical villains add depth. Ultimately, Dhurandhar is a tribute to the &quot;unknown gunmen&quot; who sacrifice their souls and humanity to keep the nation safe."
                }
              },
              "authorRating": 9,
              "submissionDate": "2026-01-01",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11085663/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11048762",
              "author": {
                "username": {
                  "text": "lalmanisharma"
                },
                "userId": "ur115378631"
              },
              "summary": {
                "originalText": "Dhurandhar, an unstoppable roar."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an absolute powerhouse of a film that hooks you right from the start and keeps the tension building throughout. It&#39;s one of those uncommon movies that seamlessly blends intense action with genuine emotional depth.<br/><br/>The acting is what really drives it home-Ranveer Singh and Akshay Khanna has given a standout performance, capturing both raw power and quiet vulnerability in a way that&#39;s truly compelling. The visuals are stunning; the cinematography plays with light and darkness to build a raw, absorbing world that lingers in your mind well after the film ends. Paired with a gripping, atmospheric score, the whole technical side feels spot-on.<br/><br/>What elevates Dhurandhar is its sharp, well-crafted script. It steers clear of predictable tropes, delivering twists that surprise you while provoking real thought. This isn&#39;t just entertainment-it&#39;s a gripping cinematic ride that reminds you of the magic of theater experiences. Easily a solid 5/5 and worth all the buzz it&#39;s getting."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11048762/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010946",
              "author": {
                "username": {
                  "text": "kavyashrimal"
                },
                "userId": "ur179873693"
              },
              "summary": {
                "originalText": "Absolute Dhurandhar !"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Shocking people calling it propoganda movie is absolute banger and screenplay is just amazing ranveer carried his character well akshay khana was exceptional and most imp it was a raw SPY thriller most imp it was an actual spy movie not some glamorous movie . Second half was bit slow and end was just disappointing could not paid off the build up ."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010946/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010990",
              "author": {
                "username": {
                  "text": "akashm-01489"
                },
                "userId": "ur69817396"
              },
              "summary": {
                "originalText": "Brilliant, Fantastic, Excellent, Dhurandharly Amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Brilliant, Fantastic, Excellent, Dhurandharly Amazing.<br/><br/>Everyone from director to actors to cinematographer to action director to BGM director to Screenplay writer, Everybody deserves a big thanks to giving us this cinematic masterpiece.<br/><br/>You all are Dhurandar.<br/><br/>This movie can be a fiction but this shows true face of some people.<br/><br/>Akshay, Sanjay, Arjun and Ranveer every one is so so so amazing.<br/><br/>Just go and watch it as many times as you can."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010990/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036148",
              "author": {
                "username": {
                  "text": "ekanshupadhyay"
                },
                "userId": "ur78836888"
              },
              "summary": {
                "originalText": "One of the best movies in the last 15-20 years of bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Very nice movie and so engaging from the start to end and it keeps you on the edge of the seat. Must watch. Acting of everyone is so good especially akshaye khanna has done a great work and please oscar de do yaar usko he has eaten every actor and other actors are at their level best everyone is nice."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036148/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019916",
              "author": {
                "username": {
                  "text": "Ankita-1943"
                },
                "userId": "ur211639254"
              },
              "summary": {
                "originalText": "A must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar is insane.<br/><br/>3.5 hour with full of entertainment not a single minute of bordome.<br/><br/>Such an excellent multicasting movie\nRanveer Singh, Akshay Khanna, Sanjay Dutt, Arjun Rampal everyone did their best. A must watch movie for every Indian. Dont support the rumours. Go and book a hall ticket, otherwise u may regret."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019916/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007182",
              "author": {
                "username": {
                  "text": "Bhuvam-5"
                },
                "userId": "ur210716636"
              },
              "summary": {
                "originalText": "Every frame charged with passion, power, and performance"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Intense, immersive, and meticulously crafted, this film is a masterclass in balancing action, character, and story. Ranveer Singh commands attention with a performance full of emotional nuance and controlled intensity. The director&#39;s vision ensures that each scene serves a purpose, weaving tension, suspense, and drama seamlessly. Supporting actors bring authenticity to their roles, enriching the narrative fabric. Cinematography and production design create a vivid, immersive world, while the music punctuates emotional beats perfectly. The screenplay is layered, exploring politics, crime, and personal struggle with sophistication. Editing maintains a rhythm that sustains suspense, and the climax delivers both catharsis and reflection. This film is a bold, unforgettable journey that proves the power of intelligent, high-quality cinema."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007182/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015890",
              "author": {
                "username": {
                  "text": "tanmaysi"
                },
                "userId": "ur151887863"
              },
              "summary": {
                "originalText": "True story"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "New india with bold actions and planning.<br/><br/>As a viewer, Dhurandhar is a thrilling ride from beginning to end. Ranveer Singh absolutely steals the show with his intense and convincing performance, making you root for his character throughout. The action sequences are sharp, realistic, and keep your adrenaline pumping, while the supporting cast adds depth to the story.<br/><br/>The film keeps you engaged with its fast pace and suspenseful plot twists, making it hard to look away. Visually, it&#39;s stunning - the cinematography and production design make the world feel vivid and immersive. Fans of action-thrillers will particularly enjoy how the story balances drama, tension, and emotion.<br/><br/>Overall, as a viewer, it feels like a complete cinematic experience - exciting, gripping, and memorable. Many people would walk out feeling entertained and impressed by the performances and the energy of the film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015890/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11043756",
              "author": {
                "username": {
                  "text": "AJReelNotes"
                },
                "userId": "ur195207730"
              },
              "summary": {
                "originalText": "Unapologetic, Gripping, and Necessary"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watched Dhurandhar the second time.<br/><br/>I can&#39;t remember the last time I watched a film twice in a theatre, or the last time I wrote about a movie.<br/><br/>Its is a rare cinematic achievement. Despite its long runtime, it never loosens its grip. There isn&#39;t a single dull moment.<br/><br/>It offers a grounded look at how spies really work quietly, patiently, far from the spotlight. And it&#39;s completely unapologetic about fighting terrorism tooth and claw.<br/><br/>Aditya Dhar has balances realism, violence, romance, true events, subplots, &amp; nationalism with remarkable control. The BGM &amp; cinematography really elevates the movie. Then performances are exceptional, with Akshaye Khanna and Ranveer Singh as clear standouts."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11043756/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009930",
              "author": {
                "username": {
                  "text": "dhyansharma"
                },
                "userId": "ur116340931"
              },
              "summary": {
                "originalText": "A Bold, Uncompromising Triumph - Dhurhandar is a Rare Masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurhandar is one of those films that reminds you why cinema exists in the first place. It doesn&#39;t just tell a story - it pulls you into a world that is raw, unpredictable, emotionally charged, and brilliantly crafted. From the first frame to the last, the film maintains a level of intensity and artistic confidence that very few Indian films even attempt.<br/><br/>The direction is razor-sharp, the writing is layered and intelligent, and every character feels alive with purpose. The performances are nothing short of extraordinary - subtle when they need to be, explosive when the story demands it. The cinematography elevates the narrative, blending grit and elegance in a way that feels both grounded and mythic.<br/><br/>What truly sets Dhurhandar apart is its refusal to spoon-feed or simplify. It trusts the viewer. It challenges you. It rewards your attention with depth, symbolism, and emotional weight that lingers long after the credits roll.<br/><br/>For me, this is not just a great film - it&#39;s a benchmark. A shining example of what modern Indian storytelling can achieve when ambition meets craft.<br/><br/>Highly recommended. Easily one of the best films I&#39;ve seen in years."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009930/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013400",
              "author": {
                "username": {
                  "text": "DipteshM-9"
                },
                "userId": "ur211588966"
              },
              "summary": {
                "originalText": "mast watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watch it, bro. One of the best-directed and acted films in 2025 and in Indian cinema. Everyone is good, the story is well crafted, and lighting color correction is good too,I love this movie every one should support this because it&#39;s a good movie, not much negative points. Anyone stopping you means he or she must have Pakistan links."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013400/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013897",
              "author": {
                "username": {
                  "text": "sachinparjapati-73661"
                },
                "userId": "ur134141383"
              },
              "summary": {
                "originalText": "Breathtaking"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Unbelievable sequences and plots, loved the entire movie. The acting the dialogue everything was top notch except the movie duration. Akshay Khanna was phenomenal Ranveer was tremendous, there was a scene of 26/11 where he nailed that scene. Loved the movie and recommend it to watch. But the movie is not for children."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013897/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007321",
              "author": {
                "username": {
                  "text": "mohanlaad"
                },
                "userId": "ur135721197"
              },
              "summary": {
                "originalText": "Drama That Keeps You on the Edge"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene is carefully constructed to maximize tension, narrative complexity, and character development. Ranveer Singh anchors the story with a layered performance, seamlessly navigating moral ambiguity and high-stakes action. Sanjay Dutt brings gravitas and threat, dominating crucial sequences. Akshaye Khanna and R Madhavan add narrative depth, while Arjun Rampal&#39;s quiet menace keeps suspense taut. Sara Arjun&#39;s emotional scenes elevate the stakes, adding genuine human weight to the story. Aditya Dhar&#39;s direction orchestrates a perfect balance of action, strategy, and drama. Cinematography captures both the city&#39;s chaos and intimate character moments, while the soundtrack enhances suspense. The second half&#39;s twists and climactic action deliver both adrenaline and emotional resonance."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007321/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006753",
              "author": {
                "username": {
                  "text": "kaurjassi-04647"
                },
                "userId": "ur188342818"
              },
              "summary": {
                "originalText": "Ranveer and Team in Full Power"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film opens with a quiet tension that slowly transforms into a high-stakes, adrenaline-fueled narrative. Ranveer Singh dominates every frame, conveying his character&#39;s inner conflict with subtle expressions and explosive physicality in action sequences. Sanjay Dutt brings an imposing gravitas, effortlessly portraying authority and menace, while Akshaye Khanna and R Madhavan&#39;s performances add layers of intelligence, strategy, and subtle emotional resonance. Arjun Rampal&#39;s controlled menace keeps audiences on edge, and Sara Arjun&#39;s innocent, heartfelt portrayal provides a stark emotional counterpoint. Aditya Dhar&#39;s direction seamlessly balances complex plotting, suspense, and blockbuster action, with cinematography capturing both sprawling cityscapes and intimate moments. Each action sequence feels earned and realistic, with the background score amplifying tension without overpowering the story. The second half escalates into a breathtaking series of confrontations, blending moral dilemmas with high-octane thrills, leaving viewers emotionally and visually invested until the final frame."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006753/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011125",
              "author": {
                "username": {
                  "text": "ankushmunde"
                },
                "userId": "ur74493659"
              },
              "summary": {
                "originalText": "A Gritty, Visceral Spy Thriller. Worth Every Minute of the Runtime!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerful, uncompromising, and stylish spy thriller that works as both a large-scale patriotic drama and a deeply personal story of redemption. It&#39;s a bold cinematic effort that pays off, delivering a massive theatrical experience. Watch it for the action, the stunning direction, and the phenomenal acting masterclass from Ranveer Singh and Akshaye Khanna."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011125/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011507",
              "author": {
                "username": {
                  "text": "khushmitkakkar"
                },
                "userId": "ur121964077"
              },
              "summary": {
                "originalText": "Loved the vision!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Is text review justified to tell how good this movie was?<br/><br/>Absolutely no, this theatre experience was really unlike another any recent Indian I have watched, this had every effort to make movie experience to be good for the viewer and that was consistent with each aspect of movie.<br/><br/>Stood out aspects for me were:\nOne of the best production quality and how things were upto the mark to show the generosity behind each object present in the frame was phenomenal for Indian standards for this scale(chef kiss).<br/><br/>1st and 2nd both position goes to one and only Aditya Dhar, for his vision and bringing this to theatre, this movie feels a whole different from indian spy movies template and still feels fresh and applause worthy&lt;3.<br/><br/>Actors had done their best work, and this was good fortune for us to see them in a movie together of this calibre...\nFor me which deserves the praise from my viewers biased side is: the writing/screenplay and the structure of the movie, I really appreciate the movie which hook me with their conversations and with this surprise action scenes.<br/><br/>Silly nit picking:\nAnd how &amp; why main characters guns were not getting out of ammo at right time, if it was one time thing then I won&#39;t have mentioned.... But it happened multiple times.<br/><br/>The positive things were so eye catching and enjoying that I can&#39;t find much negative and amazed to the fullest.<br/><br/>Excited for sequel, which I think would be filled with twists as my personal guess is PAP leader would be secret Indian agent...(Let&#39;s see if I am completely wrong).<br/><br/>9.5/10."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011507/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021159",
              "author": {
                "username": {
                  "text": "webervishal"
                },
                "userId": "ur123654366"
              },
              "summary": {
                "originalText": "Dhurandhar : A Riveting Three and a Half Hour Epic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar has long shown a penchant for ambitious filmmaking, but with Dhurandhar he delivers something that feels both grand in scale and meticulously controlled. Clocking in at around three and a half hours, the film could easily have felt bloated or indulgent, but Dhar&#39;s confident direction and a taut screenplay ensure that not a minute drifts without purpose. This is a movie that wears its epic intentions proudly yet remains intimate in its emotional core.<br/><br/>The story revolves around a fraught period in contemporary India, where individual destinies collide with larger political and social forces. Dhar crafts a layered narrative that combines a politically charged central plot with quieter, more personal subplots. This duality is one of the film&#39;s greatest strengths: it gives the film the sweep of a socio-political thriller while anchoring it in human stakes. The pacing-remarkable for such a long runtime-allows characters and their relationships to breathe, developing arcs that pay off richly by the film&#39;s final act.<br/><br/>Performances across the board are uniformly excellent. The lead-commanding, nuanced, and always in control-carries the film&#39;s moral ambiguities with a rare mix of charisma and restraint. Supporting actors deliver standout moments that add texture and depth; comic relief is earned rather than tacked on, and emotional beats land because these characters feel lived-in. The ensemble works together like a finely tuned machine: every glance, every silence, contributes to the film&#39;s atmosphere.<br/><br/>Visually, Dhurandhar is a triumph. The cinematography is both painterly and precise, using long takes and carefully composed frames to build tension and underscore character psychology. Action sequences are choreographed with clarity-each punch, chase, and confrontation serves a narrative purpose rather than merely showcasing spectacle. Production design and costumes ground the film in a believable world, while the sound design amplifies suspense and keeps the viewer invested during quieter passages.<br/><br/>A major achievement here is the screenplay&#39;s refusal to simplify. Dhar and his writers avoid easy answers, embracing moral complexity. Themes of power, loyalty, and ideology are interrogated rather than preached, and the film trusts its audience to follow layered arguments and conflicting motivations. Dialogues are sharp, occasionally theatrical in moments of high stakes, yet often quiet and revealing in one-on-one scenes.<br/><br/>If the film has flaws, they are minor. A subplot or two could have been tightened, and some viewers might find the runtime demanding-there are stretches that require patience and careful attention. But for those willing to commit, the rewards are ample: an emotionally satisfying payoff, striking set pieces, and a closing sequence that lingers long after the credits roll.<br/><br/>Ultimately, Dhurandhar is a testament to what ambitious mainstream cinema can achieve. It&#39;s a film made with conviction, technical mastery, and a deep respect for character-driven storytelling. Aditya Dhar proves himself not just as an action director but as a filmmaker capable of handling complex themes and long-form narrative without losing grip. In a cinematic landscape where brevity often reigns, Dhurandhar is a bold, engrossing epic that keeps you riveted for its entire runtime. Highly recommended for viewers who appreciate layered storytelling, strong performances, and cinema that thinks as it thrills."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021159/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018128",
              "author": {
                "username": {
                  "text": "jishugiri"
                },
                "userId": "ur63310290"
              },
              "summary": {
                "originalText": "Awesome movie.."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It shows the dark reality of terrorism which is state sponsored by Pakistan. I appreciate the movie director for showing us the reality. Acting was superb and plot also based on true story. Those who oppose pakistani terrorism must watch. As an Indian I want more move like this should be promoted and shows everyone around the world."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018128/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010013",
              "author": {
                "username": {
                  "text": "RishabS-435"
                },
                "userId": "ur211525098"
              },
              "summary": {
                "originalText": "A real spy thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ever since Baby, no decent spy thriller had come out of Bollywood. It was just masala films where characters would be associated with some intelligence agencies. But i am so happy to have watched this. Dhurandar is gritty, real and actually feels like a spy thriller. Despite the runtime, its a well pace movie with great cinematography, acting, bgm."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010013/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021483",
              "author": {
                "username": {
                  "text": "KeshavJ-03"
                },
                "userId": "ur211653401"
              },
              "summary": {
                "originalText": "ADITYA DHAR HAS NAILED IT AGAIN!!!!!!!!!!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The best Spy movie I had ever watched all the actors were placed very well by Aditya Dhar and all the actors has done fabulous work I was amazed by the action sequences in the move and khanna sab ke dance moves ne instagram already hack kar liya hai loved it.the next part will blow up the box office I am dam sure."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021483/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11049072",
              "author": {
                "username": {
                  "text": "nipunvats-30976"
                },
                "userId": "ur132403192"
              },
              "summary": {
                "originalText": "Substance Over Stars: Why Dhurandhar is the Exception to the Rule"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "While I typically avoid mainstream Bollywood-where budgets often favor star salaries over substance-Dhurandhar stands as a striking exception. Despite its daunting 3.5-hour runtime, the pacing is relentless; every sequence feels essential to the soul of the film. The violence is undeniably visceral and heavy on gore, yet it never feels gratuitous; instead, it is a narrative-driven necessity that underscores the stakes of the story.<br/><br/>What truly distinguishes the film is its political maturity. While it exercises creative freedom to offer subtle critiques of specific Indian political dynamics, it successfully avoids the &quot;propaganda&quot; label by grounding itself in universal truths about power. Rather than fueling cross-border animosity, the script exposes a grim reality: how those in power manufacture external threats to distract the public from internal failures.<br/><br/>Refreshingly empathetic, the film refuses to lean on tired anti-Muslim tropes and even sheds light on the often-ignored plight of the Baloch people. Ultimately, Dhurandhar is a sobering look at the cost of conflict, illustrating how the masses pay the price of blind loyalty while the elite reap the rewards."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11049072/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007159",
              "author": {
                "username": {
                  "text": "kohlir-28317"
                },
                "userId": "ur115076126"
              },
              "summary": {
                "originalText": "Thrills, Stars, and Big Screen Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative&#39;s slow-burn pacing ensures that tension, stakes, and character development all escalate organically. Ranveer Singh gives a masterful performance, embodying a character torn between morality, duty, and survival, while Sanjay Dutt adds immense gravitas and a menacing presence. Akshaye Khanna and R Madhavan provide subtle, layered performances, complementing the lead with intelligence and nuance. Arjun Rampal&#39;s quiet menace enhances suspense, and Sara Arjun&#39;s emotionally charged scenes provide a poignant human counterbalance. Aditya Dhar&#39;s direction blends suspense, strategic plotting, and action sequences seamlessly. Cinematography captures the underworld&#39;s chaotic beauty and intimate human moments alike, while the score punctuates tension and emotion. By the climax, the film delivers an adrenaline-charged and emotionally satisfying finale."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007159/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026455",
              "author": {
                "username": {
                  "text": "rudrashekhar-75416"
                },
                "userId": "ur168419026"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is a 100% theatre-must-watch experience - the kind of film you shouldn&#39;t wait to stream on OTT. The scale, visuals, sound design, and immersive atmosphere are meant for the big screen, where every moment hits harder and feels more impactful. Watching it in a theatre elevates the experience in a way that home viewing simply can&#39;t match."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026455/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015867",
              "author": {
                "username": {
                  "text": "VakitiD-9"
                },
                "userId": "ur208207346"
              },
              "summary": {
                "originalText": "Just awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A movie can&#39;t be more beautiful than this ,and I never watched Ranveer Singh movie before,my god what an actor he is hatsof,I like how the director has shown the reality ,every indian must watch, to know the reality and how these terrorists operates,and everything they shown is absolut reality.its worth every penny go and watch it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015867/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016636",
              "author": {
                "username": {
                  "text": "PriyanshuM-124"
                },
                "userId": "ur211611841"
              },
              "summary": {
                "originalText": "Best Movie for reality seeking view of pakistan"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best Movie for reality seeking view of pakistan. They give the real view of pakistan. A true hindustani should watch it and encourage the directors, producers, cast to make these kind of movies which shows the duplicit behaviour of pakistan and their officials. These kind of movies shows reality to everybody."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016636/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}