{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4uohdzsqyxdo6ib7cxhzmzqrlum4aj33qntz6pqcwb32u3anas2wcs4oertbk2idaivxle7dvymmpqcpefhtda",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11003788",
              "author": {
                "username": {
                  "text": "ambhatt-78208"
                },
                "userId": "ur97783704"
              },
              "summary": {
                "originalText": "Spy action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If you want to watch an Indian spy thriller action, watch this. Don&#39;t tell me Pathan, Tiger, etc. Belong to this genre. This movie is truly best movie in every aspect and in my opinion, the first in spy category in Indian cinema. From dialogue delivery, to setup, to creation of specific moments and also the buildup to important sequences with historical significance are blended in so perfectly that at some point it has to be called art of story-telling."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003788/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007394",
              "author": {
                "username": {
                  "text": "Abir_Kanjilal"
                },
                "userId": "ur95607877"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Outstanding movie with great performance, everyone with there A Game , director done fantastic job with the details, bring the authenticity and realism in the screen great direction to , chapter wise screenplay give same vibe as the uri the surgical strike which elevate the whole movie for me, and lasty the music Shashwat Sachdev outstanding works blends the different genre of music which was excellent 👍👍<br/><br/>As a viewer Akshay Khanna was show stellar MVP of the movie have the most aura farming\nTill his last scene 🤗 blessed to watch him doing his craft."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007394/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006203",
              "author": {
                "username": {
                  "text": "samarth_guddadar"
                },
                "userId": "ur95007171"
              },
              "summary": {
                "originalText": "An absolute treat of a watch!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is just perfect. It hits all the right feelings of an individual. And there are certain parts in the movie where they hit you like a truck. Ranveer Singh is at his peak in this movie. Man just no words.<br/><br/>Akshaye Khanna ate and left no crumbs! Quite literally.<br/><br/>R Madhavan is camouflaged in his role executing it perfectly.<br/><br/>Arjun Rampal makes you hate him through your gut. And that shows how good of an actor he is.<br/><br/>Sanjay at his usual best.<br/><br/>And Sara Arjun to add a nice young girl&#39;s childishness to this peak testosterone casting.<br/><br/>Aditya Dhar just never fails to amaze us Indians at this point. Just no words to describe how good this movie is. I wish this was a paid promotion but unfortunately it isn&#39;t. If you&#39;re an Indian and a nationalist (hard to find ppl with this combination these days), this movie is definitely for you. Please go WATCH IT."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006203/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006777",
              "author": {
                "username": {
                  "text": "adityadashad"
                },
                "userId": "ur188346763"
              },
              "summary": {
                "originalText": "A Star-Powered Drama That Delivers Impact"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A masterclass in slow-building tension, this film demonstrates how patience and narrative intelligence can heighten cinematic impact. The protagonist, played with nuanced restraint, navigates a labyrinth of crime and politics, making every choice feel weighty. Action scenes are intense but carefully interwoven with character development, ensuring spectacle never overshadows substance. The director orchestrates multiple threads seamlessly, while the cinematography frames chaos and calm with equal artistry. Minor characters shine with authentic motivations, enriching the story. Editing maintains momentum despite a long runtime, and the music subtly amplifies each emotional and suspenseful moment, creating a gripping, immersive experience."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006777/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006603",
              "author": {
                "username": {
                  "text": "drudranarayan-57283"
                },
                "userId": "ur190977670"
              },
              "summary": {
                "originalText": "A High-Energy Drama You Can't Miss"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening sequence, the film establishes a mood that is tense, contemplative, and unpredictable. Ranveer Singh anchors the story, portraying a complex character whose decisions ripple across the narrative. Dhar&#39;s direction demonstrates an exceptional command of tone, allowing quieter moments of reflection to coexist with explosive confrontations. Action scenes are precise, impactful, and integral to the story, never feeling gratuitous. The cinematography captures both the grandeur and grit of the setting, while the editing maintains suspense across its considerable runtime. Supporting cast members contribute gravitas, ensuring that every subplot has weight and relevance. The film&#39;s layered storytelling and attention to detail make it a remarkable cinematic experience."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006603/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007305",
              "author": {
                "username": {
                  "text": "patilvikrant-15728"
                },
                "userId": "ur123095750"
              },
              "summary": {
                "originalText": "Star-Studded Magic with Thrills and Heart"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is meticulous, gradually revealing a world where power, loyalty, and betrayal collide. Ranveer Singh&#39;s performance is layered, portraying a man forced to reconcile duty with conscience. Sanjay Dutt&#39;s commanding presence lends credibility and tension to critical scenes. Akshaye Khanna and R Madhavan create suspense through subtle gestures and measured dialogue, while Arjun Rampal&#39;s menace is quietly terrifying, haunting multiple sequences. Sara Arjun brings emotional weight that grounds the story in humanity. Aditya Dhar&#39;s direction orchestrates every scene with precision, ensuring that pacing, tension, and action sequences are perfectly balanced. Cinematography captures expansive urban settings and intimate moments alike, with framing that accentuates suspense. The music score heightens both tension and emotion, culminating in a finale that is thrilling, shocking, and deeply affecting."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007305/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006595",
              "author": {
                "username": {
                  "text": "mayankmk-37943"
                },
                "userId": "ur175095353"
              },
              "summary": {
                "originalText": "Fast Action with Powerful Storytelling"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene feels deliberate, each conversation weighted with meaning and consequence. Ranveer Singh&#39;s performance commands attention, effortlessly transitioning between calm calculation and explosive intensity. Dhar&#39;s direction excels in marrying narrative depth with kinetic energy, especially in the high-stakes action sequences. The production design and cinematography transport viewers into a meticulously constructed underworld, while the background score reinforces the emotional beats without overwhelming them. Supporting actors provide nuance, elevating even small roles into memorable moments. The film&#39;s political subtext and realistic portrayal of crime make the story immersive, thought-provoking, and emotionally charged."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006595/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006758",
              "author": {
                "username": {
                  "text": "amitqq-06986"
                },
                "userId": "ur188245379"
              },
              "summary": {
                "originalText": "Big Stars and Bigger Emotions on Screen"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses viewers in a tense and compelling narrative, where danger lurks behind every corner. Ranveer Singh is magnetic, his performance combining charisma, intensity, and moral complexity in a way that anchors the entire story. Director Dhar demonstrates masterful control over tone and pacing, balancing explosive action with quiet, suspenseful moments. The screenplay carefully develops each character, making even minor roles feel consequential. Fight sequences are gritty, believable, and integrated naturally into the story. Cinematography and lighting choices heighten both drama and realism, while the score enhances suspense without intrusion. The editing ensures that tension remains tight throughout, particularly in sequences that blend political intrigue with personal stakes. The climactic sequences deliver both emotional satisfaction and adrenaline, cementing the film as a powerful example of high-quality, intelligent cinema."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006758/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006478",
              "author": {
                "username": {
                  "text": "swara-70994"
                },
                "userId": "ur188401692"
              },
              "summary": {
                "originalText": "A Perfect Blend of Heart and High Intensity"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening shot, the film commands attention with precise pacing and escalating tension. The lead delivers a powerhouse performance, balancing moral complexity with physical prowess in intense sequences. Action scenes are not only thrilling but narratively significant, revealing character and advancing the plot. Supporting cast members provide nuanced performances, enriching the story world. Cinematography highlights both intimate moments and large-scale spectacle. The score complements every twist and turn, enhancing suspense and emotional depth. Political and underworld threads are woven seamlessly, giving the story realism and stakes. The conclusion is both exhilarating and emotionally impactful, making the experience unforgettable."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 23
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006478/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007248",
              "author": {
                "username": {
                  "text": "jenivadas"
                },
                "userId": "ur115062539"
              },
              "summary": {
                "originalText": "Ranveer Singh in Full Action Mode"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s slow-building tension creates an immersive, high-stakes experience where every character&#39;s decision carries consequences. Ranveer Singh navigates the complexities of his role with remarkable skill, balancing vulnerability, moral conflict, and intense physicality. Sanjay Dutt&#39;s presence is magnetic, portraying authority and menace that dominate the screen. Akshaye Khanna and R Madhavan provide subtle yet effective support, enriching the narrative with intelligence and depth. Arjun Rampal&#39;s quiet menace adds to the film&#39;s suspenseful undercurrent, and Sara Arjun&#39;s emotionally nuanced performance heightens the stakes. Aditya Dhar directs with precision, crafting action sequences that are not only visually impressive but also narratively meaningful. Cinematography captures the sprawling chaos of urban landscapes while maintaining focus on intimate emotional moments. The score enhances both suspense and pathos. The second half delivers escalating tension and action, culminating in a finale that is both shocking and emotionally satisfying."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007248/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006690",
              "author": {
                "username": {
                  "text": "sc-16940"
                },
                "userId": "ur171047733"
              },
              "summary": {
                "originalText": "A Blockbuster Storm of Drama and Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the first frame to the last, the film is a carefully constructed narrative that balances tension, emotion, and spectacle. Ranveer Singh delivers a compelling performance that is intense, layered, and emotionally resonant. The supporting cast adds texture and depth, ensuring that even smaller roles leave a lasting impression. Director Dhar orchestrates a story that is as much about human conflict as it is about high-stakes action, creating a cohesive and immersive cinematic experience. Action sequences are meticulously choreographed, thrilling yet meaningful, while cinematography captures the drama and scope of the world with precision. Editing ensures momentum and clarity throughout, while the score enhances tension and emotional beats seamlessly. The film&#39;s exploration of morality, strategy, and loyalty leaves a lasting intellectual and emotional impact."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006690/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007813",
              "author": {
                "username": {
                  "text": "ingleshekhar"
                },
                "userId": "ur90879255"
              },
              "summary": {
                "originalText": "GOAT akshay khanna"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is story is based on spy universe in india. Lot&#39;s of character give much energy to their character. Arjun rampal, raveer, r. Madhavan.<br/><br/>I much recommend if you want to see something new and thrilled go and watch akshay khanna and arun sir performance.<br/><br/>You never regret to watch. It is worth it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007813/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007270",
              "author": {
                "username": {
                  "text": "guptaakansha-43618"
                },
                "userId": "ur123097279"
              },
              "summary": {
                "originalText": "Action That Excites, Drama That Moves"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film is a masterclass in tension, storytelling, and performance. Ranveer Singh anchors the story with a complex, emotionally rich performance, conveying a protagonist torn between morality, survival, and ambition. Sanjay Dutt commands authority in every scene, while Akshaye Khanna and R Madhavan provide subtle yet impactful support. Arjun Rampal&#39;s quiet menace intensifies suspense, and Sara Arjun&#39;s vulnerable portrayal heightens emotional stakes. Aditya Dhar&#39;s direction meticulously balances pacing, action, and suspense, ensuring that every scene advances the narrative while maintaining tension. Cinematography captures both sweeping chaos and intimate moments, and the musical score elevates suspense and emotion. The finale delivers an unforgettable combination of adrenaline, strategy, and emotional catharsis."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007270/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006715",
              "author": {
                "username": {
                  "text": "bhavnahu"
                },
                "userId": "ur179210636"
              },
              "summary": {
                "originalText": "Action That Speaks Louder Than Words"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Audiences are immediately immersed in a story that deftly balances personal drama with high-stakes political intrigue. Ranveer Singh&#39;s performance anchors the film, his portrayal of a conflicted yet determined protagonist giving the narrative its emotional core. The director&#39;s vision shines through in the deliberate framing, use of tension, and attention to detail in both action choreography and character development. Supporting roles are compelling, with each actor bringing a unique energy that reinforces the film&#39;s multifaceted world. The editing ensures momentum remains high throughout, seamlessly transitioning between tense dialogue scenes and adrenaline-charged sequences. The cinematography captures both the chaos of urban conflict and the stillness of personal introspection. The narrative steadily escalates toward a finale that is both explosive and emotionally resonant, proving the film&#39;s ability to combine spectacle with substance."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006715/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006457",
              "author": {
                "username": {
                  "text": "navazishrazput"
                },
                "userId": "ur197686393"
              },
              "summary": {
                "originalText": "A Rollercoaster Of Emotions & Adventure"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The director of Dhurandhar deserves accolades for orchestrating a film that is visually stunning, narratively intricate, and emotionally powerful. The lead actor shines with a multi-dimensional portrayal, balancing stoicism with subtle vulnerability. Supporting actors bring authenticity to their roles, making the complex storyline easy to follow and deeply engaging. Every scene reflects the director&#39;s thoughtful vision, from high-octane action to quieter, character-driven moments. It&#39;s rare to see such cohesion between direction and performance, and Dhurandhar delivers it flawlessly, keeping audiences hooked from start to finish."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006457/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007257",
              "author": {
                "username": {
                  "text": "jmayuri-49739"
                },
                "userId": "ur128495053"
              },
              "summary": {
                "originalText": "A Thrilling Journey of Action and Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film combines intricate plotting, high-stakes action, and deeply human storytelling. Ranveer Singh anchors the narrative with a layered performance that conveys both vulnerability and resolve, while Sanjay Dutt&#39;s commanding presence elevates the tension. Akshaye Khanna and R Madhavan enrich the narrative with subtle intelligence, and Arjun Rampal&#39;s understated menace keeps viewers on edge. Sara Arjun&#39;s emotional scenes highlight the consequences of the narrative&#39;s high stakes. Aditya Dhar directs with precision, balancing slow-building suspense with high-octane action. Cinematography captures sprawling cityscapes, intimate interior moments, and intense confrontations, while the score enhances every beat. By the climax, the film delivers a thrilling, emotionally satisfying experience."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007257/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006580",
              "author": {
                "username": {
                  "text": "souravkumar-84297"
                },
                "userId": "ur174432562"
              },
              "summary": {
                "originalText": "Stars Deliver Their Absolute Best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ranveer Singh delivers a performance that feels both vulnerable and commanding, drawing the audience into the morally complex world his character inhabits. The direction by Dhar is meticulous, crafting every scene with a blend of tension and visual poetry. Action sequences are intense yet grounded, enhancing the stakes without overshadowing the character-driven drama. The cinematography captures Karachi&#39;s underbelly in haunting detail, while the music subtly heightens the emotional resonance. Supporting actors add depth, ensuring that even minor characters leave a lasting impression. The film&#39;s pacing balances slow-burn tension with explosive moments, making every revelation impactful and earned."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006580/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028697",
              "author": {
                "username": {
                  "text": "RatedByGautham"
                },
                "userId": "ur178163552"
              },
              "summary": {
                "originalText": "\"A Lengthy Spy Drama That Works Well Enough\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a 3-hour 30-minute spy thriller, but the long duration does not feel tiring. Director Adithya Dhar keeps the narration engaging, and the screenplay moves at a steady pace. The story is divided into nine chapters, and he handles them in a raw and convincing way. Because of the scale of the main plot, this long runtime actually feels necessary.<br/><br/>The movie ends by setting up a second part, and the story definitely has enough potential for a sequel - though the writing will need to be sharper in the next film.<br/><br/>The background score and songs are energetic and add a strong pulse to the film. The production quality is impressive, especially since a major part of the story is set in Pakistan. Ranveer Singh does well with his physical transformation and voice modulation. Akshaye Khanna and R. Madhavan deliver excellent performances. Sanjay Dutt and Arjun Rampal are decent in their roles. However, Sara Arjun feels miscast as the heroine.<br/><br/>Overall, Dhurandhar is not a brilliant spy movie, but it is still a enjoyable watch. Even with its long runtime, the film never becomes exhausting and keeps the audience engaged till the end."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 6
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028697/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013444",
              "author": {
                "username": {
                  "text": "NikhilA-875"
                },
                "userId": "ur211538339"
              },
              "summary": {
                "originalText": "Dhurandhar is not worth watching in theatres."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a one time watch movie but not in theatres. It feels slow at some parts. I liked the songs especially the Ishq Jalakar and the title track when I listened them in audio form but the way these songs are presented in the movie is not good. It could be better. Also integration of background music to the screenplay felt offbeat. The movie tries, very enthusiatically, to justify some moves of the current central government, so yes it is politically biased, a mild BJP propaganda you can say."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 3,
                "downVotes": 13
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013444/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006723",
              "author": {
                "username": {
                  "text": "kohlitanu-92005"
                },
                "userId": "ur181062339"
              },
              "summary": {
                "originalText": "A Thrilling Star-Studded Ride"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story unfolds like a tightly wound clock, each character movement deliberate and meaningful. Ranveer Singh is captivating in scenes that alternate between cerebral strategy and explosive physicality; his performance in the rooftop confrontation against rival factions demonstrates both precision and emotional depth. Sanjay Dutt&#39;s presence dominates boardroom sequences and street confrontations alike, commanding attention with every word and gesture. Akshaye Khanna and R Madhavan imbue even brief dialogues with intelligence and gravitas, while Arjun Rampal&#39;s silent menace creates constant tension, making viewers anticipate his every move. Sara Arjun&#39;s nuanced expressions in tense family sequences provide emotional clarity and contrast. Aditya Dhar&#39;s direction balances multi-threaded storytelling with action choreography that feels grounded yet exhilarating. Cinematography and lighting distinguish chaos from quiet reflection, and the soundtrack highlights every suspenseful beat. By the finale, the film masterfully combines intellectual strategy, high-octane action, and emotional intensity, creating an unforgettable cinematic experience."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006723/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006734",
              "author": {
                "username": {
                  "text": "abhijitkumar-32238"
                },
                "userId": "ur196195866"
              },
              "summary": {
                "originalText": "A Big Screen Rush of Thrills and Heart"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is pure gold for anyone who loves cinema. The actors of Dhurandhar did such a great job-you can feel their emotions and connect with them instantly. The director crafted the story beautifully, balancing action, drama, and emotional moments. Supporting characters were written well and performed brilliantly. The action scenes were thrilling, and the emotional moments were heartfelt. Every scene is meaningful, and the story keeps you engaged throughout. It&#39;s one of those films that makes you appreciate good direction and acting."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006734/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006882",
              "author": {
                "username": {
                  "text": "bhupatiofficial"
                },
                "userId": "ur190974446"
              },
              "summary": {
                "originalText": "A Gripping Tale with Relentless Thrills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is both intelligent and emotionally charged, weaving together layers of crime, politics, and personal conflict. Ranveer Singh&#39;s portrayal is multi-dimensional, showing strength, vulnerability, and moral ambiguity. Action sequences are not only thrilling but narratively significant, reflecting character choices and escalating tension. The director ensures that every scene-whether a quiet conversation or a chaotic confrontation-advances the plot and deepens engagement. Supporting actors shine, each adding authenticity to the world. Cinematography captures the stark realism of the cityscape and the intimate emotional beats with equal care. Music and sound design heighten suspense without overpowering the narrative, culminating in a finale that&#39;s both shocking and satisfying."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006882/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006711",
              "author": {
                "username": {
                  "text": "amitabhak-69301"
                },
                "userId": "ur188245528"
              },
              "summary": {
                "originalText": "Stars Deliver Big in This Explosive Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling here is methodical yet relentless, pulling viewers into a tightly wound world of power, betrayal, and survival. Ranveer Singh commands the screen with a performance that is both physically demanding and emotionally resonant, showcasing remarkable range. Director Dhar&#39;s craftsmanship is evident in the layering of suspense, with each scene building towards inevitable confrontations. The action is visceral, grounded, and strategically executed, emphasizing realism over spectacle. Supporting actors bring depth, particularly in morally gray roles that enrich the story. Cinematography highlights both the grandeur and grit of the environment, while the soundscape adds texture to every confrontation. The editing maintains a careful rhythm that balances tension and reflection. The climax delivers emotional payoff alongside intense action, leaving viewers both exhilarated and contemplative. This is cinema that respects intelligence, patience, and the craft of storytelling."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006711/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006854",
              "author": {
                "username": {
                  "text": "dineshkapoor-39178"
                },
                "userId": "ur142459561"
              },
              "summary": {
                "originalText": "A Rollercoaster of Drama and Thrills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the tense opening sequence to the adrenaline-charged finale, the film balances heart-stopping action with nuanced character arcs. Ranveer Singh&#39;s transformation throughout the story is subtle yet profound, carrying moral dilemmas and raw emotions with mastery. The director&#39;s eye for detail ensures that even minor plot points resonate later, adding layers to the narrative. The editing keeps a precise rhythm, allowing each moment of suspense and revelation to land perfectly. Supporting actors, especially those portraying underworld figures, bring authentic menace and unpredictability. The combination of realistic set design, tight scripting, and an evocative score makes the story feel both grounded and cinematic."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006854/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006771",
              "author": {
                "username": {
                  "text": "avdigitalkumar"
                },
                "userId": "ur190977827"
              },
              "summary": {
                "originalText": "Scenes That Spark Emotion and Excitement"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the very first frame, the film pulls you into a world where danger and strategy are inseparable. Ranveer Singh delivers a powerhouse performance, embodying the moral complexity of his character with subtlety and intensity. The director&#39;s meticulous attention to detail ensures that every set piece and dialogue feels purposeful. Action sequences are choreographed with precision, blending tension and realism. Supporting actors bring depth, making every encounter feel consequential. The score heightens suspense without overwhelming the narrative, and the cinematography captures both the sprawling cityscape and intimate emotional beats. By the climax, the stakes feel immense, leaving the audience exhilarated and contemplative."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006771/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}