{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4u6jdzsqyxdo6ia76whtmryrlt42azz3qmd577kato6qebgnesk2dkzoyyf7jchmodmrlglwttcq7hrf7jzz3ihma",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11002857",
              "author": {
                "username": {
                  "text": "khakharvishal"
                },
                "userId": "ur128488370"
              },
              "summary": {
                "originalText": "Worth the hype!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I bet you can&#39;t roll off your eyes from the screen while watching it, every character, every moment, every chapter crafted so well... Absolute cinema 🙌🏻\nThe Akshaye khanna-Ranveer singh duo killed it... And Arjun rampal single handedly making us hate his character. And R. Madhvan with his mind and patience🔥 a must watch after a long time."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002857/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001717",
              "author": {
                "username": {
                  "text": "param-19737"
                },
                "userId": "ur136393464"
              },
              "summary": {
                "originalText": "Incridable movie after a long time (1st day 1st show.)"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie would turnout to be the biggest hit of this year.<br/><br/>Starting from first seen till the end of the movie, it grab me to my seat.<br/><br/>I have no words to explain the performance of Ranveer,Akshay Khana both did realistic top notch performance. Ajit dowal character played by Madhavan is little under shadow. I was expecting him as a biggest star in this saga. Movie started with kandhaar high jeck seen and madvan role could be more to take the movie to next level. But overall I must say you won&#39;t regret of spending time in theatre for this movie.<br/><br/>Guys come out of your home and watch it don&#39;t wait for ott. I have all ott subscription but can&#39;t hold myself to watch it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001717/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011284",
              "author": {
                "username": {
                  "text": "hrishikeshsant"
                },
                "userId": "ur132318791"
              },
              "summary": {
                "originalText": "Great"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great. Movie must watch. Fantastic star cast and fantastic cinematography. Reality shown after a long time. Fantastic acting and also fantastic story line. Must watch and how pakistan operates. Every Indian should watch it. Great movie great movie. Ganwar shown and how lyari isnthe hub shown which is great."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011284/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008338",
              "author": {
                "username": {
                  "text": "sudhanshums"
                },
                "userId": "ur24735763"
              },
              "summary": {
                "originalText": "Dhurandhar - A Cinematic Triumph Bollywood Truly Needed"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a refreshing jolt of quality cinema that Bollywood has been craving for a long time. The film impresses right from the opening frame with its stunningly realistic locations and vibrant, alive atmosphere. The colour grading and cinematography are of top-tier quality, often giving the film a grand, Hollywood-like visual language. The immersive camera angles make you feel as if you&#39;re standing right inside the story.<br/><br/>The screenplay is tightly woven, and the direction is sharp, ensuring that not a single moment feels dull. When it comes to performances, Akshaye Khanna steals the show effortlessly-his screen presence is magnetic. Ranveer Singh delivers yet another brilliant performance, while R. Madhavan portrays his role with remarkable precision and maturity. The dialogues are strong, memorable, and elevate several scenes to another level.<br/><br/>In a time when Bollywood is struggling with identity and originality, Dhurandhar stands tall as a reminder of what true storytelling looks like. This is the kind of film that can revive the industry&#39;s spirit and mark the end of the unnecessary remake culture."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008338/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006680",
              "author": {
                "username": {
                  "text": "sikhamehra"
                },
                "userId": "ur196233627"
              },
              "summary": {
                "originalText": "Action That Shakes the Screen"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tension mounts steadily, blending psychological intrigue with high-impact action. The lead performance is nuanced and captivating, conveying moral conflict and courage authentically. Action sequences are carefully staged, intense, and narratively justified. Cinematography captures both intimate moments and large-scale chaos with equal finesse. Supporting cast performances are memorable, adding depth to the narrative. The screenplay builds suspense deliberately, rewarding audience attention with a thrilling climax. The result is a film that combines intellect, adrenaline, and emotion, leaving a lasting cinematic impression."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006680/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008013",
              "author": {
                "username": {
                  "text": "singhprabhat36"
                },
                "userId": "ur47291928"
              },
              "summary": {
                "originalText": "Masterpiece from Aditya Dhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is a truly masterpiece from Aditya Dhar and his team. All the actors are superb but Akshay Khanna and Ranveer Singh stole the show. It&#39;s a must watch for all bollywood lovers.<br/><br/>I can&#39;t wait for the second part. I wish it didn&#39;t end even after 3.5 hrs. Definitely going to watch this again on Netflix."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008013/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002348",
              "author": {
                "username": {
                  "text": "juhikumari-23427"
                },
                "userId": "ur157452719"
              },
              "summary": {
                "originalText": "A bold, uncompromising spy thriller that delivers both substance and spectacle."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is the kind of spy thriller that grabs you from the very first scene and refuses to let go. It&#39;s intense, atmospheric, and built with a level of ambition that instantly sets it apart from most films in the genre.<br/><br/>At the heart of the story is Hamza, played by Ranveer Singh, who delivers one of the most powerful performances of his career. As a young recruit pushed into a perilous mission deep inside Karachi&#39;s crime-infested underworld, Ranveer brings a fierce physicality and emotional weight to the role. His eyes, his stillness, his bursts of controlled aggression-everything comes together to create a character who feels both dangerous and deeply human. Even without dialogue, he communicates the turmoil of a man trying to stay alive while walking the razor&#39;s edge between duty and survival.<br/><br/>The supporting cast is equally compelling.<br/><br/>Akshay Khanna is magnetic as Rehman Dakait-calm, sharp, and unsettlingly unpredictable. He doesn&#39;t need theatrics; every glance and pause carries a quiet threat.<br/><br/>Sanjay Dutt adds gravity with his seasoned presence, grounding the story with maturity and raw strength.<br/><br/>Arjun Rampal brings an enigmatic, steady intensity that keeps you guessing until the end.<br/><br/>Together, they form a constellation of performances that elevate the film far beyond a conventional action thriller.<br/><br/>The world-building is one of Dhurandhar&#39;s biggest triumphs. The longer runtime actually works in its favour, allowing the narrative to slowly reveal the tangled web of crime, politics, and terror the characters are navigating. When the second half explodes into high-voltage action and emotional stakes, the buildup feels completely earned.<br/><br/>On the technical front, Vikash Nowlakha&#39;s cinematography paints Lyari&#39;s gritty lanes with immersive realism, while Shashwat Sachdev&#39;s pulsating background score never lets the tension drop. The action sequences are raw, ruthless, and refreshingly grounded, no unnecessary flash, just pure impact.<br/><br/>Dhurandhar is a rare blend of strong performances, tight direction, and gripping atmosphere. It&#39;s intense without being messy, emotional without being melodramatic, and stylish without losing authenticity.<br/><br/>If you love gritty espionage dramas with powerhouse performances, Dhurandhar is absolutely worth a big-screen watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002348/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006744",
              "author": {
                "username": {
                  "text": "nitinkumar-94040"
                },
                "userId": "ur196527148"
              },
              "summary": {
                "originalText": "Emotions, Thrills, and Big Screen Magic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film blends strategic storytelling with high-intensity action. Ranveer Singh portrays a morally conflicted character with depth, while Sanjay Dutt adds gravitas and menace. Akshaye Khanna and R Madhavan enrich the ensemble, and Arjun Rampal and Sara Arjun provide emotional weight. Aditya Dhar&#39;s direction ensures suspense escalates naturally, with action sequences that are thrilling and meaningful. Cinematography and score enhance tension and immersion, creating a gripping narrative. By the second half, stakes rise dramatically, delivering both emotional and adrenaline-fueled satisfaction."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006744/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006394",
              "author": {
                "username": {
                  "text": "arohipatil-08895"
                },
                "userId": "ur188334702"
              },
              "summary": {
                "originalText": "A Pulse-Pounding Journey with a Mega Cast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every storyline twist in this film is carefully planted, rewarding attentive viewers with layered revelations. The protagonist&#39;s performance is commanding, showing both raw physicality and subtle emotional intelligence. Action sequences are designed to feel tense and consequential, with choreography that complements the narrative rather than overshadowing it. Dialogue and interactions reveal complex motivations, making relationships feel authentic and dynamic. Cinematography captures both the grandeur of set pieces and the intimate moments of character development. The sound design amplifies suspense without ever overwhelming the scene. Supporting cast members elevate the story, adding nuance and unpredictability. The interplay between crime, politics, and personal stakes creates a gripping backdrop, while the finale delivers a powerful, cathartic resolution that lingers long after viewing."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006394/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033835",
              "author": {
                "username": {
                  "text": "sainbuxdev"
                },
                "userId": "ur211746005"
              },
              "summary": {
                "originalText": "A Loud, Hollow Spy Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar mistakes noise for narrative. Despite its star cast and claims of being inspired by real events, the film lacks the research, depth, and authenticity required for a credible espionage thriller. Instead of intelligent storytelling, it relies on thunderous background music, over-stylized action, exaggerated heroics, and forced patriotic cues that feel more manipulative than meaningful.<br/><br/>The script loosely borrows from real incidents, distorts them for drama, and labels the result as &quot;patriotic,&quot; though nothing in its treatment genuinely reflects true patriotism. The marketing further misleads-promoted as an Indian patriotic saga, the film largely revolves around a shallow political portrayal, creating a clear disconnect between promise and content."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 10,
                "downVotes": 92
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033835/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013482",
              "author": {
                "username": {
                  "text": "vickyltit"
                },
                "userId": "ur97714373"
              },
              "summary": {
                "originalText": "Super Dhurandhar Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Awesome directions and not hero centric. Instead this shows the actual work of agent (probably).<br/><br/>What a great background score and actings.<br/><br/>This part made sure to set ground for each character and then narrate the story.<br/><br/>Best part is how this movie runs with the timeline of tragic events of that time."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013482/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011056",
              "author": {
                "username": {
                  "text": "shivanshusharma-44555"
                },
                "userId": "ur150773112"
              },
              "summary": {
                "originalText": "marvelous"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping, 10/10 spy thriller that feels inspired by true events and unfolds against the backdrop of gang wars and terror networks, yet never loses sight of its human core. The storyline has enough meat to keep you engaged throughout, the writing is brilliant, and every character is crafted with nuance and detail while the sincere, steadily building screenplay keeps growing on you with every passing scene.<br/><br/>Ranveer Singh is a true chameleon and he disappears into his role here, while Akshaye Khanna, Sanjay Dutt, Arjun Rampal, R. Madhavan, Sara Arjun, Manav Gohil and the rest of the ensemble ensure there is not a single weak link in the cast. Aditya Dhar delivers a film that feels so real and authentic that you genuinely feel like you&#39;re on the streets with these characters, and the way he blends real-life style footage and grounded sound design into the narrative results in several absolutely spine-chilling moments, including a key sequence where the screen turns red and you hear haunting recorded voices during an attack."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011056/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002026",
              "author": {
                "username": {
                  "text": "Priyam-730"
                },
                "userId": "ur211517266"
              },
              "summary": {
                "originalText": "Fantabulous"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; is a gripping, power-packed film that blends emotion, intensity, and compelling storytelling. The performances are exceptionally strong, especially the lead&#39;s commanding presence. Its sharp direction, impactful music, and engaging twists keep you hooked throughout. A bold, entertaining, and applause-worthy movie that celebrates courage and resilience while delivering a memorable cinematic experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002026/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007999",
              "author": {
                "username": {
                  "text": "hauntedstripclubmusicbyabel"
                },
                "userId": "ur211553514"
              },
              "summary": {
                "originalText": "a film that punched me straight in the chest"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar honestly shook me. It wasn&#39;t just inspired by 26/11, it went way deeper. The way they used real footage, real audio, real news clips hit so hard. I actually felt sick at moments because it reminded me how ruthless those terrorists were and how many innocent people suffered. The movie didn&#39;t sugarcoat anything. It showed how even boys and young people weren&#39;t safe, how fear spreads, and how a whole city can bleed because of a few monsters. That rage came back while watching it.<br/><br/>Ranveer singh was fire like always, my forever fav. But akshaye khanna and arjun rampal had this calm, sharp intensity that made every scene feel personal. The way they acted, the way the story moved felt heavy, tense and real. I swear it was 3 hours but i didn&#39;t get bored for even one second. Every minute mattered.<br/><br/>The politics, the investigation, the emotional weight blended perfectly. It felt like a reminder of how cruel terrorism can be and how strong people have to be to fight back. I walked out angry, emotional, proud, shaken all at once. This movie isn&#39;t just entertainment, it&#39;s a reality check. And bro, i seriously can&#39;t wait for part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007999/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002530",
              "author": {
                "username": {
                  "text": "royneilabhi"
                },
                "userId": "ur121948333"
              },
              "summary": {
                "originalText": "An amazing showcase"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie was great to watch. The highlight of the movie is Akshay&#39;s performance. After a long time his work stood out amongst all A listers in the movie.<br/><br/>A humongous shoutout to the background score and music. The beats was very apt.<br/><br/>The move did try its best to showcase what happened in India till 2008 and how the Dhurandhar operation came to existence and why it was essential.<br/><br/>A big shout out to Athe director. He has tried a lot of different things which was seen only in Hollywood movies. The whole dialogues being shows on text during the movie, along with the recording of real clips.<br/><br/>Overall a must watch experience especially in theatres\nA must watch. Can&#39;t wait for the next part in March."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002530/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006476",
              "author": {
                "username": {
                  "text": "ranjit-51300"
                },
                "userId": "ur177213019"
              },
              "summary": {
                "originalText": "Unforgettable Faces, Unbeatable Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A masterclass in tension-building, the movie slowly draws you into its meticulously crafted world. The lead&#39;s performance is magnetic, conveying vulnerability and ruthless determination in equal measure. Dhar&#39;s direction orchestrates action sequences that feel raw and immediate, while quieter scenes explore deep human conflict. The supporting cast delivers authentic, nuanced portrayals, making even minor interactions memorable. Cinematography and editing blend seamlessly, giving the film a cinematic texture that is both immersive and unforgettable."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006476/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003431",
              "author": {
                "username": {
                  "text": "swarnimshrm-73337"
                },
                "userId": "ur126061241"
              },
              "summary": {
                "originalText": "Great movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Rarely i review a movie , but this one is great , enjoyed it , ranveer acting was top notch , akshay khanna as always good , sanjay dut was was dull but even dull sanjay is powerful .<br/><br/>It keeps you on edge and makes you anticipate a lot , it must be one of the best spy thriller this year , must watch ."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003431/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036008",
              "author": {
                "username": {
                  "text": "sachin_rautela"
                },
                "userId": "ur116121867"
              },
              "summary": {
                "originalText": "\"Ghayal hoon, Isliye Ghatak hoon.\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Usually, I don&#39;t write movie reviews, but this time I felt compelled to share my thoughts.<br/><br/>First of all, can we please appreciate and bow down to Aditya Dhar and his team for creating such an exceptional film. Honestly, I have never seen a movie like this in Hindi cinema before, and I truly believe this will mark a new era for the action-thriller genre in Bollywood.<br/><br/>Dhurandhar is perfect in every aspect - characters, story, narration, depiction, and direction. Everything is executed flawlessly.<br/><br/>This is the kind of movie people have been desperately waiting for and expecting from Bollywood.<br/><br/>Every actor delivered their best performance - Ranbir Singh, Arjun Rampal, Sanjay Dutt, and especially Akshaye Khanna, who was absolutely commendable. Each character added depth and intensity to the film.<br/><br/>I&#39;ve also seen people comparing this movie to other spy films or Animal. Please don&#39;t lower this movie&#39;s value by comparing it to others. Dhurandhar stands on its own.<br/><br/>The best part of the movie is that there is no unnecessary negativity, no nudity, no sexual exploitation, and no forced love angle - just pure cinema.<br/><br/>And in the end, one line that defines the soul of this film:<br/><br/>&quot;Ghayal hoon, Isliye Ghatak hoon.&quot;"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036008/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006408",
              "author": {
                "username": {
                  "text": "ishaan-84263"
                },
                "userId": "ur188347058"
              },
              "summary": {
                "originalText": "Unforgettable Drama Backed by Massive Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative unfolds like a tightrope, balancing high-octane action with deep psychological tension. The lead&#39;s performance is magnetic, conveying internal conflict while commanding physical presence in intense sequences. Action scenes are exhilarating, precise, and grounded in realism, elevating the story rather than distracting from it. Supporting characters are fully fleshed out, adding complexity and unpredictability. Cinematic framing is both grandiose and intimate, capturing every heartbeat of suspense. The score subtly underscores emotion, complementing rather than overwhelming the visuals. Every scene contributes to the rising tension, culminating in a finale that is both satisfying and emotionally charged. The film is a masterclass in pacing, character development, and adrenaline-fueled storytelling."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006408/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007663",
              "author": {
                "username": {
                  "text": "yashjaiswal-87704"
                },
                "userId": "ur109426113"
              },
              "summary": {
                "originalText": "Well balanced mix of realism and fantasy"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the very few indian movies that prioritise realism at the expense of downplaying he protagonist.<br/><br/>The supporting cast outshines the main character, just as the creators intended to.<br/><br/>Although there is a little bit of personal bias sprinkled in, which at times, feels a little cringe. But the amount of it is forgivable, considering everything else that bollywood throws out.<br/><br/>Nice sountrack too. Modern &amp; at times, making you wonder why you&#39;re vibing with the bad guys.<br/><br/>If you&#39;re wondering what to watch next, this should be it. It&#39;ll cater to both, your inner action lover and patriot."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007663/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008561",
              "author": {
                "username": {
                  "text": "dhruvs-77579"
                },
                "userId": "ur159591630"
              },
              "summary": {
                "originalText": "Perfection"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar has proven to be one of the most reliable and impressive services I&#39;ve used in a long time. From the moment I reached out, the experience felt smooth, thoughtful and very well organized. Every interaction showed a level of care and attention that you rarely see anymore. It&#39;s clear that the team behind Dhurandhar takes pride in their work and understands what customers actually need.<br/><br/>What stood out right away was the consistency. Nothing felt rushed, and every detail seemed to be handled with intention. Whether it was communication, timing, or the quality of the final output, everything lined up exactly the way it should. There&#39;s something reassuring about working with people who not only know what they&#39;re doing but also genuinely want to deliver their best every single time."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008561/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011195",
              "author": {
                "username": {
                  "text": "milindtokarkar"
                },
                "userId": "ur150830807"
              },
              "summary": {
                "originalText": "Excellent spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an engaging and entertaining film that successfully blends strong storytelling with impressive performances. The film keeps the audience hooked throughout with its well-paced narration, impactful dialogues, and emotionally driven moments. The lead actors have delivered powerful performances that bring their characters to life, and the direction is commendable for maintaining a fine balance between drama and excitement. The music and cinematography further enhance the overall experience, making Dhurandhar a memorable watch. A highly recommended film for those who appreciate meaningful cinema with a compelling message!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011195/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044453",
              "author": {
                "username": {
                  "text": "bijoyds20"
                },
                "userId": "ur58750727"
              },
              "summary": {
                "originalText": "Dhamakedaar Dhuadaar Dhurandar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "2 baar dekh chuka hoon.. Jab Netflix pe aayega phirse dekhunga... cant wait for its Second installment Dhurandar- The Revenge.<br/><br/>Akshaye Khanna sabse Dumdaar, Phir Ranvir Singh aur Sanjay Dutt kaamal ka performance..\nThis movie will make 1000+ cr. Easily and its second installment will also make another 1000+cr for sure."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044453/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007953",
              "author": {
                "username": {
                  "text": "AshutoshK-784"
                },
                "userId": "ur211553499"
              },
              "summary": {
                "originalText": "Keeping aside the debate on politics, as a pure cinema, this is excellent"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "10/10 story/script\n10/10 acting\n10/10 world building.<br/><br/>Aditya dhar is on his way to become the new go to director for action movies on the topic of indian security ops. No one has doubts on ranveer singh as an actor. Akshaye khanna and sanjay dutt are highlights as supporting characters. Great soundtrack and narration as well."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007953/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002612",
              "author": {
                "username": {
                  "text": "CinemaAnshumanBhanja"
                },
                "userId": "ur162417079"
              },
              "summary": {
                "originalText": "Ranveer singh rises"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "BGM ohhh I just love the fresh approach. Action packed engaging screenplay with excellent acting. I hope Indian audience will justify Ranveer&#39;s talent.<br/><br/>Akshay khana again takes the front seat alongside Ranveer. Actions sequences are well crafted and perfectly executed, I have experienced few never seen before shots.<br/><br/>Long live Bollywood.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002612/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}