{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xobbbltazcwzy472vx3njqrht4oar23mpt37heaxdomqbdf4skydkyomzfrmryodzl6canvu243sm3mwcmf2sgcdva",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11002442",
              "author": {
                "username": {
                  "text": "RonakA-19"
                },
                "userId": "ur204113138"
              },
              "summary": {
                "originalText": "Absolute cinema."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The characters have such depth to their story. It feels as if you were there yourself to experience these events. The amazing acting by the cast keeps you hooked to the movie despite the length of the movie. Personally Akshaye Khanna gave a mind blowing performance. All credits to Ranveer singh and other actors as well. Since its a true story, whatever they have shown was portrayed in a great way. The cinematography, the background music, the dialogues and expressions were absolutely fantastic. Can&#39;t wait for the next part!"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002442/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017831",
              "author": {
                "username": {
                  "text": "sajalk-013"
                },
                "userId": "ur211622558"
              },
              "summary": {
                "originalText": "True spy"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The performance of the characters are great.<br/><br/>All the action scenes feel convincing.<br/><br/>I respect the dicition of making this film for adults. Although true violence is not for minors.<br/><br/>The realistic feel in action scenes are very rare to find these days in bollywood movies.<br/><br/>That&#39;s why this diserves to cross 400 cr and above of this collection."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017831/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006748",
              "author": {
                "username": {
                  "text": "RuhiJ-1"
                },
                "userId": "ur203912573"
              },
              "summary": {
                "originalText": "A Captivating Journey Filled with Thrills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tension and nuance define this cinematic journey, drawing the audience into a meticulously crafted world of crime and strategy. Ranveer Singh&#39;s performance is layered, reflecting internal conflict and steely resolve with subtle yet striking precision. Director Dhar orchestrates a sophisticated narrative where political intrigue, personal stakes, and explosive action converge seamlessly. Fight sequences are dynamic and grounded, avoiding over-the-top exaggeration while maintaining thrill. The supporting cast enriches the story with believable, multidimensional portrayals. Cinematography captures both stark realism and cinematic grandeur, while the sound design underscores every twist and turn. Pacing is deliberate yet compelling, building suspense and emotional resonance in tandem. By the climax, the story delivers both tension-filled action and heartfelt resolution, cementing the film&#39;s reputation as intelligent, brave, and unforgettable."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006748/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006799",
              "author": {
                "username": {
                  "text": "Suhaib21"
                },
                "userId": "ur198244138"
              },
              "summary": {
                "originalText": "Power, Passion & Pure Blockbuster Force"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening sequence, the film establishes a meticulous, high-stakes world. Ranveer Singh anchors the narrative with an intense, nuanced performance, seamlessly portraying his character&#39;s inner conflict. Sanjay Dutt brings commanding authority and a dangerous edge, while Akshaye Khanna and R Madhavan provide intelligent, restrained performances that add narrative weight. Arjun Rampal&#39;s quiet menace enhances tension, and Sara Arjun&#39;s poignant performance gives emotional grounding. Aditya Dhar directs with a keen sense of pacing, balancing slow-building tension with explosive action sequences. Cinematography captures both chaos and intimate moments, and the score underscores suspense throughout. By the climax, the story delivers maximum emotional and narrative impact."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006799/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013624",
              "author": {
                "username": {
                  "text": "kayaar-99367"
                },
                "userId": "ur126043239"
              },
              "summary": {
                "originalText": "Inglorious B***tards"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar is a genius #Dhurandhar\nHats off for pulling an Inglorious Bastards ultra pro max on the fountainhead of terror\nYou&#39;ve created a #SpyVerse\nLove the mashup of characters woven around real events. Pulsating screenplay, taut storytelling, great soundtrack and thriling action !!<br/><br/>Im back to cinemas for #Dhurandhar\nNewly minted Akshaye Khanna fanboi."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013624/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015256",
              "author": {
                "username": {
                  "text": "abouttono"
                },
                "userId": "ur125520290"
              },
              "summary": {
                "originalText": "Bang on, Actions packed, deep rooted history of Pakistan mafia and illegal weapons market."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar plays less like a single &quot;true story&quot; and more like a classified dossier dramatized-a convergence of Kandahar, Parliament, 26/11, Lyari, and unnamed black ops, compressed into one ferocious, morally queasy thriller. It is this dense interweaving of real operations, leaked anecdotes, and speculative reconstruction that gives the film its unusual heft; the violence shocks, but it is the nagging awareness that so much of this has, in some form, already happened that lingers long after the end credits."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015256/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010000",
              "author": {
                "username": {
                  "text": "Sayan-41"
                },
                "userId": "ur203823420"
              },
              "summary": {
                "originalText": "Dhurandhar Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a total winner. The story is tight, the pacing is perfect, and every scene keeps you hooked. The lead and supporting cast deliver fantastic performances, and the direction, cinematography, and background score lift the film even higher. It&#39;s smart, stylish, and super entertaining from start to finish."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010000/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010939",
              "author": {
                "username": {
                  "text": "rikenpatels"
                },
                "userId": "ur123291693"
              },
              "summary": {
                "originalText": "Fantastic movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "All actors have done good job. All incidents are shown as they were happened. Great direction by Aditya Dhar and Akshaye khanna is supeeeeeeerb in his character. Best ever film with a power pack starcast. Movie is based on true incidents. Please go and watch in your nearby theaters as soon as you can for a remindful experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010939/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020323",
              "author": {
                "username": {
                  "text": "AyushD-690"
                },
                "userId": "ur211643960"
              },
              "summary": {
                "originalText": "Backstage with Real Heroes of Republic India!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie has just created a base and paved a way for other directors to create more such movies to make Indians as well as others to know about the reality of the failed state pakistan which is just standing on the carcass of million innocent people by funding terrorism in India and abroad!!!!<br/><br/>Eye opening movies!!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020323/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011388",
              "author": {
                "username": {
                  "text": "shrinivaspande"
                },
                "userId": "ur123154081"
              },
              "summary": {
                "originalText": "Patriotic as always Aditya Dhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands out as one of the most grounded and emotionally stirring patriotic films in recent years. Director Aditya Dhar, known for his ability to blend intensity with authenticity, delivers a cinematic experience that feels both larger-than-life and deeply rooted in India&#39;s socio-political realities. This film doesn&#39;t rely on exaggerated heroism or over-the-top nationalism; instead, it brings forward a narrative that feels raw, relevant, and honest.<br/><br/>The storytelling is gripping from the first frame. Dhar masterfully weaves together personal sacrifice, national duty, and the complexities of real-world conflicts. The film&#39;s greatest strength lies in its refusal to glorify war or paint characters in black and white. Instead, it showcases the challenges, dilemmas, and emotional turmoil faced by individuals who carry the responsibility of protecting the nation. This nuanced portrayal elevates Dhurandhar from a typical patriotic drama to a genuinely thought-provoking cinematic statement.<br/><br/>Visually, the movie is stunning without being flashy. The production design, cinematography, and background score work in harmony to create an atmosphere that is tense yet heartfelt. Performances across the cast are powerful and controlled, adding depth to the film&#39;s realism. Each character feels believable, and their journeys resonate long after the movie ends.<br/><br/>What truly sets the film apart is its reflection of ground realities-be it geopolitical tensions, internal systems, or the emotional fabric of those connected to national service. Dhar&#39;s direction ensures that the film inspires patriotism not through theatrics but through truth.<br/><br/>In a world where patriotic cinema often falls into predictability, Dhurandhar dares to stay honest. Full credit and heartfelt congratulations to Aditya Dhar for creating a film that is not only patriotic but also profoundly human."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011388/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008900",
              "author": {
                "username": {
                  "text": "rajatrajrastogi"
                },
                "userId": "ur118579462"
              },
              "summary": {
                "originalText": "Superb!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "1. Akshaye Khanna&#39;s Intensity: Absolute show-stealer! Karachi mafia boss ke roop mein chilling presence, har dialogue goosebumps deta hai. Veteran acting at its finest.<br/><br/>2. Gripping Screenplay &amp; Twists: Aditya Dhar ne true events se inspired plot ko masterfully build kiya second half ke surprises aur action sequences mind-blowing. No loose ends, pure tension!<br/><br/>3. World-Building &amp; Authenticity: Pakistan ke underworld ko gritty aur real dikhaya Lyari alleys, cultural nuances, sab spot-on. Cinematography aur BGM (Shashwat Sachdev) suspense ko height badha dete hain.<br/><br/>4. Technical Brilliance- High-octane action (fights aur chases) Hollywood level ke, VFX seamless. Runtime lamba lagta hai lekin payoff epic hai spy genre ka new benchmark.<br/><br/>5. Emotional Core- Sirf action nahi, family loyalty aur sacrifice ke themes touch karte hain. Supporting cast (Sanjay Dutt, Arjun Rampal) solid backup dete hain.<br/><br/>6. Cons briefly: First half slow build-up, dialogues thode dramatic. Overall, must-watch for thriller fans. Indian cinema ka proud moment!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008900/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031990",
              "author": {
                "username": {
                  "text": "themakwanamayur"
                },
                "userId": "ur121262494"
              },
              "summary": {
                "originalText": "Blasting Performace of Indian Dhurandhars"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just watched Dhurandhar and wow, what a ride! I&#39;m still buzzing from this movie. The story was so engaging, I was hooked from the very beginning. The actors really brought their A-game, delivering performances that were both powerful and believable. I especially loved the way they handled the emotional arcs; it felt so genuine. And the cinematography? Absolutely stunning! Every shot was a work of art. The music also perfectly complemented the mood and added so much depth. It&#39;s definitely one of those films that stays with you long after the credits roll. I&#39;d highly recommend checking out Dhurandhar, you won&#39;t be disappointed!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031990/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013052",
              "author": {
                "username": {
                  "text": "vibrantlycreates"
                },
                "userId": "ur187755779"
              },
              "summary": {
                "originalText": "Amazing Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurndhar is a must-watch action movie that keeps you hooked with its fast pace and intense fight scenes. The action choreography is impressive, making each sequence thrilling and realistic. Strong characters and a gripping story add depth to the movie, balancing excitement with emotion. If you enjoy well-made action films, Dhurndhar is definitely worth watching once for an adrenaline-filled experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013052/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019013",
              "author": {
                "username": {
                  "text": "Nishant-699"
                },
                "userId": "ur211632355"
              },
              "summary": {
                "originalText": "This is how you make a long film feel absolutely gripping!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "3 hours 30 minutes and not a single moment feels dull. In fact, the entire film is so enjoyable and immersive that you barely notice the runtime 👌🏻\nThe 7 chapters are structured brilliantly, with stellar performances from Akshay Khanna, Ranveer, and Rakesh Bedi sir.<br/><br/>The screenplay stays super engaging throughout, supported by a gripping BGM that elevates every scene. Truly a well-crafted experience.<br/><br/>Already waiting eagerly for Part 2 ✌🏻"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019013/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006871",
              "author": {
                "username": {
                  "text": "DineshP-22"
                },
                "userId": "ur203859809"
              },
              "summary": {
                "originalText": "A Spectacular Mix of Emotion and Adrenaline"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses you in a world where every choice has consequences. Ranveer Singh&#39;s portrayal of a conflicted operative is magnetic, blending intelligence with raw emotion. Sanjay Dutt commands the screen with authority and menace, while Akshaye Khanna and R Madhavan provide subtle but impactful performances. Arjun Rampal&#39;s quiet intensity adds tension, and Sara Arjun&#39;s innocence heightens the stakes. Aditya Dhar&#39;s direction seamlessly balances explosive action with layered storytelling, and the cinematography captures the underworld&#39;s chaos beautifully. The score punctuates every scene, making even quiet moments feel suspenseful. The second half elevates tension and emotion, culminating in a climax that is both thrilling and resonant."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006871/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014502",
              "author": {
                "username": {
                  "text": "palsomjyoti"
                },
                "userId": "ur151027349"
              },
              "summary": {
                "originalText": "Best spy movie of the year"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is strictly for adults due to the heavy violence, murder, gore, and strong language. It is a raw spy thriller that serves as a tribute to the officers of our Intelligence Bureau. Significantly, the film contains no propaganda and does not fuel any Hindu-Muslim divide.<br/><br/>It focuses on India, depicting how Pakistan targets our country and our spies, and the brutal reality of what happens when our agents are captured. It also portrays how the government of that time handled these crises.<br/><br/>The music, acting, VFX, CGI, cinematography, storytelling, and action scenes are all fantastic. There is no unrealistic or unnecessary fighting. Even though the runtime is three and a half hours, it won&#39;t bore you for a second. You won&#39;t realize how the time flies because the film keeps you thoroughly engaged."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014502/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011881",
              "author": {
                "username": {
                  "text": "PriyaC-07"
                },
                "userId": "ur211579490"
              },
              "summary": {
                "originalText": "kya movie thi yaaarrr"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie was so good i want to watch again and again, aditya dhar ate bhaii. The cast, music, evrything was good. After watching this my respect for Ajith doval sir raised, ranveer was good as main lead also akshaye khanna?? This man was meant to play negative role, acting so good I started hating him."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011881/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013594",
              "author": {
                "username": {
                  "text": "TheCinemato"
                },
                "userId": "ur166037154"
              },
              "summary": {
                "originalText": "A twisted tale of terrific characters!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "8.4/10<br/><br/>I just watched &quot;Dhurandhar&#39; which is a star studded espionage thriller! I was most excited for the different characters and the chemistry between them, and I must say they didn&#39;t disappoint!<br/><br/>The plot mainly revolves around the gangs operating in Lyari Town and we see it from the perspective of a newcomer, which is played by Ranveer Singh. The movie mainly covers the vast web of underworld, mafia and the politics involved in it, during it&#39;s runtime. The story does seem to pace off in some parts but it eventually pays off and does not bore you!<br/><br/>The first half is designed to introduce and establish the characters and the second half is a massive payback! Once the characters are established, the second half does not waste time and elevates the tension between them. The cast is really good and everyone played their role well! Except Aslam Choudhary played by Sanjuy Dutt, all other characters are written well! Akshaye Khanna is a class apart, and so is Ranveer Singh!<br/><br/>The music is really good, especially the title track which gets you grooving! The action is brutal and decent, it is illogical at times but does not become the weak link of the movie as it is very limited. The movie is filled with profanity and people might find that sensitive and uncomfortable to watch with their family. Some people might find the pacing of the movie slow and leave it midway, but if you wait till the end, the movie does give a huge payback!<br/><br/>Out of majority of the movies produced in India, &#39;Dhurandhar&#39; stands out and sets a new milestone for others to follow. No stylish entries, no cringey dialogues, just pure espionage crime drama!<br/><br/>So all in all, &#39;Dhurandhar&#39; is a great movie with diverse range of characters and a direct relation to real life events! So people who enjoy crime thrillers and espionage movies must try this one!"
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013594/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004800",
              "author": {
                "username": {
                  "text": "Kartik-687"
                },
                "userId": "ur211535412"
              },
              "summary": {
                "originalText": "⭐ Absolute Perfect Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar delivers a brilliant portrayal of history, with every scene crafted like a masterpiece. The music blends beautifully with the story, enriching each emotion and moment. It kept me completely hooked for the entire 3 hours and 30 minutes-not once did my attention drift. Every scene felt meaningful, the pacing gripping, and the performances flawless. It&#39;s rare for a film this long to stay engaging, but Dhurandar does it effortlessly.<br/><br/>A truly unforgettable film-highly recommended, an absolute must-watch!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004800/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11056057",
              "author": {
                "username": {
                  "text": "eliteny"
                },
                "userId": "ur163987762"
              },
              "summary": {
                "originalText": "Well narrated spy thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "An excellent movie to watch. A well narrated spy thriller based on 80% of real incidents. The rest 20% true or not we never gonna know as these are spy operations. Excellent acting of all characters and every role is shown without disrespecting their real persona whether they are a bad or good guy. Director is well know for his movie narration while keeping the message intact."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11056057/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024103",
              "author": {
                "username": {
                  "text": "rishavk-44894"
                },
                "userId": "ur156022678"
              },
              "summary": {
                "originalText": "An outstanding achievement!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Well for the starters, if you haven&#39;t seen the film yet, do me a favour and rush to the local cinema. What a triumph of filmmaking it is!<br/><br/>The cinematography is exquisite, the story is brilliantly told. It hides enough to entice you to wait for the sequal without making it feel as if the first film is only a stepping stone.<br/><br/>Screenplay suffers a little and 15 mins could have been easily cut. However, the best part about the film was background score. It elevates the film into a category of one. Wonderful! Wonderful! Wonderful!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024103/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006437",
              "author": {
                "username": {
                  "text": "wyfllpfg"
                },
                "userId": "ur176906763"
              },
              "summary": {
                "originalText": "Action That Strikes, Drama That Stays"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A relentless pace and intricate storytelling make the film impossible to ignore. Ranveer Singh commands the screen, portraying a man trapped between ambition and conscience with unerring conviction. Direction ensures that tension is maintained through strategic pacing and visual storytelling. Supporting actors provide texture and credibility, while action sequences are executed with technical finesse. The cinematography and score elevate the suspense, culminating in a finale that resonates both emotionally and visually."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006437/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11103001",
              "author": {
                "username": {
                  "text": "ercbagati"
                },
                "userId": "ur151046923"
              },
              "summary": {
                "originalText": "Awesome War Movie. Bollywood is changing."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Totally best movie of my life till date. Be it direction, screenplay, cinamatography, acting, art dirrection, music, everything it is full quality movie. Dying to watch it&#39;s second part. This movie is beyond ratings. Hope other film makers learn to make such movies especially bollywood. World is changing and same way bollywood is changing. How is the Josh !!!!!!! High Sir."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11103001/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006978",
              "author": {
                "username": {
                  "text": "rohitmehrarm-01588"
                },
                "userId": "ur192024893"
              },
              "summary": {
                "originalText": "Powerful Drama Woven with Intense Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene contributes to a narrative that is both intelligent and thrilling. Ranveer Singh excels at balancing physicality with emotional depth, while Sanjay Dutt lends a commanding presence that dominates the screen. Akshaye Khanna and R Madhavan bring sophistication to their roles, and Arjun Rampal&#39;s menace adds palpable tension. Sara Arjun&#39;s innocence enhances the story&#39;s emotional stakes. Aditya Dhar orchestrates a cinematic experience where every action sequence serves the story, and the editing ensures fluid pacing. Cinematography captures both urban landscapes and intimate moments, while the soundtrack elevates suspense and drama. The climax delivers emotional resonance and adrenaline in equal measure."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006978/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11033354",
              "author": {
                "username": {
                  "text": "harrylohia-31864"
                },
                "userId": "ur135987403"
              },
              "summary": {
                "originalText": "Genius"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The blend of rich content with massey elements, soo good. This is cinema. Despite being this long not once would you be looking at the watch for time. I am so excited for next release I wished it just came sooner. Everyone has been praising akshay khanna, truly all actors did well but one would appreciate the efforts behind the set and whole team behind it that made it come to life. It feels so real."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-17",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11033354/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}