{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4s6lbjsqyxdo6ia7ctxxmrvrxu4qazy2mpd37hjdpj3qflanes22ckzouze7w4r436xxyxbwma7qhz6kasry7et",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11007061",
              "author": {
                "username": {
                  "text": "AjitM-94"
                },
                "userId": "ur203911946"
              },
              "summary": {
                "originalText": "Stars Set the Screen Ablaze with Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s story gradually envelops the audience in suspense, moral complexity, and action. Ranveer Singh delivers a performance full of nuance and physicality, while Sanjay Dutt dominates scenes with commanding authority. Akshaye Khanna and R Madhavan bring layers to the ensemble, and Arjun Rampal creates subtle menace. Sara Arjun adds emotional weight that heightens tension. Aditya Dhar&#39;s direction ensures a balance between thrilling action and character development, with cinematography that captures both chaos and intimacy. The musical score enhances each moment, and the narrative&#39;s second half escalates to an impactful and satisfying climax."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007061/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007581",
              "author": {
                "username": {
                  "text": "ypravin-23540"
                },
                "userId": "ur154427270"
              },
              "summary": {
                "originalText": "Power-Packed Performances in Every Scene"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative unfolds with patience and intelligence, allowing every character arc to breathe while slowly tightening tension across the plot. Ranveer Singh excels in his portrayal, offering a layered performance that captures both vulnerability and resolve. The supporting actors contribute significant depth, making the political and criminal landscapes believable and textured. Action sequences are thrilling yet purposeful, crafted with attention to realism. Director Dhar&#39;s vision is evident in the careful composition of shots, the use of lighting and color to evoke mood, and the deliberate pacing that heightens suspense. The result is a cinematic journey that is intense, immersive, and unforgettable."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007581/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005238",
              "author": {
                "username": {
                  "text": "hyitsdp"
                },
                "userId": "ur126912415"
              },
              "summary": {
                "originalText": "Raw and mesmerising"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Raw action.....the movie throughout its length will hook you up to the edge of your seats. Ranveer Singh, Akshay Khanna impeccable performances. The movie takes its toll into the spy world as clean and more realistically that no other Hindi movie till date could ever do so. Operation Lyari is the main story plot of the movie."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005238/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012711",
              "author": {
                "username": {
                  "text": "akashpaul5"
                },
                "userId": "ur45778499"
              },
              "summary": {
                "originalText": "A Very Solid, Expansive Spy Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film is a triumph of world-building and character development. Spanning an impressive 3 hours and 32 minutes, Dhurandhar is a gripping spy thriller that justifies every minute of its runtime. The narrative never loses momentum, keeping the audience utterly engaged in the sprawling world it creates.<br/><br/>The war between the rival gangs felt incredibly natural and organic within the setting of Lyari. The screenplay ensures that every single character feels important and contributes meaningfully to the overall story. You can feel the meticulous thought that has gone into every frame.<br/><br/>The casting is truly exceptional and feels entirely natural across the board.<br/><br/>Akshay Khanna as Rehman Dakait completely steals the show. His performance is defined by a captivating aura and swagger that commands the screen.<br/><br/>Ranveer proves he is a true chameleon, doing complete justice to his demanding role as the spy at the centre of the conflict.<br/><br/>The one casting decision I was initially sceptical about, Sara Arjun, turned out to be a wonderful surprise. She looked like a dream and successfully injected the necessary innocence and freshness into the narrative.<br/><br/>While I am giving it 9 stars because I feel a few moments could have been slightly trimmed or polished, this is a minor critique. Overall, this is a masterful piece of cinema.<br/><br/>Man oh man, I am beyond excited for the second part coming next year!"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012711/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11055803",
              "author": {
                "username": {
                  "text": "avinashiitkgpbharat"
                },
                "userId": "ur118850287"
              },
              "summary": {
                "originalText": "Unapologetically Cult Setter movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Having watched Munich, Schindler&#39;s list - I always thought when would India make such a globally appealing movie showing the real story of India&#39;s global diplomacy. Dhurandhar is a new era movie that has set a marvel milestone for Cinema. Right from the trendsetter soundtrack, the engaging plot, the god level narration, and the alpha mode acting by the ensemble cast, Dhurandhar is a coup&#39;d&#39;etat. And surprisingly, despite being banned in the Islamic countries, Dhurandhar becomes a 1000 Cr+ madness at the global box office."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11055803/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11069301",
              "author": {
                "username": {
                  "text": "Azlahz"
                },
                "userId": "ur212016981"
              },
              "summary": {
                "originalText": "Aura."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Rehman Daikat aka Akhshay khanna is definitely the show stealer here. No matter what anyone says, I can point a thousand people who went to the theatres only for him and it&#39;s justified. Guy has so much charisma you fall in love with the Villan. Ranveer has done a great job, Dutt and rampal were fab! Script is not something entirely new but the way this entire move comes together with the songs and the scenes and the actors, despite the plot not being something you&#39;d typically fawn over with all of its te***ism. And due to especially the feels it gives you is what makes it Hard to Forget.<br/><br/>ABSOLUTELY LOVED EVERY SECOND.<br/><br/>Definitely booking tickets again. The running time feels so less once you experience it! Dont miss it in theatres!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11069301/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11041206",
              "author": {
                "username": {
                  "text": "drshweta-58482"
                },
                "userId": "ur195744919"
              },
              "summary": {
                "originalText": "Awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "People who are crying that movie is violet are same people who were praising animal and pushpa , and to their dismay this movie is 1000s time better than those two . Movie had story , romance but no cringe bed scene or lusty kissing unnecessarily....casting was way too apt . Acting was top notch ...never seen such great craft in decades in cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11041206/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007436",
              "author": {
                "username": {
                  "text": "kumardonabhishek"
                },
                "userId": "ur123682917"
              },
              "summary": {
                "originalText": "Honest and bold yet refreshing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Undoubtedly bollywood &#39;s best espionage thriller with being unapologetically close to reality...\nAll characters are well portrayed with excellent screenplay and direction...movie is little lengthy but no complaints considering it was needed for plot...\nAkshaye khanna and Ranveer singh are exceptionally good."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007436/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008725",
              "author": {
                "username": {
                  "text": "UshaB-39"
                },
                "userId": "ur211558399"
              },
              "summary": {
                "originalText": "Fantastic film. A must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great story, told really well. Great acting by one and all. Fabulous music. Gory, but necessarily so.<br/><br/>The editing and story telling was novel, interesting and thoughtful.<br/><br/>Ranveer being the star didn&#39;t hog the spotlight. Each and every actor got a chance to shine. There was humour to allow the audience some respite. Loved it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008725/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11061431",
              "author": {
                "username": {
                  "text": "igoyry"
                },
                "userId": "ur54715698"
              },
              "summary": {
                "originalText": "Hard slap to the Bollywood mafia"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a knockout answer to the cheap star praised Bollywood formula films. This movie proves what real cinema looks like when content comes first. Every actor delivers with full conviction. Akshay Khanna is outstanding, controlled, intense, and deeply convincing. Ranveer Singh brings raw energy and precision, never overdoing a single moment. Not one frame feels wasted. Scene sequencing is razor sharp, building tension naturally and holding it till the end. The storyline is fearless, grounded, and hits hard without spoon feeding. Compared to the so called spy universes and recycled narratives, Dhurandhar feels bold and honest. No noise, no gimmicks, just powerful storytelling. Bollywood producers and the mafia driven ecosystem should be nervous. This film raises the bar and changes the game completely."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11061431/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010550",
              "author": {
                "username": {
                  "text": "Chandu-23"
                },
                "userId": "ur211567015"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping action-drama that keeps you invested with its strong performances and sharp twists. The storytelling is bold, backed by solid visuals and impactful music. While a few scenes feel slightly stretched, the emotional depth and intense climax leave a lasting impact. Overall, Dhurandhar is a well-crafted entertainer that balances action, drama, and suspense effectively."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 7,
                "downVotes": 122
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010550/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015384",
              "author": {
                "username": {
                  "text": "ritiksharma-13992"
                },
                "userId": "ur150685413"
              },
              "summary": {
                "originalText": "Must watch in theatre"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "There are rarely a film delivered by bollywood which deserves theatre.. this one deserves IMAX. Because of its cinematography, screen play, acting, very good direction... backbone of film is all the bgm and songs you will never feel any song interrupting you in between.. this movies shows the hard-work of director how he managed to assemble all the pieces into 3.3 hr film keeping it realistic as well as interesting.. no nonsense no vulgarity no bikni.<br/><br/>This is okay to be seen with family as well..\nDon&#39;t miss to experience this in theater...\nTrust me i never felt its long film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015384/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013506",
              "author": {
                "username": {
                  "text": "SiddheshJ-88"
                },
                "userId": "ur211591008"
              },
              "summary": {
                "originalText": "Absolute Chaossss with a spicy magic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must-watch! With a gripping runtime of over 3 hours, this film delivers a masterclass in thrill and epic storytelling. To those calling it propaganda or anti-Pakistan - let&#39;s be clear: this is not anti-anyone, it&#39;s unapologetically *pro-India*. Every nation has the right to present its truth and protect its global image. Yes, we have our internal challenges - but that doesn&#39;t justify tarnishing our country on the world stage. If you live here, take pride in being a responsible citizen. Watch this film not just with your eyes, but with an open mind."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013506/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007064",
              "author": {
                "username": {
                  "text": "tripathivarsha"
                },
                "userId": "ur123190009"
              },
              "summary": {
                "originalText": "Thrills, Drama, and Star Chemistry"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film masterfully constructs a tense, morally complex world. Ranveer Singh delivers a mesmerizing performance, combining tactical intelligence, emotional subtlety, and physical courage. Sanjay Dutt&#39;s authority elevates critical scenes, while Akshaye Khanna and R Madhavan provide nuanced support. Arjun Rampal&#39;s quiet menace permeates pivotal sequences, and Sara Arjun&#39;s poignant moments provide emotional grounding. Aditya Dhar&#39;s direction balances strategy, suspense, and breathtaking action seamlessly. Cinematography captures sprawling cityscapes and intimate close-ups with equal precision. The score heightens tension and emotion, culminating in a finale that is both shocking and deeply satisfying."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007064/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11101447",
              "author": {
                "username": {
                  "text": "AnilaV-03"
                },
                "userId": "ur212232630"
              },
              "summary": {
                "originalText": "One of the best films in Recent times"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a near perfect Espionage Gangster Action Drama, never seen before. From the acting, direction,writing,costume,prosthetics,music,cinematography,action was top notch. Ranveer &amp; Akshaye stand out while others were also fab. Some moments are peak cinema stuff! Specially 26/11 scene!<br/><br/>The climax car sequence- Na de dil pardesi nu song juxtaposed with the Hamza &amp; Rehman car action, will be etched in my memory forever!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11101447/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010752",
              "author": {
                "username": {
                  "text": "akshats-011"
                },
                "userId": "ur211568791"
              },
              "summary": {
                "originalText": "thrilling"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Treat to watch a fantastic movie, good story building,music was very good in tempo mix of old songs with new music was done brilliantly to the perfection, characters have been given enough time and importance to build the story love story has not been dragged all in all a very nice experience watching the movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010752/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007266",
              "author": {
                "username": {
                  "text": "aakashshukla-10226"
                },
                "userId": "ur123097413"
              },
              "summary": {
                "originalText": "Action That Excites, Drama That Moves"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s narrative architecture is meticulous, balancing suspense, action, and character development. Ranveer Singh delivers a layered performance, embodying intelligence, moral conflict, and raw intensity. Sanjay Dutt dominates scenes with gravitas, while Akshaye Khanna and R Madhavan provide intelligent, subtle performances. Arjun Rampal&#39;s quiet menace heightens tension, and Sara Arjun&#39;s emotional portrayal provides humanity and stakes. Aditya Dhar&#39;s direction choreographs action and suspense seamlessly, allowing narrative, emotion, and spectacle to coexist. Cinematography captures urban chaos, intimate beats, and visceral action with precision, and the score punctuates suspense and emotion. The film&#39;s climax is thrilling, strategic, and emotionally resonant, leaving viewers fully immersed."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007266/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11068342",
              "author": {
                "username": {
                  "text": "leenad-0"
                },
                "userId": "ur212009766"
              },
              "summary": {
                "originalText": "Watch It. Feel It. Promote It. Dhurandhar Is Unmissable."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just a movie-it&#39;s an experience that grips you from the very first frame and refuses to let go till the very last second.<br/><br/>Every single actor delivers a power-packed, unforgettable performance, making each character feel intense, real, and deeply moving. There isn&#39;t a single dull moment-every scene builds tension and keeps you fully invested.<br/><br/>The story is nerve-wracking and unpredictable, making you bite your nails and sit on the edge of your chair throughout the film. The screenplay is razor-sharp, the pacing is relentless, and the twists hit hard when you least expect them.<br/><br/>A massive, heartfelt shout-out to Ranveer Singh as Hamza - this is not acting, this is absolute transformation.<br/><br/>He doesn&#39;t play Hamza; he becomes him. Every expression, every silence, every explosive moment is delivered with terrifying honesty and emotional depth. His screen presence is electrifying, and his performance elevates the entire film to another level. This is a career-defining, out-of-this-world performance and easily one of the finest acts ever seen in Indian cinema.<br/><br/>What truly elevates Dhurandhar is its emotional depth and fearless storytelling. The performances are raw, honest, and impactful-this is cinema at its finest.<br/><br/>If you&#39;re a true Indian, you won&#39;t just watch this movie-you&#39;ll feel proud of it.<br/><br/>You&#39;ll be inspired to take your friends, family, relatives, and everyone you know to watch it, and to spread positive word of mouth on social media. This is an international-level, world-class movie, and the whole world deserves to see the power of such brilliant storytelling.<br/><br/>Don&#39;t miss Dhurandhar. Watch it. Support it. Share it.<br/><br/>This is Indian cinema shining on the global stage. 🇮🇳🎬🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11068342/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014364",
              "author": {
                "username": {
                  "text": "kislaykumarprince"
                },
                "userId": "ur128381834"
              },
              "summary": {
                "originalText": "Fantastic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Perfect arc or story line of every charcter. Took time to build every character. Movie is long but still connected through out the movie. Real time issue has been showed. Struggle shown for Ranveer and never shown him overpowered. That is best part. Songs were too good. I am addicted to that. Well demonstrated geo political scenario."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014364/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029070",
              "author": {
                "username": {
                  "text": "Taaneekaa"
                },
                "userId": "ur68441972"
              },
              "summary": {
                "originalText": "No misogyny and I loved it"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched a Bollywood movie after many many years. This is how you make a thriller, action and male dominated Bollywood movie without misogyny, extra patriotism that&#39;s Jingoist and to have females just to degrade them. Animal movie makers and lovers, take note. Ranveer Singh shined by not shinning and akshay khanna&#39;s acting was a ghatak surprise in a good way. The lead actress was also really good actually great considering it was her first debut movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029070/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018058",
              "author": {
                "username": {
                  "text": "pvikramvikram"
                },
                "userId": "ur102071725"
              },
              "summary": {
                "originalText": "True to Story, Introduction Worthy Direction"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One line eview would be &quot;pathbreaking Concept and direction theat excels in every scene&quot;. This film stays true to story concept direction and removed unnecessary masala, chutiyapa that has been all through in Bollywood movies. This sets a fresh Example of how a Movie should be taken that doesn&#39;t manipulate names, story, situations and stardom."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018058/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007190",
              "author": {
                "username": {
                  "text": "rathorevishal-53378"
                },
                "userId": "ur118092857"
              },
              "summary": {
                "originalText": "A Story That Packs a Punch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film meticulously constructs a world of crime, politics, and human conflict, where trust is fragile and danger omnipresent. Ranveer Singh anchors the story with a performance that is simultaneously intelligent, intense, and emotionally resonant. Sanjay Dutt adds gravitas and an intimidating presence that commands attention. Akshaye Khanna and R Madhavan enrich the story with subtle performances that heighten the narrative&#39;s complexity. Arjun Rampal&#39;s quiet menace creates palpable tension, while Sara Arjun&#39;s scenes provide a poignant emotional counterpoint. Aditya Dhar&#39;s direction blends suspense, strategy, and high-octane action seamlessly. Cinematography captures both the chaotic scale of the setting and intimate character moments, while the score punctuates key beats of tension and drama. The second half escalates with shocking twists, breathtaking action, and emotional resonance, culminating in a finale that is both thrilling and satisfying."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007190/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011103",
              "author": {
                "username": {
                  "text": "roshpolekar"
                },
                "userId": "ur191947187"
              },
              "summary": {
                "originalText": "Not your typical 'RAW' thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the trailer I knew this is not typical spy movie where an agent goes into enemy territory, falls in love with a beautiful women, and fights off bad guys.<br/><br/>I went to this movie with zero expectations from Ranveer. I only wanted to enjoy good acting from some of my favourite old-school actors like Akshay Khanna, Sanjay Dutt, and R Madhavan.<br/><br/>Not only Ranveer took me by surpsise, the rest of the cast exceeded my expectations. I haven&#39;t seen sucha a perfect casting.<br/><br/>The story telling was amazing. It effortlessly invokes patriotism, sadness, anger, and conveys the emotion of a spy.<br/><br/>You could feel the emotion ranveer is feeling from his acting, which shows how much he has grown as an actor. I hope he matures too as a person after this movie. Love his goofy persona, but sometimes its kinda bit much.<br/><br/>This movie is not a documentary so I did not see it that way. But it takes you close to the reality like no other espionage bollywood movie. It will forever change how Indians see the spy movies and their expectations from it."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011103/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019856",
              "author": {
                "username": {
                  "text": "adityakhadse-66217"
                },
                "userId": "ur136022962"
              },
              "summary": {
                "originalText": "Best movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; is a solid, essential watch for fans of the spy and gangster genres. Its ambition, coupled with Dhar&#39;s firm direction and genuinely phenomenal acting from the ensemble cast-especially the breathtaking face-offs between Ranveer Singh and Akshaye Khanna-makes it a theatrical spectacle that is both arresting and deeply engaging. It&#39;s a film that leaves you eagerly anticipating the already-announced Part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019856/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004253",
              "author": {
                "username": {
                  "text": "SoumodeepB-0"
                },
                "userId": "ur207201505"
              },
              "summary": {
                "originalText": "Fantastic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar - Watched Today!<br/><br/>What a sensational cinematic experience!<br/><br/>Ranveer Singh absolutely steals the show - pure madness, pure brilliance!<br/><br/>Akshay Khanna delivers one of his best performances in recent years... intense and flawless.<br/><br/>Sanjay Dutt and Arjun Rampal are in top form, bringing grit and power to every frame.<br/><br/>R. Madhavan&#39;s role may be small, but it&#39;s incredibly impactful.<br/><br/>And the introduction of Sara Arjun... stunning presence, gorgeous performance!<br/><br/>The action sequences are raw, brutal, and beautifully crafted.<br/><br/>Overall, Dhurandhar is a bold, violent, gripping film - truly a must watch!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004253/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}