{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6jdzjtazcwzy47wxxtnrtrds4saj63apdb6pjatdomqbdf4skydkyoiyv7mbyoahz3igswugvcy24dafs7pzxzqsq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11010989",
              "author": {
                "username": {
                  "text": "krharshsj"
                },
                "userId": "ur108336380"
              },
              "summary": {
                "originalText": "#DhurandharReview: A Razor-Sharp, Explosive Triumph - 4.5/5"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar doesn&#39;t just adapt real events - he weaponises them. Dhurandhar is a masterclass in connecting chillingly authentic dots from India&#39;s covert history - things we know and those we don&#39;t - and then draping them in blistering fiction so seamless that you&#39;ll spend the entire runtime wondering which parts Dhar pulled from classified files (and which &quot;great connections&quot; handed him the keys). Wink or not, the illusion is devastatingly effective.<br/><br/>This is lean, mean espionage cinema that refuses to waste a single second. No forced romance, no pointless subplots, no heroic monologues in the rain - just relentless forward momentum. The pacing is ferocious: never non-stop edge-of-the-seat (it breathes when it needs to), yet never, ever boring. When the bullets fly, the action is bone-crunching and brilliantly choreographed; when the silence falls, it&#39;s heavier than any explosion.<br/><br/>The score? An absolute beast - throbbing, patriotic, and cleverly laced with punchy callbacks to Sunny Deol&#39;s roaring 90s era (those remixed hooks hit like nostalgia grenades). If there&#39;s one minor gripe, it&#39;s that the sound mix occasionally lets the music drown out dialogue, but honestly, you&#39;ll be too pumped to care.<br/><br/>Acting is on a different planet. The legends on screen (you know exactly who they are) deliver performances that remind you why they&#39;re legends - raw power, zero vanity, total command. @RanveerOfficial fights valiantly, but he&#39;s comfortably overshadowed by the heavyweights around him.(@duttsanjay, Akshay Khanna @ActorMadhavan) Even smaller roles shine: Rakesh Bedi is a revelation, Sara Arjun carries her emotional track with startling maturity, and quiet fire.<br/><br/>Yet the night undeniably belongs to Aditya Dhar. From #Uri to this, he has perfected the art of building high-stakes thrillers on the skeleton of real incidents without ever letting the joins show. Every revelation feels earned, every twist organic, every emotional beat gut-punching. He turns potential mess into surgical precision.<br/><br/>Dhurandhar isn&#39;t just one of the best espionage films Bollywood has ever produced - it&#39;s a roaring statement that Aditya Dhar is operating on a level few can touch.<br/><br/>March 2026 sequel? Take my money now.<br/><br/>Verdict: 4.5/5 - Mandatory big-screen experience. Bring earplugs if you&#39;re sensitive to loud glory."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010989/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006732",
              "author": {
                "username": {
                  "text": "kabir55"
                },
                "userId": "ur199256580"
              },
              "summary": {
                "originalText": "Epic Storytelling with a Stellar Lineup"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the outset, the narrative immerses viewers in a world of calculated danger and suspense. The lead&#39;s performance captures vulnerability, courage, and moral conflict with finesse. Action sequences are intense, realistic, and narratively purposeful. Cinematography highlights contrasts between stillness and chaos, while sound design amplifies tension. Supporting roles enrich the story with depth and nuance. The screenplay develops gradually, building tension and intrigue naturally. By the climax, every plot thread converges into a thrilling and emotionally satisfying resolution. This is cinematic storytelling at its finest-intelligent, immersive, and electrifying."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006732/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024341",
              "author": {
                "username": {
                  "text": "himrimc"
                },
                "userId": "ur122195594"
              },
              "summary": {
                "originalText": "Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s a must watch. Thoroughly entertaining, gripping story, keeps you to the edge, amazing acting by every actor, nice music, thoughtful sequencing, good cinematography, wonderful scenes, and most importantly, it shows the real face of Pakistani establishment. It&#39;s a must watch for Pakis too. The movie must be awarded and promoted."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024341/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013425",
              "author": {
                "username": {
                  "text": "SourikB-5"
                },
                "userId": "ur211588716"
              },
              "summary": {
                "originalText": "Based fr"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The true measure of a masterpiece is its ability to defy expectations, and Dhurandhar achieves this by making its considerable runtime of over three hours feel remarkably fleet. It is a cinematic anomaly: a long cinema where, as the viewer, you might truly never know how the time passes. Director Aditya Dhar crafts an experience so immersive, the clock simply ceases to matter. For me it&#39;s a banger of 2025.<br/><br/>This is fundamentally an action thriller, but its lasting impact comes from its intellectual depth. You noted that everything about the film and every second of the script compliment each other, and this is the film&#39;s greatest triumph. It meticulously builds a complex web of geopolitics, personal trauma, and covert operations, where no plot thread feels wasted. This cohesive storytelling elevates the film beyond a simple revenge or rescue narrative.<br/><br/>The movie&#39;s aesthetics are fiercely compelling-it is unequivocally eye-popping. Yet, this spectacle is balanced by a subtle palate in the script&#39;s approach to moral complexity and the psychology of its characters. Ranveer Singh delivers a career-high performance of controlled intensity, perfectly complemented by the chilling, calculating restraint of Akshaye Khanna. Their confrontation grounds the grand scale in human stakes.<br/><br/>While some critics may point to the film&#39;s ambition stretching its length, Dhurandhar is a powerful, detailed, and engrossing epic. It&#39;s a patriotic action film that doesn&#39;t sacrifice intelligence for adrenaline. It is, without question, a must watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013425/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11098739",
              "author": {
                "username": {
                  "text": "shibashishbehera"
                },
                "userId": "ur68135167"
              },
              "summary": {
                "originalText": "Dhuaandar Dhu-Ran-Dhar 🔥🔥🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I can only say that Dhurandhar is a masterpiece which can only made once in a lifetime and after seeing this in theatre I felt lucky to be in this moment.<br/><br/>It&#39;s a completely patriotical,emotional,action and drama all of this together in a package kind of movie.<br/><br/>No doubt Ranveer Singh has given a blast performance through his entire career also has given some classic and raw performance which can never been replaced by anyone.<br/><br/>Many of his scenes are hard hitting and you can feel his emotion and pain perfectly.<br/><br/>Akshaye Khanna has also became the ace of this game and played a massive Gangster role.<br/><br/>Akshaye Khanna has proved that age is just a number and if you have dedication you can play the game even in any playground.<br/><br/>His aura remains in this movie till the end.<br/><br/>R. Madhavan played a serious role which is very important for this movie.<br/><br/>Arjun Rampal again proved that if you have given him a good role he can literally kill it.<br/><br/>And last but not the least, Sanjay Dutt played the role of the SP Chaudhary Aslam perfectly.<br/><br/>Kudos to Aditya Dhar for making this masterpiece and showing his vision for movie making.<br/><br/>The actual behind the scene hero is Shashwat Sachdev for giving plenty of good music with really well made BGMs and compositions.<br/><br/>Feeling grateful to see such versatility in music making.<br/><br/>Overall it&#39;s a must watch movie for all the cinematic or regular audience.<br/><br/>Waiting for next part eagerly."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11098739/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017221",
              "author": {
                "username": {
                  "text": "Maddy-055"
                },
                "userId": "ur204193927"
              },
              "summary": {
                "originalText": "Isn't just a film; it's a statement. A well-acted, tightly executed, and unforgettable one."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar arrives like a thunderclap, a film that refuses to blink in the face of geopolitical reality and instead delivers a gripping narrative with cinematic finesse. At the heart of the film stands Akshaye Khanna, whose performance is nothing short of extraordinary. He doesn&#39;t just act; he inhabits the frame with a calm ferocity, delivering a portrayal so controlled and layered that it becomes the emotional axis of the entire film. His presence elevates every scene, and his precision adds a gravity that lingers long after the credits roll.<br/><br/>Ranveer Singh brings an electric edge to his character, embodying both urgency and charisma with his trademark intensity. His role balances Khanna&#39;s stoic brilliance with a kinetic energy that keeps the film&#39;s pulse racing. Their dynamic together is one of the movie&#39;s most rewarding strengths.<br/><br/>Arjun Rampal (my favorite actor), though given limited screen time, leaves a deep imprint. His performance is sharp and dignified, the kind that makes you wish the script had carved out more room for him. Even in a few scenes, he proves why he remains one of the industry&#39;s most compelling presences.<br/><br/>Beyond the performances, Dhurandhar stands out for its unapologetic commitment to truth-telling. The film boldly addresses Pakistan&#39;s support of terrorist organizations, presenting the narrative with clarity, research-backed nuance, and moral courage. It captures the geopolitical climate with an honesty rarely attempted in mainstream cinema, turning complex realities into powerful storytelling. Adding real footage from 26/11 and conversations between terrorists triangulated the truth claims made by the film.<br/><br/>Dhurandhar isn&#39;t just a film; it&#39;s a statement. A well-acted, tightly executed, and unforgettable one."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017221/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028858",
              "author": {
                "username": {
                  "text": "amanver-33758"
                },
                "userId": "ur84304054"
              },
              "summary": {
                "originalText": "Dhurandhar: A Fearless Truth on Screen"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar grips with confident storytelling and uncompromising honesty. The film&#39;s core theme-that every event, motive, and detail presented is absolutely correct-is conveyed with clarity and conviction. Powerful performances, taut pacing, and authentic visuals make the narrative feel lived-in and credible. It challenges, informs, and resonates, leaving the audience with the sense that truth, when told boldly, is the most compelling cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028858/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011496",
              "author": {
                "username": {
                  "text": "sachinkmr-27060"
                },
                "userId": "ur126121205"
              },
              "summary": {
                "originalText": "Just awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie pays the price of each and every penny of my money. Heart brustling and just glues me with the film. It shows minute details of the region especially paskistan and the situation the country is facing at that time. Very articulated charactisaction of each actor and they all played it beautifully."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011496/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011378",
              "author": {
                "username": {
                  "text": "Kajodm-4"
                },
                "userId": "ur211573547"
              },
              "summary": {
                "originalText": "Jkasss"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Gjb movie.&quot;Hindustaniyon ka sabse bada dushman Hindustani hi hai, Pakistan to dusre number par aata hai&quot;.<br/><br/>The best dialogue from the movie Dhurandhar, which seems to be true.<br/><br/>What a genius director Aditya Dhar is. I just finished watching Dhurandhar. Ranveer Singh delivers a powerhouse performance, while Akshaye Khanna and Sanjay Dutt in a single frame is pure cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011378/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11072627",
              "author": {
                "username": {
                  "text": "KVL412101"
                },
                "userId": "ur212044578"
              },
              "summary": {
                "originalText": "CLASSIC FILM OF INDIAN HISTORY"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar ek dhamakedaar spy-thriller hai jo shuru se end tak audience ko seat se chipkaa ke rakhti hai. Aditya Dhar ka direction solid hai - scenes slow burn hain, par jab punch aata hai na, toh full power ke saath lagta hai. Ranveer Singh ne iss baar seriously apni best performances mein se ek di hai. Unka character undercover world mein itna deep chala jaata hai ki kahin-kahin aapko lagta hai woh khud ko bhi bhool gaya hai. Akshaye Khanna ki screen presence mind-blowing - har frame mein ek unpredictable tension bana rehti hai.<br/><br/>Sanjay Dutt, Arjun Rampal aur R. Madhavan jaise actors ne movie ko ek alag hi depth di hai. Inke characters supporting nahi lagte - sabka apna weight aur importance feel hota hai. Action sequences highly stylized hain, cinematography tight hai aur background score scenes ko aur bhi intense bana deta hai. Kuch jagah narrative slow ho jaata hai, lekin woh bhi story build karne ke liye zaroori lagta hai - fast pace hota toh shayad impact kam padta.<br/><br/>Story mein politics aur underworld ka mix har kisi ko suit na kare, but agar aapko gritty aur realistic tone pasand hai, toh Dhurandhar pakka pasand aayegi. Emotional beats bhi acchi tarah land hote hain - especially jab undercover mission personal ho jaata hai.<br/><br/>Overall, Dhurandhar ek powerful, well-acted aur stylish film hai - ek aisi movie jo Bollywood mein rarely banti hai. Nice direction, strong performances aur thrilling storytelling... total worth watching!<br/><br/>Aur haan - ending dekh kar ek hi baat dimag mein aati hai:\n&quot;Boss... yeh kahani abhi khatam nahi hui.&quot;\nI&#39;m seriously looking forward to Dhurandhar 2 releasing on 19th March 2026! 💥🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11072627/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007087",
              "author": {
                "username": {
                  "text": "rn-39228"
                },
                "userId": "ur115068884"
              },
              "summary": {
                "originalText": "Action, Drama, and a Star-Studded Powerhouse"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s narrative complexity is matched by its thrilling action sequences. Ranveer Singh delivers a masterful performance, portraying vulnerability, intelligence, and resolve in equal measure. Sanjay Dutt commands the screen with gravitas, and Akshaye Khanna and R Madhavan provide subtle, layered performances that deepen the narrative. Arjun Rampal&#39;s menace is constant yet understated, while Sara Arjun&#39;s poignant scenes anchor the audience emotionally. Aditya Dhar directs with clarity, blending suspense, strategy, and visually spectacular action. Cinematography captures both large-scale chaos and intimate tension. The score accentuates every beat, and the finale combines action and emotion for a gripping conclusion."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007087/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013687",
              "author": {
                "username": {
                  "text": "Subhashv-08"
                },
                "userId": "ur211590954"
              },
              "summary": {
                "originalText": "BAD DREAM FOR TERRORIST \"\"DHURANDAR\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping spy-thriller that hits with power and patriotism. Ranveer Singh delivers one of his most intense performances, Ajith Doval-style calm with fire inside. Director Ajeet Togle and S. Mahadavan craft a sharp India-Pakistan espionage story that feels real, fast and fearless. Background score, action and tension - all on point. A must-watch for anyone who loves intelligent thrillers and national pride.&quot;"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013687/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013389",
              "author": {
                "username": {
                  "text": "bibhuprasadsahoo-00933"
                },
                "userId": "ur132009587"
              },
              "summary": {
                "originalText": "#realspymovie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Adity dhar has done wonderful job . Totally jaw dropping performance by akshya khanna. And all actors are well placed . Don&#39;t believe in leftist propaganda review just watch in theatre . Akshay khana&#39;s entry song deserves a standup applus . Even movie is of to three hour and thirty minutes but it doesn&#39;t feel soo.. long ."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013389/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018179",
              "author": {
                "username": {
                  "text": "jitender-77787"
                },
                "userId": "ur69891861"
              },
              "summary": {
                "originalText": "Amazing Experience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an amazing and powerfully crafted film that stays deeply connected with real events. Throughout the movie, there are several goosebump-worthy moments that make you feel every emotion the characters go through.<br/><br/>The plot is gripping, the storytelling is smooth, and the way the narrative unfolds keeps you fully hooked from start to finish. The cast has done an outstanding job, and each actor brings intensity and authenticity to their role.<br/><br/>Ranveer&#39;s performance is phenomenal-especially the scenes where he expresses anger and pain. His emotional delivery is so impactful that it can genuinely bring tears to your eyes."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018179/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007322",
              "author": {
                "username": {
                  "text": "ak-60403"
                },
                "userId": "ur111325424"
              },
              "summary": {
                "originalText": "mast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Full on action and top notch acting.<br/><br/>Akshay has completed overshadowed everyone in the movie,arjun has been incredibly showing his villian era ,maddy as ajit was phenomenal and and and ranveer singh has show has class very well ,sanjay dutt was too good as aslam choudhary.<br/><br/>The movie was complete blockbuster, a must watch for sure."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007322/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007588",
              "author": {
                "username": {
                  "text": "nishantjaiswal-04853"
                },
                "userId": "ur154427218"
              },
              "summary": {
                "originalText": "A Story That Packs a Punch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the very first frame, the film immerses viewers in a tense, dangerous world where every decision carries weight. Ranveer Singh delivers one of his most compelling performances, fully inhabiting a character torn between duty and conscience. The supporting cast enhances the narrative, bringing authenticity and emotional depth. Action sequences are intense, carefully choreographed, and narratively justified. Director Dhar orchestrates suspense, drama, and political commentary with precision, creating a cinematic experience that is visually stunning and emotionally gripping. With a haunting score and sharp editing, the film stands as a masterclass in modern thriller storytelling."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007588/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017550",
              "author": {
                "username": {
                  "text": "AanchalN-69"
                },
                "userId": "ur211620619"
              },
              "summary": {
                "originalText": "True Film Sense"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie 🍿🎥 gave full on roller coaster emotions, action pack film with such true events and wonderful 👍 dialogues, furious songs, bgm.. m just loving it.. planning to again.. it&#39;s a tribute to Jasprit Singh Rangi...and the BHARAT to provide such Patriotic people to our country..Bharat Mata ki Jai.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017550/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007167",
              "author": {
                "username": {
                  "text": "Ganesh-7991"
                },
                "userId": "ur204501209"
              },
              "summary": {
                "originalText": "Crafted with scale, soul, and unshakeable star presence"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative&#39;s strength lies in its layered construction, combining high-stakes action with complex character arcs and political intrigue. Ranveer Singh&#39;s performance is compelling, embodying both intensity and vulnerability, making his journey relatable despite extreme circumstances. The director&#39;s precision ensures that tension never wanes, with each scene building toward a calculated crescendo. Secondary characters are well-developed, and even brief appearances carry weight. Cinematic visuals and thoughtful lighting elevate every moment, while the soundtrack underscores rather than dominates. Editing skillfully maintains pace, weaving multiple threads seamlessly. The film&#39;s climax is both shocking and emotionally satisfying, reflecting the carefully laid groundwork of the story. It&#39;s a cinematic experience that resonates far beyond the theater."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007167/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11074136",
              "author": {
                "username": {
                  "text": "ankit-7241"
                },
                "userId": "ur212054935"
              },
              "summary": {
                "originalText": "The storytelling is gripping and well-paced, with strong performances that keep you emotionally invested throughout"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched Dhurandhar and found it truly outstanding. Despite its long runtime of around 3.5 hours, the movie never once felt boring. Every minute was engaging, which is a rare achievement for a film of this length.<br/><br/>The storytelling is gripping and well-paced, with strong performances that keep you emotionally invested throughout. The screenplay is smart, the direction is confident, and the narrative keeps unfolding in a way that constantly holds your attention. The film balances drama, emotion, and intensity beautifully, making the experience feel immersive rather than exhausting.<br/><br/>What impressed me the most is how the movie sustains interest from start to finish without unnecessary drag. Each scene feels purposeful, and the buildup leads to a satisfying payoff. Dhurandhar is a well-crafted, powerful film that proves length doesn&#39;t matter when the content is compelling and far better than the worst time wasting movie like the tiger&#39;s, Pathaan and war .<br/><br/>Highly recommended for anyone who enjoys meaningful and engaging cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-30",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11074136/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013636",
              "author": {
                "username": {
                  "text": "sahilverma-40809"
                },
                "userId": "ur135524249"
              },
              "summary": {
                "originalText": "Classic display of epic acting and skills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Each and every character in this film is the epitome of their acting skills, just watched decade of the movie. Never seen stuff like this. This film should be watched by everyone, you&#39;ll get to see the real characters and amazing actors where they have played lifetime best acting of their career. Just bloody god damn film."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013636/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007170",
              "author": {
                "username": {
                  "text": "AnishP-73"
                },
                "userId": "ur210717335"
              },
              "summary": {
                "originalText": "A tale that grips first, then refuses to let go"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s structure gradually tightens, transforming seemingly ordinary scenes into moments of high stakes and psychological intensity. Ranveer Singh excels in portraying a character constantly navigating moral and strategic dilemmas, while the supporting cast gives depth to every confrontation. Director Dhar&#39;s command over narrative pacing allows tension to simmer before exploding into unforgettable action sequences. The cinematography and lighting emphasize mood shifts, from claustrophobic danger to quiet, reflective moments. Every punch, chase, and revelation serves a story purpose, and the score complements without overshadowing, creating a fully immersive cinematic experience."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007170/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013740",
              "author": {
                "username": {
                  "text": "RevanthS-39"
                },
                "userId": "ur211590893"
              },
              "summary": {
                "originalText": "Best Spy action thriller movie! & Best movie this year."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie was an absolute banger! You MUST watch this on the big screen. Don&#39;t be scared by the long 3 hour 32 min long runtime. The story was interesting and very straightforward. And I&#39;ve seen so many people say that the movie has political propaganda. I&#39;ve seen none of that in the movie and I don&#39;t support one single party. This is a no nonsense spy movie with a lot of action which is actually good! The acting by all the cast was impeccable. Especially Ranveer Singh and Akshaye Khanna. The music too is a great addition to the film. It adds to the action in the movie.<br/><br/>Story&#39;s good\nActing&#39;s outstanding\nAction&#39;s amazing (raw &amp; rustic)\nMusic&#39;s amazing\nWhat more do you need for a film to be good yet this movie delivers more than just good."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013740/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007632",
              "author": {
                "username": {
                  "text": "imdbfan-1888833312"
                },
                "userId": "ur199251026"
              },
              "summary": {
                "originalText": "Thrills, Drama, and Unforgettable Stars"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film masterfully navigates a complex web of crime, politics, and personal conflict, keeping the audience perpetually engaged. Ranveer Singh shines in a role that demands both physicality and emotional depth, while the supporting cast enriches the story with compelling portrayals. The director&#39;s meticulous attention to detail is evident in every frame, from lighting to choreography to narrative structure. Action sequences are intense and meaningful, while quieter moments allow characters to breathe and resonate. The cinematography, editing, and score combine to create a tense, immersive experience, culminating in a climax that is both shocking and profoundly satisfying."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007632/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020335",
              "author": {
                "username": {
                  "text": "anujar-78"
                },
                "userId": "ur211644149"
              },
              "summary": {
                "originalText": "Best movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a captivating experience from start to finish. Every scene is shot with stunning artistry, making the visuals feel like living paintings. The actors deliver their absolute best-mesmerizing, powerful, and unforgettable performances. The music, direction, and emotion blend beautifully, creating a film that stays with you long after the credits roll. A truly remarkable cinematic journey."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020335/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11032026",
              "author": {
                "username": {
                  "text": "kaushalchina"
                },
                "userId": "ur178464075"
              },
              "summary": {
                "originalText": "🚨 Mind-Shattering Masterpiece! Dhurandhar Will Leave You Speechless and Begging for Part 2! 🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "OMG, where do I even start? Dhurandhar just blew my mind completely - this is hands down the BEST spy thriller Bollywood has EVER produced! I went in expecting a good action film, but what I got was a jaw-dropping revelation that had me shocked from the very first frame. How were we all so unaware of these insane real-life inspired events happening right under our noses? The way the movie exposes betrayals at the highest levels - Indian politicians and insiders secretly helping Pakistan pull off devastating attacks like the IC-814 hijack, Parliament attack, and 26/11 - it&#39;s chilling, eye-opening, and makes your blood boil with patriotic fire!<br/><br/>Ranveer Singh is on another level as the undercover agent - his transformation, intensity, and raw power will give you goosebumps every single scene. But hold up... Akshaye Khanna? ABSOLUTE STEALER OF THE SHOW! As the ruthless gangster Rehman Dakait, his swag, menacing aura, and dialogue delivery are pure fire - he&#39;s giving a career-best performance that&#39;s unforgettable! The entire cast - R. Madhavan, Sanjay Dutt, Arjun Rampal - brings so much depth and menace, making every betrayal and twist hit harder.<br/><br/>Aditya Dhar&#39;s direction is genius: brutal action that&#39;s realistic and heart-pounding, immersive cinematography in the gritty Lyari underworld, and Shashwat Sachdev&#39;s throbbing score that keeps the tension sky-high for over 3 hours (and trust me, it NEVER drags!). This is bold, ambitious cinema that redefines the genre - patriotic, gripping, and unapologetic.<br/><br/>If you&#39;re a fan of intense thrillers, RUN to the theaters NOW for the full big-screen impact! This isn&#39;t just a movie; it&#39;s an experience that&#39;ll stay with you forever. Can&#39;t wait for Part 2 - Dhurandhar is a GAME-CHANGER! 🇮🇳🔥 #Dhurandhar #MustWatch #BollywoodBlockbuster."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032026/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}