{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6rbbktazcwzy472xhrnjyqpu4ocbs2iktb4pfb3eomqbdf4skydkzpa4f7mbyocti63qpz2xi7q7zc25ukdbuqbma",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11018538",
              "author": {
                "username": {
                  "text": "MayankS-818"
                },
                "userId": "ur211628556"
              },
              "summary": {
                "originalText": "A Masterclass in Storytelling and Emotion!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; is an absolute gem of a film! From start to finish, it keeps you completely hooked with its gripping storyline, brilliant direction, and powerful performances. Every scene feels purposeful - beautifully shot, emotionally moving, and filled with intensity. The characters are so well developed that you can&#39;t help but connect with them. The background score and cinematography elevate the overall experience even more. It&#39;s rare to see such a perfect blend of storytelling and emotion. Easily one of the most engaging and well-crafted films I&#39;ve watched recently - a must-watch for everyone!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018538/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006418",
              "author": {
                "username": {
                  "text": "icoqvolo"
                },
                "userId": "ur176906594"
              },
              "summary": {
                "originalText": "Explosive Scenes Fueled by Heart"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative excels in building tension slowly, allowing viewers to understand the stakes and the intricate relationships between characters. Ranveer Singh&#39;s performance is magnetic, conveying both strength and vulnerability with equal skill. The director&#39;s craftsmanship shines in the pacing and framing, while supporting actors add layers of realism. Action sequences are intense and choreographed with purpose, and the musical score complements every scene, making the climax a masterclass in cinematic storytelling."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006418/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014365",
              "author": {
                "username": {
                  "text": "pote_harshal"
                },
                "userId": "ur24072271"
              },
              "summary": {
                "originalText": "No Ordinary Spy: The Pain, Power, and Perfection of Dhurandar!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar isn&#39;t just a movie it&#39;s a visceral descent into the personal hell of a man who has been forged, broken, reshaped, and reborn by the world of espionage. What makes the film so extraordinary is the director&#39;s masterful ability to make us feel the protagonist&#39;s suffering, not through melodrama, but through an unflinching portrayal of what a spy&#39;s life truly looks like.<br/><br/>The violence and gore in Dhurandar never come across as shock value or cheap thrills. Instead, they serve a purpose-they&#39;re narrative tools that help you understand a painful but essential truth: to fight monsters, sometimes you have to become one. Every wound, every brutal encounter, every drop of blood is a piece of the protagonist&#39;s story a story of survival, transformation, and the cost of walking in the shadows.<br/><br/>The direction deserves massive applause. The action sequences are sharp, grounded, and purposeful. The emotional and romantic moments though brief are beautifully interwoven, adding human depth without slowing the pace. Despite being a long film, Dhurandar never wastes a second; every scene has context, weight, and meaning. It&#39;s rare to see such discipline in Bollywood filmmaking, and this film stands out as a shining example of what Indian cinema can achieve when it respects both its audience and its craft.<br/><br/>This isn&#39;t your typical Bollywood spectacle. This is espionage done right, gritty, intelligent, character-driven, and unapologetically raw. It shows that Bollywood can create world-class spy thrillers without copying Hollywood, instead carving out its own voice with cultural authenticity and emotional depth.<br/><br/>In the end, Dhurandar is not just a film you watch it&#39;s a film you experience. It&#39;s powerful, relentless, beautifully made, and absolutely worth every minute. A must-watch for anyone who craves cinema with purpose and punch.<br/><br/>Here&#39;s hoping Bollywood continues to make more films as fearless and brilliantly crafted as Dhurandar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014365/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011418",
              "author": {
                "username": {
                  "text": "Ravis-0741"
                },
                "userId": "ur211573852"
              },
              "summary": {
                "originalText": "Good reality"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Reality as it is. The film centers around Ajit Doval, India&#39;s top spy, who goes undercover in enemy territory, risking everything to gather intelligence and prevent a major crisis. It&#39;s reportedly inspired by real-life incidents and covert operations of RAW (Research and Analysis Wing).watch this must. Music is good."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011418/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11097271",
              "author": {
                "username": {
                  "text": "danishparab2"
                },
                "userId": "ur37929126"
              },
              "summary": {
                "originalText": "A BLOOD ACTION RIOT FILM"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "IT IS SOME PROPAGANDA FILM BUT A BRILLIANTLY BAKED FILM A SALUTE TO ADITYA DHAR. AKSHAYE KHANNA IS A SHOWRUNNER OF THIS FILM BUT DARK HORSE IS RAKESH BEDI OH MAN HE IS THE SOUL OF THE FILM. I AM VERY MUCH SUPRISED THAT NO ONE IS TALKING ABOUT HIM. BUT BE AWARE THAT IT IS BLOOD RIOT FILM. WAITING FOR DHURANDAR 2 BADLU."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-04",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11097271/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013721",
              "author": {
                "username": {
                  "text": "neerajtishnagi"
                },
                "userId": "ur184355339"
              },
              "summary": {
                "originalText": "Durandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Music, hardcore action, acting story and acting everything is ravishing. I didn&#39;t able to recognise Bedi Sir, Awesome acting. People are prasing Akshay Khanna but don&#39;t forget Arjun he is brutal. All the costar are awesome. Hats off for Aditya Dhar for such a beautiful movie. The way he written he should published his novel for the same name with more deep research. I will be first one to purchase hus novel. People who are complaining for violence they is nounnecessary violence in it or nothing is forced. I am a big fan of Ranveer they way he carry himself in this part is awesome. U will get more in part 2 or may in part 3."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013721/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010049",
              "author": {
                "username": {
                  "text": "kiranbhole"
                },
                "userId": "ur184101950"
              },
              "summary": {
                "originalText": "Supreme, Nailbiting and powerful cinematic creation."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Its absolutely Mindblowing saga, Dhurandhar is a gripping, sharp-edged spy thriller that immerses you straight into the brutal underbelly of Karachi&#39;s gang wars. What makes the film stand out is how intelligently it fuses gritty underworld chaos with high-stakes espionage, keeping the tension tight without resorting to cheap twists. The Indian spy at the centre is written with depth - not a superhero, but a human weapon navigating betrayal, shifting loyalties, and constant danger.<br/><br/>The film&#39;s pacing is relentless, the action sequences feel grounded, and the atmosphere of Karachi&#39;s crime corridors is captured with raw authenticity. The background score amplifies the suspense without overwhelming the story. Dhurandhar succeeds because it balances realism with emotion, delivering a taut narrative that keeps you hooked while respecting the seriousness of its subject.<br/><br/>Overall, it&#39;s a smart, engaging thriller that delivers intensity, intrigue, and a powerful sense of purpose - without giving anything away. Classic experience it was !!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010049/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014315",
              "author": {
                "username": {
                  "text": "thegoatjoy"
                },
                "userId": "ur169149236"
              },
              "summary": {
                "originalText": "What a Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It is like a real story. Every single detail are given in this movie. Every actor is perfectly fit in this movie but some Pakistan ke pille rating this movie low because they are crying they are calling this is a false agreement but I love this movie every Indian should be watch this movie. This movie shows us what Pakistani is."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014315/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013542",
              "author": {
                "username": {
                  "text": "lstechlikithsrinath"
                },
                "userId": "ur126723099"
              },
              "summary": {
                "originalText": "Good movie. Haters gonna hate hate hate."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movies shows what bollywood is capable of . Ihonestly crticise badly of bollywood movies. But this? Aditya Dhar?! Amazing work. And Akshaye Khanna-mind blowing. I personally fel all the ones who gonna hate this movie require to see without any bias. Does not matter what background or religious frame you come from. I am NOT telling you to believe whatever you see in this movie. Just watch it and think about it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013542/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11078325",
              "author": {
                "username": {
                  "text": "sudhanshus-14"
                },
                "userId": "ur208836212"
              },
              "summary": {
                "originalText": "Perfection"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Go for it.<br/><br/>Aditya Dhar proves once again that he is among the most assured and visionary directors in contemporary Indian cinema. With Dhundhar, Dhar delivers a gripping cinematic experience that stands tall as a masterclass in direction. In Dhundhar, Aditya Dhar doesn&#39;t just direct a film-he crafts an experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-31",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11078325/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006850",
              "author": {
                "username": {
                  "text": "kashvi93237"
                },
                "userId": "ur199125021"
              },
              "summary": {
                "originalText": "Unmatched Energy with a Power-Packed Cast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film steadily builds a tense atmosphere, combining psychological intrigue with high-stakes action. The lead delivers a performance full of depth, restraint, and intensity. Fight scenes are realistic, strategically framed, and emotionally charged. Cinematography and sound design heighten both suspense and spectacle. Secondary characters are well-defined, adding richness and complexity to the story world. The pacing is deliberate, allowing tension to escalate naturally. By the second half, every narrative thread converges into a thrilling climax, blending adrenaline, emotion, and moral resolution. This is intelligent, compelling, and unforgettable cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006850/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11045844",
              "author": {
                "username": {
                  "text": "arjunthatai"
                },
                "userId": "ur123730200"
              },
              "summary": {
                "originalText": "EMOTIONS!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I don&#39;t remember the last time I was so excited and enjoyed any movie this much as much I have enjoyed dhurandhar. Absolute Cinema IT IZ! Forget about right wing left wing. This movie is a must watch for everyone who wants to enjoy movie.<br/><br/>Full paisa vasool. Akshay Khanna ka swag aur Aditya Dhar ki direction, subhanallah!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11045844/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014105",
              "author": {
                "username": {
                  "text": "rishabhjio"
                },
                "userId": "ur160805907"
              },
              "summary": {
                "originalText": "Superb movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "10 out of 10 for showing the reality. All actors done fabulous job. Even I like the work of rakesh bedi ji as minister. He actually stole the show.<br/><br/>Ranveer as usual work hard for this movie. R.madhvan is Missing in this movie. Whenever he comes on screen, i didn&#39;t recognise him. Always I thought he is actually a ajeet doval sir."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014105/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017902",
              "author": {
                "username": {
                  "text": "KrishnarpanB"
                },
                "userId": "ur207126936"
              },
              "summary": {
                "originalText": "A BANGER from Ranveer Singh!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A fabulous actor at heart! No matter what Ranveer does for showbiz, and no matter how much he was bullied, trolled, and tested in front of the audience because of his Kantara remarks, I have no hesitation in mentioning that he truly delivered on screen. Among the best actors-Akshaye Khanna, Sanjay Dutt, R. Madhavan, Arjun Rampal-Ranveer fits in perfectly as a character who is minimalist, not overly exposed or dramatised, but a coherent and important pillar of the story.<br/><br/>A silent infiltrator turned snake, he slowly grew, learned, and survived the hostile lands. Both the director and Ranveer did a phenomenal job in building up the character with a timed and seamless slow-burn treatment. By the end of the movie, it reaches a peak of emotional turbulence, depicted effortlessly by the actor.<br/><br/>Needless to say, his overall look was craftily created-like a Middle Eastern god who will reign over the underworld for many years. It is a true representation of a secret agent&#39;s emotional journey: from being alone in a disarrayed province with no family or friends, to finding love and purpose to keep going. It looked absolutely humane and grounded, thanks to Ranveer&#39;s natural take on the role.<br/><br/>All the other actors mentioned above need no praise; they have already earned their dues from fans. And what a comeback from Akshaye Khanna-he deserves a big salute. That is why my review today focuses only on Ranveer.<br/><br/>Other than this, I have nothing more to say. The movie is a masterstroke by director Aditya Dhar. After Uri, what a representation! He absolutely knocked it out of the park. People were a bit sceptical about the long 3.5-hour runtime, but trust me-you will enjoy every minute of it. Post-interval, it truly hits its high.<br/><br/>The gritty realism never loses its tone under the gore and pulp treatment of the movie. So be ready to be thrilled and stunned while watching this well-balanced and polished piece of art.<br/><br/>I give Dhurandhar a strong 8."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017902/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007583",
              "author": {
                "username": {
                  "text": "mohannsharma"
                },
                "userId": "ur154427252"
              },
              "summary": {
                "originalText": "A Thrilling Ride with Epic Performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film builds momentum like a finely tuned machine, gradually drawing viewers into a world fraught with danger and moral ambiguity. Ranveer Singh&#39;s performance is magnetic, combining physicality with deep emotional nuance. The supporting cast is exceptional, making every subplot resonate with authenticity. Action sequences are cinematic and intense, each carefully designed to advance the story. The director demonstrates a mastery of tension, rhythm, and visual storytelling, ensuring that the political intrigue feels immediate and consequential. With evocative cinematography and a haunting score, the film delivers a complete, engrossing experience that stays with you long after viewing."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007583/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014088",
              "author": {
                "username": {
                  "text": "Rahul-3076"
                },
                "userId": "ur211594762"
              },
              "summary": {
                "originalText": "Best moview in spy world"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Moview shows how Pakistan use terrerrists to attack India, best acting, music, based on real story, wow what a masterpiece.<br/><br/>Moview shows how Pakistan use terrerrists to attack India, best acting, music, based on real story, wow what a masterpiece.<br/><br/>Moview shows how Pakistan use terrerrists to attack India, best acting, music, based on real story, wow what a masterpiece."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014088/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11093197",
              "author": {
                "username": {
                  "text": "QausenA-7"
                },
                "userId": "ur206133854"
              },
              "summary": {
                "originalText": "Bollywood Evolution"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "As an hollywood movies lover I can say it is the best movie , that what Indian cinemas should focus on realism rather than dramatic shots and unreal CGI. Well keep improving bollywood can do better everyone acted so goated that for 3hr it dosent feel like i was watching a movie it felt like i was in the movie."
                }
              },
              "authorRating": 9,
              "submissionDate": "2026-01-03",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11093197/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010756",
              "author": {
                "username": {
                  "text": "umishraabhinav"
                },
                "userId": "ur192522995"
              },
              "summary": {
                "originalText": "IT was a Good movie over all"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It was the good movie overall from the Bollywood point of view in the recent time. The cinematic view and how the actors are doing very good acting BGM also one of the best and the music also this good . In the overall comparison it was the good movie it did not feel too long that you know it was 3.5 hour movie but it did not feel that much let&#39;s hope for next part."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010756/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018475",
              "author": {
                "username": {
                  "text": "alexkevin-32392"
                },
                "userId": "ur165228711"
              },
              "summary": {
                "originalText": "Solid entertainer (also too factual)"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "As the title suggests, it&#39;s too good a watch. It highlights the role of counterfeit currency market and Islamic terrorists (though the western hand aspect is not highlighted) in manufacturing terrorism on Indian soil and also the sacrifices Indian RAW agents make working for national interests.<br/><br/>Hard movie to digest for those in a perpetual denial mindset."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018475/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026490",
              "author": {
                "username": {
                  "text": "Khyati-08"
                },
                "userId": "ur211692201"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a solid and engaging film that focuses more on strong performances and storytelling rather than unnecessary glamour. The movie keeps things realistic and grounded, which makes it feel believable and relatable.<br/><br/>Ranveer Singh gives a convincing performance and once again proves his versatility as an actor. He brings intensity and emotion to his role without overdoing it, making his character feel real. Akshay Khanna&#39;s acting is one of the biggest strengths of the film. His calm, controlled, and mature performance adds depth to the story and leaves a lasting impact.<br/><br/>The story moves at a steady pace and stays focused on its core theme. The screenplay is well-written, with meaningful dialogues and situations that connect well with the audience. The direction is sensible, allowing the actors to shine rather than forcing dramatic moments.<br/><br/>Music and background score are used appropriately and support the narrative instead of overpowering it. Cinematography is clean and suits the mood of the film.<br/><br/>Overall, Dhurandhar is a well-made movie with strong acting, a realistic approach, and good storytelling. It may not rely on loud drama, but it delivers through performances and content. Definitely worth watching for viewers who appreciate meaningful cinema and good acting."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026490/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010755",
              "author": {
                "username": {
                  "text": "dhirudhirendarsingh"
                },
                "userId": "ur131844320"
              },
              "summary": {
                "originalText": "Exceptional"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film is truly a must-watch experience. After a long period of anticipation, Aditya has finally delivered a spectacular blockbuster that lives up to every expectation. The storytelling is gripping from start to finish, thevisuals are breathtaking, and the soundtrack perfectly complements the emotional depth of the film. Every scene feels crafted passion and detail, offering the audience an unforgettable journey on the big screen. It is pure, absolute cinema - the kind that reminds you why we love going to the movies."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010755/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007363",
              "author": {
                "username": {
                  "text": "rohanlaad"
                },
                "userId": "ur154427298"
              },
              "summary": {
                "originalText": "Drama, Action, and Incredible Talent"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling in this film is both intelligent and immersive, gradually building stakes that hit with full force in the second half. Ranveer Singh carries the narrative with extraordinary depth, portraying his character&#39;s dilemmas with authenticity and emotional resonance. The supporting cast enhances the plot, each character vividly drawn and memorable. Action sequences are intense, choreographed to perfection, yet never detract from the story. Director Dhar masterfully balances pacing, tension, and cinematic visuals, while the sound design and score accentuate the emotional beats, making the film not just entertaining but deeply compelling and thought-provoking."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007363/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011361",
              "author": {
                "username": {
                  "text": "nikhilsinh-30640"
                },
                "userId": "ur184414085"
              },
              "summary": {
                "originalText": "Wow"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just amazing movie casting,music was awesome , story telling is way ahead of any other Movie\nAll actors did there job, especially ranvir and akshay both acted really well\nMadhvan and rakesh bedi were awesome in there part , rampal role was sd good as anyone in the movie\nBut the real thing is BGM of the movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011361/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11030769",
              "author": {
                "username": {
                  "text": "rayyanmallick"
                },
                "userId": "ur133381954"
              },
              "summary": {
                "originalText": "The Film which will be remembered for ages to come ⭐⭐"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I went to watch Dhurandhar on 10th December and believe me that was one of the best cinema experience I had. Not even a single second I felt like this is a unnecessary scene each scene adds value to the movie. The type of filmmaking which focuses not on the star value but the characterization. Ranveer Singh was like a side character when Akshaye Khanna came on screen and the aura farming he did! Whoever reading this review, please brother/sister, go and watch this movie, in rs.200-300 you will not be in any loss and time wastage, just give a one chance and enjoy! Have a nice day :)"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11030769/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028926",
              "author": {
                "username": {
                  "text": "debojitbhatta"
                },
                "userId": "ur180775824"
              },
              "summary": {
                "originalText": "Epic mix of true and fiction"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The blend which turned out to be deadly combination. Fiction moulded with true events elevated the story to a much greater heights. The BG score, the dialogue and characters, acting all were in sync and not to forget the nationalism it brights out if every audience. You will bepumped to the core while leaving the theatre."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028926/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}