{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6hbbitazcwzy47wxhxmbtqls4ybz534mt57xedpj3qflanes2yd2tpa2e7wzih3tsau4pegbux6p57g663nmk",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11025810",
              "author": {
                "username": {
                  "text": "shivonthadhani"
                },
                "userId": "ur71126923"
              },
              "summary": {
                "originalText": "Dhurandhar outstanding a must see film for every inian on the planet !"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I saw the Dhurandhar Hindi movie, and I must say it is a really very entertaining movie! A must-see for all cinema lovers , it has action, story, emotion, etc. Every Indian must see it to witness how our Indian spies spy on Pakistan &amp; vice versa &amp; what horrible treatment our Indian spies get if they are caught in Pakistan and also get some glimpses &amp; ideas behind the scenes for major terrorist attacks which happened between Pakistan &amp; India, e.g., the ICC-814 flight hijack, bombings near Indian parliament, 26/11 Mumbai terror attacks, etc. Even with how Pakistan easily acquires ammunition and guns to easily start terrorism, terrorism financing, etc., part 2 of this movie is confirmed for next year, 2026, &amp; the story isn&#39;t finished yet so far!"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025810/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11037330",
              "author": {
                "username": {
                  "text": "AnakshiR"
                },
                "userId": "ur211780916"
              },
              "summary": {
                "originalText": "A movie that has raised the bars high up for me"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The action, performances, star cast, cinematography, direction, and the art itself were absolutely mind-boggling. Every element felt so perfectly executed that I couldn&#39;t find a single flaw in any scene. I was completely spellbound from start to finish.<br/><br/>When I watch or review other films, I usually find at least one aspect to critique but this film left me with nothing to question. While watching it, I genuinely felt that this belonged to an entirely different league of cinema, comparable to top-tier Hollywood productions. It was so elevated that I felt I wasn&#39;t even qualified to judge it.<br/><br/>This was a level of filmmaking I have never experienced before. The film captures everything with precision emotion, affection, failure, intensity and binds it all together seamlessly. The music deserves special mention; it is absolutely phenomenal. From the songs to the trailer, and even the words and lines that appear on screen, every detail feels thoughtfully crafted.<br/><br/>For me, this stands as one of the finest spy films I have seen in recent days,a complete cinematic experience in every sense. A real Spy Movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11037330/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029880",
              "author": {
                "username": {
                  "text": "paromondal"
                },
                "userId": "ur132168920"
              },
              "summary": {
                "originalText": "One of the best movies produced by Bollywood."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Everyone from the cast have cooperated together to produce one of the finest work present out in Bollywood. Aditya Dhar has done an incredible work - from directing to thinking up such a fascinating story that perfectly blends patriotism and the history of India. The actors, each one of them, have performed just amazingly.<br/><br/>The songs were justly rightly composed and placed at the correct moments. Such a great movie can only be produced only when everyone of the crew, on and behind the screen, all of them put their heart and soul.<br/><br/>I would recommend all of you to watch the movie and support such an extraordinary piece that has been gifted to us by Aditya Dhar. I would love to thank everyone in the crew for this absolute masterpiece - just thank you! Excited for Part 2: Revenge!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029880/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020499",
              "author": {
                "username": {
                  "text": "Birbalk-16"
                },
                "userId": "ur211644134"
              },
              "summary": {
                "originalText": "Best Spy Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Awesome story, screenplay and performances.. top of the line background music. Direction by Adiya Dhar is incredible abd the movie didn&#39;t feel like it&#39;s three hours 40 minutes long. I didn&#39;t get a single moment in the movie where I felt bored or my interest in the movie declines.<br/><br/>Above all, the music was fantastic."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020499/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016628",
              "author": {
                "username": {
                  "text": "aadhithyagopal"
                },
                "userId": "ur157336297"
              },
              "summary": {
                "originalText": "Best spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Here is a 300-word expanded version of your review, keeping the same tone but making it richer, smoother, and more impactful:<br/><br/>Don&#39;t watch this movie if you&#39;re expecting the usual Bollywood fantasy where the ISI suddenly becomes best friends with RAW, where national agencies shake hands like schoolchildren after a cricket match, or where the heroine randomly appears in a bikini for a beach song that has no connection to the story. If you&#39;re looking for villains who turn into comedians, heroes who defy gravity with cartoonish stunts, and a plot that treats espionage like a superhero comic, then this film is absolutely not for you.<br/><br/>But if you want to watch one of the most realistic, grounded, and uncompromising spy thrillers ever made in Indian cinema, then this movie is nothing short of a masterpiece. It doesn&#39;t sugar-coat geopolitics, it doesn&#39;t dilute the brutality of espionage, and it doesn&#39;t insult your intelligence with easy resolutions. Instead, it delivers a tense, gritty, and emotionally charged narrative that respects both the craft of filmmaking and the audience&#39;s maturity.<br/><br/>Every frame feels researched, every character feels lived-in, and every decision carries weight. The film shows espionage not as a glamorous profession but as a world filled with moral ambiguity, sacrifice, and constant danger. There are no superheroes here-only humans pushed to their physical and emotional limits.<br/><br/>The performances elevate the movie even further. The lead actor gives one of his most intense portrayals, carrying the story with raw vulnerability and controlled aggression. The supporting cast, especially the antagonist, adds layers that make the conflict feel chillingly real.<br/><br/>The direction, cinematography, and sound design work together to create an immersive world that pulls you into the tension and never lets you breathe easily.<br/><br/>In short: this is not just a movie, it&#39;s an experience-a rare spy thriller that prioritizes authenticity over spectacle. If you want reality, depth, and world-class storytelling, don&#39;t miss this film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016628/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015990",
              "author": {
                "username": {
                  "text": "rahulB-439"
                },
                "userId": "ur211607272"
              },
              "summary": {
                "originalText": "This movie is amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is different from other spy journal movie like spy universe. It is more realistic and I advice all person to watch. I like the Aditya dhar movie making style. The best part is that the second part is coming on 19 march 2026 and I will definitely going to watch this movie. Everything is in this good movie in details and it is a must watch film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015990/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007317",
              "author": {
                "username": {
                  "text": "knexxel"
                },
                "userId": "ur186448592"
              },
              "summary": {
                "originalText": "one of the best movie to be ever made"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The acting is good, especially by the lead actor, who brings charm and energy to the role. The supporting cast also adds fun moments. The music is decent and fits well with the mood of the film.<br/><br/>The pacing of the movie is mostly smooth, though a few scenes feel a little slow. Still, the overall experience is enjoyable. It&#39;s a light-hearted film meant for entertainment, not something to take too seriously."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007317/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007314",
              "author": {
                "username": {
                  "text": "shreyapatel-80156"
                },
                "userId": "ur123095351"
              },
              "summary": {
                "originalText": "Action, Drama, and a Star-Studded Powerhouse"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film opens with tension that grips immediately, gradually expanding into a complex web of political intrigue and crime. Ranveer Singh&#39;s performance is multifaceted, combining intelligence, physicality, and emotional nuance. Sanjay Dutt&#39;s commanding presence anchors the story, while Akshaye Khanna and R Madhavan bring thoughtful, layered portrayals that enhance narrative complexity. Arjun Rampal&#39;s subtle menace keeps viewers on edge, and Sara Arjun provides the emotional grounding that heightens stakes. Aditya Dhar&#39;s direction orchestrates pacing, suspense, and action with precision. Cinematography captures both sprawling landscapes and intimate human moments, while the score amplifies suspense. The second half&#39;s revelations and confrontations escalate tension to a gripping, emotionally charged climax."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007314/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029820",
              "author": {
                "username": {
                  "text": "stewendsouza"
                },
                "userId": "ur185791830"
              },
              "summary": {
                "originalText": "Theatre worthy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie deserves a theatre experience, it is just not a masterpiece for its screenplay and action, but the casting, the bg music and the dialogue.. Everything combined is an entertainment package. If it&#39;s too much of a nationalist movie.. Then it&#39;s more of a reason to watch however that&#39;s not the case it shows what is what.. And still can&#39;t die the entire truth."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029820/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012059",
              "author": {
                "username": {
                  "text": "amans-292"
                },
                "userId": "ur209109449"
              },
              "summary": {
                "originalText": "#blockbuster"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Blockbuster movie outstanding performance Akshaye Khanna and all actor hard working. Flim definitely blockbuster box office. Flim collect approx 1000 cr in india and break all records. If you do post content or submit material, and unless we indicate otherwise, you grant IMDb a nonexclusive, royalty-free, perpetual, irrevocable, and fully sublicensable right to use, reproduce, modify, adapt, publish, translate, create derivative works from, distribute, and display such content throughout the world in any media. You grant IMDb and its sublicensees the right to use the name that you submit in connection with such content, if they choose. You represent and warrant that you own or otherwise control all of the rights to the content that you post; that the content is accurate; that use of the content you supply does not violate this policy and will not cause injury to any person or entity; and that you will indemnify IMDb for all claims resulting from content you supply."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012059/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020187",
              "author": {
                "username": {
                  "text": "anshtrip-31981"
                },
                "userId": "ur132787262"
              },
              "summary": {
                "originalText": "PURE CENEMA+ Reality fusion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar stands out as an ambitious, often electrifying espionage thriller driven by standout performances and confident world-building. It is the kind of film that deserves to be experienced in a theatre: messy, provocative, and frequently brilliant, leaving you both shaken by its violence and moved by the humanity buried beneath the blood and smoke."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020187/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012788",
              "author": {
                "username": {
                  "text": "sspatil-21396"
                },
                "userId": "ur117322304"
              },
              "summary": {
                "originalText": "Dhurandhar Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Next level movie best cinematography and direction. Specially 26/11 scene. The best one I want to go once again for the movie. Best movie of 2025 and the best spy movie.<br/><br/>Next level movie best cinematography and direction. Specially 26/11 scene. The best one I want to go once again for the movie. Best movie of 2025 and the best spy movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012788/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013987",
              "author": {
                "username": {
                  "text": "Gauravr-6450"
                },
                "userId": "ur211593692"
              },
              "summary": {
                "originalText": "Review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just woww Dhurdhar is a remarkable and emotionally gripping masterpiece that leaves a lasting impact on every viewer. From its very first frame to the final moments, the film holds your attention with its raw realism, powerful performances, and deeply meaningful storytelling. What makes Dhurdhar stand out is its courage to explore human emotions and social truths without any filters. The narrative does not rely on unnecessary glamour or exaggerated drama; instead, it rises on the strength of honesty, sensitivity, and a profound understanding of life.<br/><br/>The characters are beautifully written, each carrying layers of depth and complexity. Their struggles, dreams, and internal conflicts feel incredibly real, making it easy for viewers to connect with them. The lead performance is exceptional-subtle yet intense-perfectly capturing the emotional weight of the story. The supporting cast also shines, giving life to every scene and enriching the film&#39;s atmosphere.<br/><br/>The direction of Dhurdhar deserves special praise. Every scene is crafted with purpose. The pacing is steady, allowing the audience to absorb the pain, hope, and beauty hidden in small moments. The cinematography enhances the storytelling with stunning visuals that feel both artistic and authentic. The music and background score are soulful, elevating the emotional experience of the film.<br/><br/>What truly makes Dhurdhar a masterpiece is its message. It challenges social norms, encourages self-reflection, and brings out the reality many choose to ignore. The film doesn&#39;t just entertain-it educates, inspires, and provokes thought. Even after the credits roll, its impact stays with the viewer.<br/><br/>In a world full of superficial content, Dhurdhar stands tall as a rare gem-bold, meaningful, and unforgettable. It is not just a film;"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013987/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012653",
              "author": {
                "username": {
                  "text": "navkishlay"
                },
                "userId": "ur122387129"
              },
              "summary": {
                "originalText": "A Masterstroke of Grit and Grace - \"Dhurandhar\" Redefines Indian Storytelling"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just a film-it&#39;s a force of storytelling that grips you from its very first frame. Every element, from the rugged landscapes to the haunting silences between characters, speaks of a director in complete command of his craft.<br/><br/>The narrative doesn&#39;t rush; it breathes, allowing each moment to build tension, emotion, and meaning. The ensemble cast elevates this film to powerhouse status, with each actor delivering career-defining turns.<br/><br/>Ranveer Singh commands the screen as the unyielding protagonist, channeling raw fury and vulnerability in a transformative performance that swings from explosive energy to heartbreaking subtlety-his best work yet.<br/><br/>Akshay Khanna brings chilling precision to his antagonist role, his steely gaze and measured menace making every scene crackle with dread.<br/><br/>Rakesh Bedi shines in a pivotal supporting part, infusing warmth and tragic depth that grounds the chaos with authentic emotional heft.<br/><br/>Sanjay Dutt roars back with gravelly intensity as the grizzled mentor figure, his presence a thunderous reminder of his enduring charisma. Arjun Rampal, brooding and magnetic, delivers a layered portrayal of conflicted loyalty that adds moral complexity, stealing scenes with his brooding physicality and quiet rage.<br/><br/>Technically, Dhurandhar is a visual triumph. The cinematography captures contrasts-light and shadow, chaos and calm-with poetic precision. The background score never overpowers; it heightens.<br/><br/>Together, they create an immersive experience that feels both intimate and epic. But where Dhurandhar truly excels is its storytelling. It fuses socio-political commentary with personal struggle, making you question what heroism really means in today&#39;s world.<br/><br/>There&#39;s an honesty here that&#39;s rare in contemporary cinema-gritty, unflinching, and profoundly moving.<br/><br/>Dhurandhar isn&#39;t a film you merely watch; it&#39;s a film you live through. It&#39;s cinema that dares to challenge, to move, and to stay with you long after you&#39;ve left the theatre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012653/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015749",
              "author": {
                "username": {
                  "text": "sudhanshubmwilcoin"
                },
                "userId": "ur155629945"
              },
              "summary": {
                "originalText": "The fire"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Superb movie, well edited.lovely music ,exceptional storyline. A movie which does not divulge a tiny bit from its plot. Best casting. Could have been shorter given the fact there is a second part coming up. A proper spy movie.<br/><br/>What sets it apart is the arch of protagonist as he rises in the hierarchy with single point mission on his mind."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015749/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11096918",
              "author": {
                "username": {
                  "text": "Heroman-7"
                },
                "userId": "ur212109151"
              },
              "summary": {
                "originalText": "perfecto"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those films that doesn&#39;t try to shout at you from the very first frame - instead, it slowly pulls you in and makes you stay. What I really liked is how grounded the movie feels. The story isn&#39;t overloaded with unnecessary twists; it moves at its own pace, letting the characters breathe and feel real.<br/><br/>The lead character is easily the backbone of the film. You can actually sense the weight he&#39;s carrying - the frustration, the small victories, the quiet anger. Nothing feels overly dramatic or &quot;movie-ish.&quot; Even the supporting characters have purpose, especially in the way they shape the main character&#39;s journey.<br/><br/>What surprised me most was the tone. It balances intensity with subtle humor and emotional moments without turning into melodrama. The dialogues feel natural, like conversations you&#39;d actually overhear in real life. And the direction deserves credit for keeping things controlled instead of flashy.<br/><br/>Visually, the film has a slightly raw look, which works really well. The background score doesn&#39;t overpower scenes; it gently pushes them forward. A few moments feel stretched, and there are places where you wish the pacing was tighter - but nothing that completely pulls you out.<br/><br/>Where Dhurandhar really wins is in its message. It doesn&#39;t preach, yet it leaves you thinking about choices, ego, pride, and the quiet battles people fight behind closed doors. When the credits roll, you don&#39;t feel &quot;wow, that was huge&quot; - instead, you feel a quiet satisfaction, like you just watched something honest.<br/><br/>Is it perfect? No. But it is sincere, well-acted, and meaningful - the kind of film that stays with you for a bit after you leave the theater.<br/><br/>If you like character-driven stories over loud action or forced comedy, Dhurandhar is definitely worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-04",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11096918/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007202",
              "author": {
                "username": {
                  "text": "Hriday-57"
                },
                "userId": "ur210717297"
              },
              "summary": {
                "originalText": "A world built on courage, chaos, and commanding acting"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tension hangs over every scene, compelling you to invest emotionally in both the characters and their perilous environment. Ranveer Singh carries the weight of the story effortlessly, his expressive range turning moral ambiguity into palpable suspense. The supporting cast adds subtle brilliance, grounding the narrative in authentic human conflict. Director Dhar&#39;s attention to detail is evident in the pacing, editing, and framing, making long sequences feel immediate and necessary. Action scenes are precise, dangerous, and visually stunning, while the score amplifies suspense and emotional resonance. The film&#39;s political undercurrents make it feel hauntingly relevant."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007202/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11098355",
              "author": {
                "username": {
                  "text": "Manas-862"
                },
                "userId": "ur212207737"
              },
              "summary": {
                "originalText": "No more Pakistan love"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is filled with bold scenes gore and drama which not fail to entertain, strongly holding Indian narrative but fails to lick Pakistan&#39;s fake agenda causing some Pakistan lover critics and creator stomachache which is fare enough reason for the hype of the movie. It met the expectations and entertain you well for more then 3 hours."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11098355/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11041595",
              "author": {
                "username": {
                  "text": "Abhi-592"
                },
                "userId": "ur200035041"
              },
              "summary": {
                "originalText": "Great spy movie."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping cinematic experience that keeps you engaged from the very first frame. The film brilliantly blends intense drama, powerful emotions, and strong storytelling, making it a thoroughly satisfying watch. The narrative is well-paced, with moments that hit hard and scenes that linger long after the credits roll.<br/><br/>The performances are a major highlight-each actor brings depth and authenticity to their role, making the characters feel real and relatable. The lead performance, in particular, stands out with a commanding screen presence and emotional intensity. The direction is confident and focused, ensuring that every scene serves a purpose.<br/><br/>Technically, Dhurandhar shines with impressive cinematography, impactful background music, and sharp editing that enhances the overall mood of the film. The dialogues are punchy and meaningful, adding weight to the story without feeling forced.<br/><br/>Overall, Dhurandhar is a powerful and well-crafted film that delivers both entertainment and substance. It&#39;s a must-watch for anyone who appreciates strong performances, engaging storytelling, and cinema that leaves an impact."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11041595/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11057038",
              "author": {
                "username": {
                  "text": "dilipkumarindiadk"
                },
                "userId": "ur193773123"
              },
              "summary": {
                "originalText": "A movie based on Indian Intelligence Bureau, Great Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is movie is the Great Example to show the power of India Intelligence Bureau and Agents deployed by IB for Security. However abusive words are used there but overall great movie.<br/><br/>Many movies can be made to show the power and influence of our Intelligence and Defence etc. . Looking forward to see more movies like these with some improvement.<br/><br/>Waiting for Dhurandar Part 2 Movie.<br/><br/>Enjoyed the Movie in PVR.<br/><br/>Thank You."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11057038/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006547",
              "author": {
                "username": {
                  "text": "naksh-94066"
                },
                "userId": "ur188334642"
              },
              "summary": {
                "originalText": "Action That Electrifies, Drama That Moves"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every sequence in this film is crafted to keep viewers invested, whether through quiet tension or explosive confrontations. The lead delivers a powerhouse performance, balancing vulnerability and resolve seamlessly. Action sequences are both realistic and cinematic, showcasing strategic combat and physical endurance. Cinematography highlights the underworld&#39;s brutality and beauty simultaneously, while sound design accentuates suspense without overwhelming. The political undertones add gravity, making the stakes feel immediate. Supporting characters are compelling, each contributing to the story&#39;s depth. The climax is cathartic yet unpredictable, leaving audiences stunned by the intelligence and boldness of the storytelling. This is cinema that lingers in your mind long after the credits roll."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006547/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012688",
              "author": {
                "username": {
                  "text": "saudagarnewera"
                },
                "userId": "ur189662089"
              },
              "summary": {
                "originalText": "Dhamakedar movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I wish the second part of this movie should come in 15 days, and the third part also should come in 15 days. Very good movie. Do watch this movie. They have seen all the realities what is exactly happen to India from Pakistan. Many decades. Bollywood is on the fire now same movie should be taken out."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012688/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11100135",
              "author": {
                "username": {
                  "text": "shashwatshashwat-60720"
                },
                "userId": "ur148275836"
              },
              "summary": {
                "originalText": "Definition of Perfection."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie has everything: Music, Drama, Suspense, Plot, Story, Acting, Love Story, Action, Trust &amp; Betrayal, and no scene was a waste. Every song was on point. Direction, cinematography, set, clothing, casting, pace &amp; script tightness was also great. This is a perfect package of a movie. Equal kudos to Bedi sir playing Jameel Jamali &amp; Donga."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11100135/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023816",
              "author": {
                "username": {
                  "text": "dwivedishivam-48596"
                },
                "userId": "ur122276464"
              },
              "summary": {
                "originalText": "faad movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch , great acting. Ranveer did a brilliant job and all the other actors also performed good . The song and the action are too good ..watch it and try to be fair.<br/><br/>The incident shown in the movie are inspired from true event and has been trying to be fair and all the fast is\ngood and geniune."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023816/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012885",
              "author": {
                "username": {
                  "text": "Divyanshu_M"
                },
                "userId": "ur150678856"
              },
              "summary": {
                "originalText": "This Film Belongs to the Big Screen. Period!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If I had to sum up my experience in just a few words, I&#39;d call it one hell of a cinematic ride - powered by some of the finest actors in the industry. There are films that demand to be witnessed on the big screen, where you can truly feel the fervour, the frenzy, and those adrenaline spikes that no home setup can ever replicate. It may be a long film by every measure, but it grips you throughout, never once giving you a reason to leave your seat. Every actor not only fits their role but elevates it, delivering performances that do full justice to the story."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012885/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}