{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6pbbktazcwzy472xx7obqrtu4ybrt2ikt74hkalaomqbdf4skydk2oe2vlmryoabaimxi5ymep4ojtiqsvgnv76ma",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11007630",
              "author": {
                "username": {
                  "text": "harshawasthi90"
                },
                "userId": "ur51766089"
              },
              "summary": {
                "originalText": "A must watch - Best spy thriller bollywood has ever offered."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film runs for 3.5 hours, yet not for a moment does it lose momentum. It holds your attention with an almost hypnotic grip.<br/><br/>Special praise for the BGM. The way it blends with the narrative rhythm, and the way it rises and recedes with the tension, is genuinely masterful.<br/><br/>Outstanding performances\nMost compelling performances, in order:<br/><br/>Arjun Rampal - Major Iqbal\nRakesh Bedi - Jameel Jamali\nAkshaye Khanna - Rehman Dakait\nRanveer Singh - Hamza Ali Mazhari\nMadhavan - Ajay Sanyal<br/><br/>The tight close-up shots, especially the ones capturing Ranveer Singh&#39;s micro-expressions, are brilliantly executed.<br/><br/>The production design feels remarkably authentic. Even the green-screen sequences have a level of realism rarely seen in mainstream cinema.<br/><br/>What I particularly appreciate is the film&#39;s unapologetic portrayal of Pakistan and the ISI.<br/><br/>This is a refreshing change from the sanitised, commercially driven narratives seen in Jawan, Ek Tha Tiger, and similar franchises.<br/><br/>When the film ended,\nit genuinely caught me off-guard.<br/><br/>It felt as though I did not want it to conclude, because the rising momentum had created such an immersive flow.<br/><br/>Please watch it.<br/><br/>Support it.<br/><br/>Make it a blockbuster,<br/><br/>so that more filmmakers gain the confidence to attempt bold and uncompromised storytelling..."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007630/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007402",
              "author": {
                "username": {
                  "text": "chidanandapurohit"
                },
                "userId": "ur168258133"
              },
              "summary": {
                "originalText": "Master piece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A gripping film with solid performances and\nengaging story. Knowing a bit about Ajit\nDoval and other characters before watching makes it even better.&quot;Dhurandhar I Like It&quot; is a brilliantly crafted track that delivers pure entertainment from start to finish. The song blends catchy beats with energetic vocals, making it instantly memorable. Its rhythm is addictive, and the overall vibe keeps you hooked throughout. The production quality is top-notch, and the music perfectly matches the lively mood of the lyrics. Whether you&#39;re listening casually or adding it to a party playlist, this song never disappoints.<br/><br/>Definitely worth a watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007402/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007590",
              "author": {
                "username": {
                  "text": "shivaniijain"
                },
                "userId": "ur154427203"
              },
              "summary": {
                "originalText": "The Ultimate Star-Studded Action Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film grips you from the very first scene, with tension that never lets up. Ranveer Singh delivers a career-defining performance, seamlessly blending intensity and vulnerability. The supporting cast, especially the seasoned character actors, add depth to every scene, making the underworld feel disturbingly real. Director Dhar&#39;s vision is meticulous, crafting sequences that are as visually stunning as they are narratively significant. The action is precise, brutal, and narratively justified, while the background score amplifies the suspense at every turn. Cinematography captures both the grimy underworld and fleeting moments of tenderness with equal brilliance, making the movie a complete cinematic experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007590/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020756",
              "author": {
                "username": {
                  "text": "sunilkumarpandey-43317"
                },
                "userId": "ur166836376"
              },
              "summary": {
                "originalText": "Just Wow...real acting real action Real Hero of Our Nation."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I have watched it with my 5 friends in which one has repeatedly watched it on second Time with us. Great movie Must watch. Ranveer Singh has played as much as raw role he had done before... Akshay Khanna has done acting with expressions more than other have done with their dialogues. Must watch may be you will also want to watch again."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020756/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022470",
              "author": {
                "username": {
                  "text": "rpurbasha"
                },
                "userId": "ur96650039"
              },
              "summary": {
                "originalText": "3 hours felt less !"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping, high-octane spy thriller that completely absorbs you into its world. Despite its massive runtime of nearly 3 hours 30 minutes, the film never feels exhausting-in fact, it feels too short. Stellar performances, tight direction, and a constantly escalating narrative keep the tension alive throughout. The film balances scale with substance, making every scene count. Dhurandhar isn&#39;t just watched; it&#39;s experienced-and when it ends, you&#39;re left wanting more."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022470/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018199",
              "author": {
                "username": {
                  "text": "beluga69"
                },
                "userId": "ur166686011"
              },
              "summary": {
                "originalText": "Dhurandhar - A Pulse-Pounding Masterpiece That Redefines the Spy Genre"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Forget everything you think you know about Indian spy thrillers-Dhurandhar isn&#39;t just another entry in the genre; it&#39;s a seismic shift. Directed with surgical precision by Aditya Dhar, this film merges raw realism with cinematic grandeur, delivering a story that&#39;s as emotionally resonant as it is relentlessly intense.<br/><br/>From the opening frame, Dhurandhar grips you with its authenticity. Shot with a documentary-like grit yet layered with poetic tension, the film weaves through shadowy terror networks, volatile gang rivalries, and moral gray zones-never once sacrificing heart for hype. The screenplay unfolds like a ticking time bomb: deliberate, coiled, and devastatingly effective. Each scene adds weight, not just to the plot, but to the souls of its characters.<br/><br/>Ranveer Singh delivers a career-defining performance-transformative, restrained, and electrifying. He doesn&#39;t just play his character; he becomes him, erasing every trace of stardom to embody a man caught between duty and despair. The supporting cast is nothing short of phenomenal: Akshaye Khanna&#39;s chilling precision, Sanjay Dutt&#39;s weathered gravitas, Arjun Rampal&#39;s quiet intensity, and R. Madhavan&#39;s nuanced resolve all elevate the narrative. Even in brief appearances, actors like Sara Arjun and Manav Gohil leave lasting impressions-proof of the film&#39;s meticulous casting.<br/><br/>One sequence, in particular, lingers long after the credits: a harrowing attack rendered in blood-red hues, underscored by ghostly voice recordings that send shivers down your spine. It&#39;s bold, haunting, and emblematic of Dhar&#39;s fearless storytelling-where sound design, color, and silence speak as loudly as dialogue.<br/><br/>Dhurandhar is more than a movie-it&#39;s an experience. Best watched in a dark theater with an audience holding its breath. And that ending? Pure cinematic bait. March 2026 can&#39;t come soon enough.<br/><br/>Verdict: 10/10 - Not just the best film of 2025 so far, but a new benchmark for Indian cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018199/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013618",
              "author": {
                "username": {
                  "text": "abhishekkumar-86904"
                },
                "userId": "ur128642795"
              },
              "summary": {
                "originalText": "A must watch for everyone who wants to know how spy works"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best Indian spy thriller till now, unlike the fake love story spy thrillers like ek tha tiger series or pathan.<br/><br/>Great direction showing all the details of terrorist country, which is based on true incidents which has happened inside india, and how a country retaliate.<br/><br/>Great performance by all the actor."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013618/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004937",
              "author": {
                "username": {
                  "text": "Aman1SharmaJii"
                },
                "userId": "ur109726440"
              },
              "summary": {
                "originalText": "Style, Substance, and Sharp Storytelling"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched Dhurandhar today, and honestly, it&#39;s a film that pulls you in slowly and then refuses to let go.<br/><br/>What really works in the film is the way the story moves forward chapter by chapter. Each character is introduced with care, and their backstories are given enough time to breathe. That buildup pays off, because as the film progresses, the plot becomes more intense and aggressive in its own quiet way.<br/><br/>Akshaye Khanna is the real star of the show. His performance is restrained, sharp, and deeply engaging-he owns every scene he&#39;s in. Ranveer Singh, on the other hand, is decent but familiar. There are shades of his earlier work, especially Padmaavat. That said, his emotional moments are strong, and he delivers well when the film demands intensity.<br/><br/>The theatre experience adds a lot to the vibe. The background score, the retro songs, and the overall sound design hit the right notes and elevate many scenes. Sanjay Dutt&#39;s character, however, feels a bit repetitive. It&#39;s a role we&#39;ve seen him play before-the tough, authoritative figure-and it doesn&#39;t offer much that&#39;s new.<br/><br/>A big surprise for me was the Pakistan-set portions. Among all the characters, Arjun Rampal stands out with the most convincing accent. He isn&#39;t perfect in every scene, but his consistency makes a difference. R. Madhavan is another major highlight. As the narrator, he brings depth and calm to the storytelling. His subtle hints toward the idea of a &quot;new India&quot; reflect Aditya Dhar&#39;s worldview, something we&#39;ve seen in his previous work as well.<br/><br/>The post-credit scene is a treat and leaves a strong impact. And the final fight sequence featuring Ranveer Singh is completely unexpected it&#39;s raw, intense, and adds a powerful closing note to the film.<br/><br/>Overall, Dhurandhar is a well-packaged theatrical experience with strong performances, a gripping narrative style, and moments that stay with you after the credits roll. It&#39;s not perfect, but it&#39;s engaging, confident, and definitely worth watching on the big screen."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004937/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11065103",
              "author": {
                "username": {
                  "text": "avinash-hedaoo24"
                },
                "userId": "ur26283527"
              },
              "summary": {
                "originalText": "Thunderous cinematic experience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a thunderous cinematic experience that grips you from the first frame and never loosens its hold. Crafted with confidence and scale, the film blends raw emotion, high-voltage action, and a compelling narrative into a thoroughly satisfying spectacle.<br/><br/>🔥 Powerful Performances\nThe cast delivers tour-de-force performances-intense, layered, and deeply immersive. Every character feels purposeful, and the emotional beats land with conviction, making the journey as heartfelt as it is thrilling.<br/><br/>🎬 Masterful Direction &amp; Storytelling\nThe direction is sharp and assured, balancing pace with poignancy. The screenplay keeps you hooked with well-earned twists and a strong thematic core, ensuring the drama resonates beyond the action.<br/><br/>💥 Action That Packs a Punch\nStylish yet grounded action set pieces elevate the film&#39;s energy. Each sequence is choreographed with clarity and impact, serving the story rather than overpowering it.<br/><br/>🎶 Music &amp; Technical Brilliance\nA rousing background score amplifies the film&#39;s intensity, while cinematography and sound design add polish and scale-making every moment feel cinematic and immersive.<br/><br/>🏆 Final Verdict\nDhurandhar stands tall as a bold, electrifying entertainer-emotionally rich, technically accomplished, and immensely engaging. A must-watch for audiences who crave powerful storytelling wrapped in grand cinematic flair. ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11065103/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036301",
              "author": {
                "username": {
                  "text": "dr-hgj2006"
                },
                "userId": "ur37126812"
              },
              "summary": {
                "originalText": "Enjoy the film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "10/10<br/><br/>Its read between the lines film, Open Media, there are some National and Inter National Security Issues.. so the greed to praise DIRTY GAMES play in enemy country by infiltrating our Macho Man. The form may depend upon life sentenced , War Criminals , Volunteers who are full of Deshbhakti and they donot want to confined to Jail or Isolation. So trick them in enemy country and let them be a part and join the Bhai log... In future they may serve some important info and would be helpful. W. Churchil also made One big and Israel is known to create a special under ground Squadron to woo trap Germany militants. Chanakya did in his days making VISH KANYAS... Here Ranbir in Pak Background at Karanchi infiltrated to be a gang of Karanchi. Rehman Gang. Some real , some filmy material added but a straight line story made. A wonderful performance by Ranbeersinh, Akshay Khanna , Sanjay Datt , A. Rampal and a pretty lady heroign plus all most all did lethal job descently. Some where even better / equivalent to Western Hollywood stunts. Do not miss. Actors get up is slightly hinting the current personality so the reactions actually serve publicity... The film is Running high... and see the trick. Balochistan and Western Punjab Muslims are not tuned well. A Baloch Sardar is used.. ISI some live footage of nov Bombay attack, Kandhar Hijack are other decorated pieces. Heroin in White dress has a very charming look. Enjoy the film\nDr h g joshi."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036301/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019645",
              "author": {
                "username": {
                  "text": "AnavB-1"
                },
                "userId": "ur211638598"
              },
              "summary": {
                "originalText": "Amazing movie against terrorism"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Very good movie. The story follows an Indian intelligence operation aimed at infiltrating and dismantling powerful criminal and terrorist networks across the India-Pakistan border. The narrative draws inspiration from real events linked to Indian intelligence actions and major incidents like the 1999 IC-814 hijacking and the 2001 Indian Parliament attack, giving it a gritty, realistic edge."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019645/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013476",
              "author": {
                "username": {
                  "text": "bodapatisaidhanesh"
                },
                "userId": "ur194890822"
              },
              "summary": {
                "originalText": "Political action drama which peaked the Art of griping the Audience's focus."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Like I said, Dhurandhar really succeeded in keeping me invested in the story for more than 3 hours. Animal and RRR achived this before. Every single actor was amazing including Donga and Zalina(i am not talking about others because millions already spoke fot them). Madhavans entry shots were just breathtaking. Beautiful sets and natural locations added an authenticity which was parallel to RRR. Music will keep u pumped where required. And Hamza is no less of Diamond. Great story,music and Action."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013476/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11092984",
              "author": {
                "username": {
                  "text": "jagendras-2"
                },
                "userId": "ur212173807"
              },
              "summary": {
                "originalText": "Loved it"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "For me it&#39;s a very good movie it was my first time at cinema hall and the movie made it worth it , it&#39;s time duration is long which didn&#39;t came to my mind while I was watching the movie. Absolutely loved it. The acting was good ,the casts were good, the story was fantastic. There was nothing cringe in that."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-03",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11092984/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031863",
              "author": {
                "username": {
                  "text": "shishirtanwar"
                },
                "userId": "ur53428019"
              },
              "summary": {
                "originalText": "Amazing!!! Aditya Dhar is the best writer director of present times!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is the only Hindi Movie that made me come and rate and drop a review here.<br/><br/>There is gore in the movie but hey, it is A rated.<br/><br/>It is a masterpiece when it comes to writing, cinematography (and those cuts on each chapter, my god). So much so that it overpowers the performances of all the amazing cast, and they were all amazing :)<br/><br/>Without blabbering too much I can say what the trailer says is true &quot;You are not ready for this&quot;.<br/><br/>After watching some consistent idiotic spy movies (you can search and thank YRF mostly), it is a pretty badass and sleek surprise."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031863/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11021164",
              "author": {
                "username": {
                  "text": "prashantsoni-95475"
                },
                "userId": "ur101192459"
              },
              "summary": {
                "originalText": "Most Realistic Bollywood Movie Ever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar isn&#39;t just a movie - it&#39;s an experience. Honestly, I absolutely loved it. From the first scene to the last frame, it had me fully locked in. The story, the acting, the moments... everything just hits. It&#39;s the kind of film that makes you forget you&#39;re watching a movie and pulls you straight into its world.<br/><br/>The performances are top-tier, the emotions land perfectly, and the overall vibe is just unbeatable. I&#39;ve watched so many films, but this one? This one stands out. It&#39;s easily one of the best movies ever for me.<br/><br/>If someone hasn&#39;t watched it yet, they&#39;re seriously missing out."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11021164/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015056",
              "author": {
                "username": {
                  "text": "KartikM-901"
                },
                "userId": "ur211601136"
              },
              "summary": {
                "originalText": "Bawaaaaaal"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Never ever in my life I watched such kind of film. Yes it&#39;s not biopic but a truly fantasy. I loved the idea it is not real. This film deserves to be in oscar. This fim is what I think gonna break the limitations of creativity bollywood industry has ever presented. May be that&#39;s the reason why all are criticizing it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015056/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010883",
              "author": {
                "username": {
                  "text": "Ankuuu-04"
                },
                "userId": "ur211568736"
              },
              "summary": {
                "originalText": "BEST MOVIE OF THE YEAR!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Love the plot and characters Played by actors best Bollywood movie I&#39;ve been watched in the years.aditya dhar did a great work,loved hi Direction and writing.<br/><br/>#dhurandhar. #adityadhar #ranveersingh #sunjaydutt #arjunrampal #akshaykhanna<br/><br/>All my favourite actors did a great work in this movie,\nEveryone should watch it in theatres."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010883/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004921",
              "author": {
                "username": {
                  "text": "Ashutosh_Bunty"
                },
                "userId": "ur201964207"
              },
              "summary": {
                "originalText": "Insane and Engaging"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "They pulled off a spy movie with the realism of an actual spy, portraying different aspects of the India-Pakistan conflict and terrorism.<br/><br/>Story: This part follows the journey of Hamza (Ranveer) as he silently infiltrates the mafias and political networks of Pakistan. The movie is divided into eight chapters. The runtime will not bother as the story is very engaging.<br/><br/>Note: There is a only a mid credit scene, no post credit scene."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004921/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013909",
              "author": {
                "username": {
                  "text": "prashantchem"
                },
                "userId": "ur159161032"
              },
              "summary": {
                "originalText": "Bollywood has got its Martin scorsese"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "T&#39;s a pure 24 carat gold cinema, This man Aditya has a flair of Ridley Scott, Martin Scorsese &amp; Tarantino. A movie long enough of mini web series and still you feel that it is over in a blink.....wow imagine the talent of this man. Every shot is curated and crafted like an impeccable dexterity and it holds you from your neck so you can&#39;t even deflect your neck for a microsecond. DHAR even went underutilising his talent in many scene because of keeping in mind the length of movie. He crafted a cinema where in front of camera nobody is superstar or megastar and each frames speaks on the merit of scene and script. It&#39;s a Francis ford copala moment for Bollywood where a new craftsman has emerged."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013909/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018336",
              "author": {
                "username": {
                  "text": "vishals-2584"
                },
                "userId": "ur211627170"
              },
              "summary": {
                "originalText": "Mind blowing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Mind blowing movie that shown actual fact about our Indian hero who was in mission in Pakistan . The story shown that in Pakistan how they acted in 26/11 attack and how they plan to attack it&#39;s all about the true events it&#39;s shaken the whole body after the act done by those culprits . Jai hind jai bharat."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018336/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008761",
              "author": {
                "username": {
                  "text": "AnkitD-433"
                },
                "userId": "ur211557852"
              },
              "summary": {
                "originalText": "Every Indian Should watch this"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Everyone should know what&#39;s happening in the country this movie is mirror to the world who is the enemy of humanity I&#39;m shocked every person should watch this movie. In this era bollywood have lost its way but aditya dhar brought the life back in bollywood. This is amazing i&#39;m not a lover of bollywood movies because of cheap writing and acting but this movie is perfect BTW i&#39;m web series lover."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008761/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025899",
              "author": {
                "username": {
                  "text": "shaktisuresh"
                },
                "userId": "ur114573120"
              },
              "summary": {
                "originalText": "Wonderfully executed"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A wonderful movie.<br/><br/>Thrilling, exhilarating and every other synonymous adjective isn&#39;t enough to describe it.<br/><br/>The violence and gore was as realistic as it could be with great action sequences.<br/><br/>I believe it also shows a side of politics debated about with people knowing a paltry number of facts with people in the real world acting as if they know it all.<br/><br/>On point casting with great mastery of acting shown by all actors.<br/><br/>Kudos to the entire team of Dhurandhar and special mention to Mr. Dhar for directing, writing and producing this movie!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025899/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029602",
              "author": {
                "username": {
                  "text": "anushkapatil-30276"
                },
                "userId": "ur113062070"
              },
              "summary": {
                "originalText": "Must Watch!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I don&#39;t usually leave reviews, but this one truly deserves it. This film is a complete cinematic experience-engaging from start to finish. Despite its length, not a single moment feels dull. Watch it for the powerful performances, spot-on casting, compelling story, sharp direction, thrilling action, and an exceptional background score."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029602/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11075757",
              "author": {
                "username": {
                  "text": "HarshP-178"
                },
                "userId": "ur212067249"
              },
              "summary": {
                "originalText": "Perfect Spy Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a cinematic masterpiece! Every frame delivers power and precision. The background score elevates every emotion, while the acting, casting, story, and direction blend flawlessly........ A perfect 10/10 in every aspect-cinema at its finest!!!!!!<br/><br/>Background Score - 10 out of 10\nActing - 10 out of 10\nCasting - 10 out of 10\nStory - 10 out of 10\nDirection - 10 out of 10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-30",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11075757/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011484",
              "author": {
                "username": {
                  "text": "luckysajid-58876"
                },
                "userId": "ur194583647"
              },
              "summary": {
                "originalText": "Can I review 20???"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is insane, such a extraordinary material it is, and Mainly Akshaye Khanna OMG, Ranveer Singh, after Padmaavat, we got him &amp; same with Sanjay Dutt, after kgf we saw him just in his that character. Excellent movie this is, and salute to the director Aditya Dhar and bro bgm&#39;s and songs, just insane.<br/><br/>Just just watch this."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011484/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}