{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6bdzntazcwzy47wxxvnrzrhtmocb33yktz7xna3b6mqbdf4skydkto4yv7nzyoaezrg35rs52fzqzfghp5hhpro5q",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11013840",
              "author": {
                "username": {
                  "text": "SohamC-22"
                },
                "userId": "ur211592215"
              },
              "summary": {
                "originalText": "Real and authentic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I am not a regular reviewer, but I really enjoyed the movie. The authenticity, the music and the thrill just got me. A must watch for everyone. Whosoever says it is bad, understand they don&#39;t want you to see the reality. I actually went to watch Ranbir Singh, surprisingly became a fan of Akshay Khanna. His entry music was just great !!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013840/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11079195",
              "author": {
                "username": {
                  "text": "jagadishseervi"
                },
                "userId": "ur168372030"
              },
              "summary": {
                "originalText": "Dhurandhar was peak"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Wached dhurandhar and all actors acting was outstanding performance Ranveer singh outstanding performance and Akshay khanna has villain role was outstanding and sanjay dutt enter with hawa hawa song was fantastic loved it and Dhurandhar all songs are banger and action is raw and real and it was amazing 26/11 scene with recording I was angry and sad I search that Pakistani isi was involved in this attack and this is how you present a spy thriller movie with real incident hands of to Aditya dhar showing👏 and in climix car screen with title track was goosebump scene and Excited for Dhurandhar part 2 face of hamza vs major iqbal and who is bade sahab Dhurandhar is peak movie. And salute to real agent of India Jay hind."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-31",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11079195/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11071467",
              "author": {
                "username": {
                  "text": "nihalg-29559"
                },
                "userId": "ur155963940"
              },
              "summary": {
                "originalText": "Mind-blowing - amazing direction, cinematography"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best indian movie i have ever seen ...cant wait for dhurandhar 2...even after 3:30 hour i was asked to was more 4 hour i was happily willing for it... immersive experience,songs were also mind-blowing. URI SURGICAL STRIKE 2nd favorite now.jaskeerat singh rangi and salute to ADITYA DHAR for providing references of fact shown."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11071467/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018134",
              "author": {
                "username": {
                  "text": "tarinis-03"
                },
                "userId": "ur211625380"
              },
              "summary": {
                "originalText": "What a movie!!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s such an amazing movie! Plz go and watch this movie. What an artpiece! In fact my muslim friends who hate Pakistanis and their inside politics also loved this movie. The movie exactly shows why our own indian muslims so different from that of chhapri pakistan! How brutal Pakistanis are for their people! Bollywood ke G**** m dam nahi h to callout things as is! Pls go n watch, how easily will 3.5hours go you won&#39;t feel it. Pls don&#39;t trust these paid critics! Evils in our society/country shown in movies like Parzaniya or Dhadak 2 is easily accepted by Critics and Bolly*** but not this reality based movie! Pls go n watch and love our country and their muslims! U will get to compare our people from porkistanis..Jai Hind!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018134/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028072",
              "author": {
                "username": {
                  "text": "Trusha-7"
                },
                "userId": "ur211702693"
              },
              "summary": {
                "originalText": "Excellent excellent excellent movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Loved every scene of the movie. Reality at its peak. I have never enjoyed any so long movie before but in Dhurandhar I was just stuck to chair<br/><br/>Every actor has done justification to theor role and Aditya Dhar is love\nThis is big slap to movies like Pathan and Tiger Spy is not fancy life Reality is\nDifferent."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028072/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11044097",
              "author": {
                "username": {
                  "text": "galandeaniket-39572"
                },
                "userId": "ur128963402"
              },
              "summary": {
                "originalText": "Full of serious action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is filled with world class action. Severe violence, Extreme I must say, crossing all the limits that Bollywood had ever portrayed. I dnt understand they muted certain bad words but they forgot to mute some. Every actor performed very well. Many scenes were missing that was shown in the trailer. Sequel is expected in March 2026."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11044097/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023252",
              "author": {
                "username": {
                  "text": "suneel-n10"
                },
                "userId": "ur51138073"
              },
              "summary": {
                "originalText": "Amazing movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The title, plot, direction, BGM &amp;music everything good, brave realistic way to present it in raw way, this movie has proved that a bollywood movie can be realistic and real story as itbis than showing ISI girl romancing with Indian spy &amp; rogue army man, my only criticism why Chimbram &amp; his sons face not shown."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023252/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11054701",
              "author": {
                "username": {
                  "text": "ltejas"
                },
                "userId": "ur34057648"
              },
              "summary": {
                "originalText": "squeaky blunder"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Showing burning embers each of the 35 times a cigarette is lit on screen isn&#39;t photography. It&#39;s creative bankruptcy.<br/><br/>Using real footage of covered events to manufacture emotion is prosaic direction.<br/><br/>And dumping onto the screen all 3.5 hours of what you shot is lazy, insensitive editing.<br/><br/>This Dhurandhar is a squeaky blunder."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-25",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11054701/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004600",
              "author": {
                "username": {
                  "text": "Faridad-87"
                },
                "userId": "ur211425003"
              },
              "summary": {
                "originalText": "Netflix"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This would be an amazing 10 episodes Netflix series.missed a golden opportunity.<br/><br/>AAkshay khanna was a best performer, check it out if you like Pakistan underworld and politics<br/><br/>Slow pace drama movie<br/><br/>Story 7/10\nActing 8/10\nDirecting 7/10 some scenes were so fake and laggy Ai generated can it look more realistic lol."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004600/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11045382",
              "author": {
                "username": {
                  "text": "moturiaditya"
                },
                "userId": "ur189259974"
              },
              "summary": {
                "originalText": "Dhurandhar the beast of movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar: The Beast is a gritty action-drama that blends raw physical power with deep emotional conflict. The film centers on Dhurandhar, a feared and misunderstood man whose brute strength and violent reputation have earned him the label of a &quot;beast.&quot; Raised in an environment of cruelty, injustice, and survival, Dhurandhar grows into a lone warrior shaped by pain rather than compassion. Society sees him as a monster, but beneath his ferocity lies a man struggling with his humanity.<br/><br/>The story unfolds as Dhurandhar becomes entangled in a corrupt system ruled by ruthless criminals and power-hungry elites. His uncontrollable rage makes him a weapon-used by others or hunted when he refuses to submit. While his actions are often brutal, they are driven by a strong moral instinct to protect the weak and punish oppressors. This internal contradiction-violence versus justice-forms the emotional core of the film.<br/><br/>As the plot progresses, Dhurandhar is forced to confront his past, including betrayals that turned him into what he is. A key relationship-whether with a loved one, mentor, or innocent victim-begins to awaken his suppressed emotions, challenging the idea that he is beyond redemption. The film explores whether a man branded as a beast can reclaim his soul, or if destiny has already sealed his fate.<br/><br/>The climax delivers intense action and emotional resolution as Dhurandhar faces the ultimate choice: embrace the beast within to destroy evil, or sacrifice himself to end the cycle of violence. Dhurandhar: The Beast is ultimately a story about identity, redemption, and the thin line between man and monster, questioning who the real beasts are in a corrupt world."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11045382/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11074007",
              "author": {
                "username": {
                  "text": "SakshamR-03"
                },
                "userId": "ur206893768"
              },
              "summary": {
                "originalText": "One in a Light years Film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a bold, uncompromising film that hits with clarity and conviction and Reality. It doesn&#39;t shy away from hard truths-exposing terrorist networks and the machinery that enables them with rare cinematic courage. The film refuses false neutrality and instead presents a gripping, grounded narrative that feels urgent and necessary.<br/><br/>Strong performances, tight pacing, and fearless storytelling make Dhurandhar stand out. This is cinema with purpose-impactful, intense, and unforgettable."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-30",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11074007/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016770",
              "author": {
                "username": {
                  "text": "avinashshivpuri"
                },
                "userId": "ur170503307"
              },
              "summary": {
                "originalText": "Superb"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Class content. Your Dhurandhar is one of those rare films that not only entertains you from the very first frame but also leaves a powerful impact that stays long after you exit the theatre. It is a refreshing blend of thrilling storytelling, emotional depth, and unforgettable characters. Directed with precision and passion, the movie captures the essence of ambition, loyalty."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016770/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022714",
              "author": {
                "username": {
                  "text": "Harshalp-732"
                },
                "userId": "ur211554265"
              },
              "summary": {
                "originalText": "Unapologetic, Hard hitting movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening shot to the final frame, Dhurandhar is a cinematic triumph that redefines what a modern Indian action-drama can achieve. The film weaves intense emotion, razor-sharp storytelling, and breathtaking visuals into a seamless experience that grips you from start to finish. What sets Dhurandhar apart is its perfect balance - every element feels deliberate and masterfully crafted. The writing is taut, the pacing relentless, and the dialogues strike deep without ever feeling overdone. The direction deserves special praise for maintaining both scale and intimacy, giving every moment emotional weight even amidst high-octane sequences. The lead actor delivers a powerhouse performance, embodying both the raw physicality and emotional depth the role demands. The supporting cast complements him beautifully, each character adding a distinct flavor to the narrative. The score is electrifying yet soulful, elevating key scenes to near-mythic intensity. Visually, the film is stunning - every frame looks like it was painted with purpose. Whether it&#39;s the gritty streets or the majestic aerial shots, cinematography and color grading combine to heighten the story&#39;s realism and grandeur. In an era filled with formulaic blockbusters, Dhurandhar stands out as smart, heartfelt, and unapologetically bold. It&#39;s more than a film - it&#39;s an experience. A solid 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022714/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11048816",
              "author": {
                "username": {
                  "text": "anirudhathreya-54212"
                },
                "userId": "ur112429047"
              },
              "summary": {
                "originalText": "Good movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ranveer is back...After a long time watched a good hindi movie. Being a Ranveer fan, it&#39;s a feast for me and I am going to watch 2nd time this week. Ranveer is back...After a long time watched a good hindi movie. Being a Ranveer fan, it&#39;s a feast for me and I am going to watch 2nd time this week......"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11048816/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11048744",
              "author": {
                "username": {
                  "text": "dixit9"
                },
                "userId": "ur35380580"
              },
              "summary": {
                "originalText": "Movie Review: Dhurandhar - A Masterclass in Gritty Storytelling"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just a movie; it is an immersive experience that commands your attention from the very first frame. Directed by Aditya Dhar, this political spy thriller takes a complex, multi-layered story and simplifies it into a gripping narrative that keeps the audience hooked for over three hours.<br/><br/>The Performance: A Tale of Two Halves\nThe film&#39;s greatest strength lies in its character arcs.<br/><br/>The First Half (Akshaye Khanna&#39;s Territory): Akshaye Khanna delivers a powerhouse performance that reminds us why he is one of the finest actors in the industry. He centers the movie with a calm yet terrifying intensity.<br/><br/>The Second Half (The Rise of Ranveer Singh): The transition is seamless. As the story evolves, the focus shifts beautifully toward Ranveer Singh. He brings a raw, subdued energy that perfectly balances the earlier chapters, proving his versatility in a more restrained role.<br/><br/>The Supporting Cast: Veteran actors like Rakesh Bedi add significant depth. In a film with so many characters, every role feels essential and meticulously detailed, a testament to Dhar&#39;s vision.<br/><br/>Direction &amp; Craft\nMost directors struggle with large ensembles and long runtimes, often losing the thread in the second act. However, Aditya Dhar maintains a &quot;masculine spine&quot; throughout the film. The world-building-recreating the gritty atmosphere of Karachi&#39;s Lyari-is textured and believable.<br/><br/>The Technical Edge\nMusic: The soundtrack by Shashwat Sachdev is &quot;spot on.&quot; From the high-energy title track to the clever use of 80s and 90s nostalgia, the music acts as a lead character itself, driving the psychological tension of the film.<br/><br/>Impact: This is the kind of cinema that stays with you. It doesn&#39;t rely on over-the-top action but on realistic, grounded confrontation that sparks deep discussion long after the credits roll.<br/><br/>The Verdict: Dhurandhar is a &quot;quantum leap&quot; for Indian cinema. It is rare to see a film handle such scale with so much heart and precision."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11048744/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010018",
              "author": {
                "username": {
                  "text": "aritra_jana"
                },
                "userId": "ur187709751"
              },
              "summary": {
                "originalText": "Dhurandhar = Total Mass + Solid Class! Akshaye Khanna just stole the whole show! 🔥🎬"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an absolute cinematic blast! The film runs for 3 hours 30 minutes, but not for a single moment does the duration feel stretched - the gripping pace and tight storytelling keep you glued to the seat.<br/><br/>While Ranveer Singh is the official lead and gives a powerful performance, it&#39;s Akshaye Khanna who truly steals the show. His screen presence, dialogue delivery, and layered expressions make every frame he&#39;s in feel electrifying. Arjun Rampal and Sanjay Dutt also deliver brilliant performances, adding depth, style, and menace to the film.<br/><br/>The background music (BGM) deserves a special mention - it elevates every big moment and gives the action sequences a massive adrenaline boost. Speaking of action - it&#39;s massive, raw, and thrilling, with some scenes that will make the audience cheer loud!<br/><br/>The film also touches upon the 26/11 chapter, delivering emotional weight and patriotic fire - moments that hit like a truck and leave your eyes moist.<br/><br/>In short: Great performances\nKiller BGM\nMassive action\nEmotionally impactful\nTotally worth the long runtime<br/><br/>Verdict: A powerhouse entertainer with style, emotion, and badass action - a must-watch on the big screen!"
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010018/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11100645",
              "author": {
                "username": {
                  "text": "ranrock-51550"
                },
                "userId": "ur192943532"
              },
              "summary": {
                "originalText": "A nightmarish boring long stunt movie- too bad."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watching Dhurandhar in a multiplex, with expectations inflated by relentless media hype and social media noise, turned out to be a thoroughly disappointing experience. The film sinks far below even the formulaic stunt movies of the 1950s and 60s starring N. A. Ansari or Sheikh Mukhtar. What unfolds on screen is an over-imagined, chaotic mess-one jolt and shock after another-packed with poorly digested supernatural elements that feel more nauseating than engaging.<br/><br/>The visual palette is relentlessly ugly: grimy, filthy street locales of Karachi and grotesque, almost monstrous-looking characters make the viewing experience intolerable. Adding to the misery is the continuous assault of ear-splitting noise-endless shouting, shrieking, African tribal chants masquerading as rap, and Punjabi nonsense passed off as music and background score. This sonic chaos feels completely out of place in a Sindhi- and Urdu-speaking city like Karachi and becomes an endurance test rather than entertainment.<br/><br/>Sanjay Dutt appears in his familiar, tired rogue avatar-nothing new, nothing memorable. Akshaye Khanna fails to convince as Rahman Dakait, looking more like a fatigued, aging man with hollowed cheeks than a fearsome outlaw. Ranvir Sara Arjun is undoubtedly pretty but appears more like Ranveer Singh&#39;s daughter than his romantic counterpart, making the pairing awkward and unconvincing.<br/><br/>The only performances that stand out positively are those of Madhavan and Rakesh Bedi, both of whom deliver their roles with sincerity and restraint amid the surrounding chaos.<br/><br/>Technically, the film fares no better. Action scenes are shot with frantic, shaky camerawork, often resembling footage stuck permanently in fast-forward mode. Fight sequences are incomprehensible-you can barely tell who is hitting whom. Excessive and unjustified darkness dominates most scenes, continuing Bollywood&#39;s unfortunate trend of mistaking poor lighting for cinematic mood.<br/><br/>The story is weak and wildly unrealistic, with characters that are neither believable nor justified. Babu Dakait, supposedly a feared don ruling the city, comes across as a petty street thug. Seeing him zip around Karachi in a broken autorickshaw with his accomplices is unintentionally comic and outright laughable.<br/><br/>Overall, Dhurandhar is a nightmarish experience-badly written, poorly directed, atrociously edited, and shot with substandard cinematography. Performances are largely below average, barring Madhavan and Rakesh Bedi. One is left wondering where viewers found &quot;emotion,&quot; &quot;patriotism,&quot; or &quot;fine performances&quot; in this unimpressive and forgettable film.<br/><br/>Verdict: A complete waste of time and money.<br/><br/>Rating: 2/10."
                }
              },
              "authorRating": 2,
              "submissionDate": "2026-01-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11100645/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11037058",
              "author": {
                "username": {
                  "text": "rationalistbeing"
                },
                "userId": "ur93401360"
              },
              "summary": {
                "originalText": "Unreal Block buster"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I have nothing to complain about. No White washing of terrorism, no tiptoing around perpetrators of crime and terror. Awesome acting. BGM, Songs, action, screenplay, lighting all were just awesome.<br/><br/>Sure some of the things can be fixed, Urdu spelling mistakes. Pronounciations, some facts around 1971 could have been correct. All minor things."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11037058/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11090483",
              "author": {
                "username": {
                  "text": "hardikkhurana"
                },
                "userId": "ur69065925"
              },
              "summary": {
                "originalText": "Salute to this Reel, which is more of a Real"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhundhar is a very good film that leaves a strong and lasting impression. The movie stands out for its engaging storytelling and meaningful execution, keeping the audience invested from beginning to end. The director deserves special appreciation for presenting the narrative with clarity, sensitivity, and confidence, making every scene feel purposeful and impactful.<br/><br/>The topic of the film is handled thoughtfully and maturely, highlighting important themes in a way that feels both realistic and emotionally resonant. The direction, pacing, and overall vision reflect the director&#39;s strong command over the subject and craft.<br/><br/>Overall, *Dhundhar* is an impressive cinematic effort that combines strong direction with a meaningful topic. Films like this enrich cinema, and it would be great to see more movies of this kind being made in the future."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-02",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11090483/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023988",
              "author": {
                "username": {
                  "text": "deepikagirdhar"
                },
                "userId": "ur95965246"
              },
              "summary": {
                "originalText": "Too good! Must watch movie with so many legends in one frame!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Finally, a superb Bollywood movie after so long!<br/><br/>Aditya Dhar has done a phenomenal job creating this film. 👏👏\nA lot of Bollywood movies have been made in the spy-action genre, but this is the best one so far.<br/><br/>Bringing so many legends together worked really well.<br/><br/>Before watching the movie, I saw many reels saying Akshay stole the show and was better than the rest-but that&#39;s not true.<br/><br/>Yes, Akshay was very good and it&#39;s a great comeback, but Ranveer was literally the soul of the movie. His acting and expressions were outstanding. Too good, man-huge fan!<br/><br/>Madhavan, Sanjay, Arjun-all of them were excellent. These are some of the finest actors in Bollywood. Kudos to Aditya for casting such an incredible lineup."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023988/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11043847",
              "author": {
                "username": {
                  "text": "Avani-60"
                },
                "userId": "ur211835009"
              },
              "summary": {
                "originalText": "Love this"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just watched Dhurandhar and honestly, it leaves a strong impact. The storytelling is intense and well-paced, with no unnecessary moments. The performances feel raw and convincing, especially the lead, who carries the film with quiet authority. I also loved how grounded the action and background score were nothing felt overdone. More than just action, the film really makes you think about power, ambition, and consequences. Definitely worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11043847/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11069876",
              "author": {
                "username": {
                  "text": "TirunagariS"
                },
                "userId": "ur206248699"
              },
              "summary": {
                "originalText": "The Best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Beautifully picturised movie.<br/><br/>10/10..\nKudos to entire team.<br/><br/>Picturisation in those conditions is marvellous.<br/><br/>Characters chosen are so nearer to the originals..\nShowing our strength in all the fields of 24 frames really commendable.<br/><br/>We were spellbound for 3 and half hour movie.. nowadays sitting for 2 hours is of great matter.<br/><br/>Once again congratulations to whole team<br/><br/>Jai Hind."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11069876/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013851",
              "author": {
                "username": {
                  "text": "vimaljewrya"
                },
                "userId": "ur117837022"
              },
              "summary": {
                "originalText": "Best spy movie of all time"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s the best spy movie u should watch because it&#39;s showing the reality not fancy world the cruelty is 100% from the real world that&#39;s how terrorist did to spy agents and with normal peoples if you want to see the reality then u should 100% watch this movie. By the way the actors actually did great job without doing over acting and drama."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013851/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022911",
              "author": {
                "username": {
                  "text": "vatsald-7"
                },
                "userId": "ur206924351"
              },
              "summary": {
                "originalText": "Awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar (2025) looks like one of those films that&#39;s built to leave a strong impact. From its very name, the movie promises intensity, power, and a fearless narrative. The vibe suggests a gripping story backed by strong performances, solid direction, and a larger-than-life cinematic experience.<br/><br/>What stands out most is the confidence the film carries-Dhurandhar feels bold, raw, and unapologetic, the kind of movie that doesn&#39;t shy away from depth or emotion. If it delivers on its promise, it has all the ingredients to be memorable: drama, passion, and moments that stay with the audience long after the screen fades to black.<br/><br/>Overall, Dhurandhar (2025) appears poised to be a powerful addition to Indian cinema-one that celebrates strength, intensity, and impactful storytelling. 🎬🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022911/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11087021",
              "author": {
                "username": {
                  "text": "bhav-46933"
                },
                "userId": "ur197590395"
              },
              "summary": {
                "originalText": "Bloody Good Film - Caters to all"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Im not a big fan of gore but considering movies youngsters watch this has balanced gore fun music story acting and isnt over the top as I thought it would be some surprises. First of its kind Film with lots of real influences not just story but characters. Music though not original so much fun but the movie turned out really really good. !!!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-01",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11087021/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}