{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6tbbktazcwzy476tx7mbrqpt46brt3ukdv67eald6mqbdf4skydk3oq3f5mbyoa6mfrx2umy2mw3n2onuzuotejrq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11065942",
              "author": {
                "username": {
                  "text": "Kumaresh-87"
                },
                "userId": "ur211963689"
              },
              "summary": {
                "originalText": "Clean hit ⭐⭐⭐⭐⭐⭐⭐⭐⭐"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a rare Hindi film that respects cinema over noise. The cinematography is stunning, the screenplay feels fresh and rich, and the costume design is raw and authentic. Action is brutally realistic with no commercial slow-motion gimmicks. Even the smallest details-hand movements, edits, pauses-are treated with care. The film lets scenes breathe while covering a surprising amount of ground. Director-driven, confident filmmaking. Only the duration slightly holds it back. 9.8/10."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11065942/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007261",
              "author": {
                "username": {
                  "text": "jainananya-67135"
                },
                "userId": "ur128495004"
              },
              "summary": {
                "originalText": "Heart, Drama, and Big Screen Thrills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is deliberate yet immersive, pulling audiences into a world of betrayal, strategy, and moral conflict. Ranveer Singh delivers a masterful performance, portraying a protagonist whose internal struggles mirror the chaos around him. Sanjay Dutt brings gravitas, menace, and authority, while Akshaye Khanna and R Madhavan add cerebral depth and subtlety. Arjun Rampal&#39;s quiet menace sustains tension, and Sara Arjun&#39;s heartfelt moments humanize the stakes. Director Aditya Dhar orchestrates suspense, action, and emotional beats with finesse. Cinematography captures chaos and intimacy equally, and the musical score heightens every suspenseful and emotional moment. The final act delivers explosive action sequences alongside profound emotional payoff, leaving a lasting impression."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007261/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010619",
              "author": {
                "username": {
                  "text": "myhomebs"
                },
                "userId": "ur158976608"
              },
              "summary": {
                "originalText": "Jhakkas"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It was fantastic movie. First Reason for that is it&#39;s patriotic and showing nationalism. Action scenes are mind blowing. Ranveer singh , Akshay khanna , Sanjay Dutt , Arjun Rampal and etc their acting was fabulous. If You watch for entertainment or for those martyrs whom story is this , overall Great Movie. Thank you Aditya Dhar and all team for this masterpiece 🙏"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010619/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028189",
              "author": {
                "username": {
                  "text": "hanumanrastogi"
                },
                "userId": "ur68589784"
              },
              "summary": {
                "originalText": "Dhurandar: A Spy Thriller That Exposes Pakistan as a Terrorist Nation"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is a gripping, high-intensity spy thriller that fearlessly exposes Pakistan as a terrorist nation. With phenomenal performances from the entire cast and razor-sharp storytelling, the film keeps you engaged for its full 3.5-hour runtime without a single dull moment. Easily one of the best spy thrillers of the decade and a must-watch in theatres. All 1 stars are given by terrorists from Pakistan 😂😂"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028189/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016232",
              "author": {
                "username": {
                  "text": "puneetdhawan"
                },
                "userId": "ur63828691"
              },
              "summary": {
                "originalText": "Brilliantly executed. Crazy music and cinematography"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Top notch acting and action sequences.brilliantly executed. Amazing music and cinematography. Akshay khanna shines but Ranveer an Sanjay also did a great job.bollywood should make more such high quality films. The movies is long but Didnt get bored even for a second. No unnecessary songs inserted when not required. Really mature cinema has been offered."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016232/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007095",
              "author": {
                "username": {
                  "text": "rahuljainrj-78561"
                },
                "userId": "ur115069064"
              },
              "summary": {
                "originalText": "A Thrilling Ride with Epic Performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story unfolds with meticulous care, each scene enhancing suspense and character development. Ranveer Singh delivers a performance full of nuance, navigating the moral dilemmas and high-stakes action with ease. Sanjay Dutt brings authoritative presence, making even brief appearances impactful. Akshaye Khanna and R Madhavan&#39;s understated performances lend credibility and intelligence to the ensemble. Arjun Rampal&#39;s quiet menace keeps viewers on edge, while Sara Arjun&#39;s emotional scenes heighten stakes. Aditya Dhar blends strategic storytelling with explosive action sequences. Cinematography captures chaos and intimacy, and the soundtrack intensifies suspense. The second half culminates in a thrilling, emotionally charged finale."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007095/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013868",
              "author": {
                "username": {
                  "text": "MondeepD"
                },
                "userId": "ur211593550"
              },
              "summary": {
                "originalText": "After long time bollywood made a international kevel spy thriller."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just watched the movie and so excited that i have created this account on IMDB to just rate it. I lost hope on bollywood watching fictional spy stories. But bollywood is back with a bang with this movie. Everyone was just perfect to their character. I have seen many documentaries on youtube about Lyari gang wars in last ten years. The story perfectly fits here."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013868/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015303",
              "author": {
                "username": {
                  "text": "officialsakshi-10932"
                },
                "userId": "ur197099861"
              },
              "summary": {
                "originalText": "SPECTACULAR"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "WOW! WHAT A MOVIE..IT WAS MOST AMAZING EXPERIENCE WATCHING SUCH FANTABULOUS MOVIE IN THEATRES...JUST LOVED THE RAWNESS SHOWN IN THE MOVIE...ITS A WORK OF ART BY ADITYA DHAR..I WAS IMPRESSED BY THE WORK AND RAWNESS IN THE ACTING BY BOTH RANVEER AND AKSHAY KHANNA. BOTH ACTORS DESEERVE PRAISE. MUST WATCH WITHOUT EVEN THINKING."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015303/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007738",
              "author": {
                "username": {
                  "text": "geniusgd"
                },
                "userId": "ur72686311"
              },
              "summary": {
                "originalText": "This is how a Spy movie is made!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a triumphant reminder of what powerful cinema looks like when anchored by exceptional performances and fearless storytelling. The film unfolds with gripping intensity, yet every moment feels purposeful and controlled. It is the kind of work that pulls you in completely and refuses to let go.<br/><br/>Akshaye Khanna delivers one of the finest performances of his career. His screen presence is magnetic. His emotional precision is astonishing. He brings a rare blend of restraint and fire that elevates every scene he appears in. Watching him inhabit this role feels like witnessing an actor at the peak of his craft.<br/><br/>Rakesh Bedi is a revelation. Known for his comic timing, he takes an unexpected turn here and delivers a performance that is both grounded and quietly devastating. His contribution adds depth and texture, proving once again that he is one of the industry&#39;s most versatile talents.<br/><br/>The film&#39;s writing is sharp, the direction assured, and the visual language striking. Cinematography and music work in perfect harmony, amplifying the emotional force of the narrative.<br/><br/>Dhurandhar is more than a film. It is an experience. A gripping, beautifully executed piece of cinema that needs to be experienced in theatres."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007738/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11035830",
              "author": {
                "username": {
                  "text": "TusharG-40"
                },
                "userId": "ur199708859"
              },
              "summary": {
                "originalText": "Unbelievable beast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an unbelievable beast of a film. From the very first scene, it grips you with its intense atmosphere, powerful visuals, and strong background score. The storytelling is raw and engaging, keeping you hooked throughout. Performances feel convincing and impactful, especially in emotionally charged moments. The direction is confident, and the action sequences are well executed without feeling overdone. What stands out most is the film&#39;s ability to maintain tension and deliver a solid cinematic experience. A must-watch for anyone who enjoys intense, hard-hitting cinema. Truly worth a 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11035830/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013140",
              "author": {
                "username": {
                  "text": "ramya-37065"
                },
                "userId": "ur89231588"
              },
              "summary": {
                "originalText": "... because it truly deserves the praise"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Not only is this movie exciting, truly entertaining, stylish, kind of realistic but it also creates a sense of pride and reminds the people of the efforts and sacrifices made a by the IB and security forces of India. The dialogues are simple yet punchy.<br/><br/>The background score, editing and cinematography are top notch.<br/><br/>Ever actor did a great job. There are few small things which I feel could have been little better, I actually started liking ranveer Singh after this movie."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013140/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022994",
              "author": {
                "username": {
                  "text": "ashishkeshari567"
                },
                "userId": "ur55281466"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best movies I&#39;ve watched in recent times.<br/><br/>Dhurandhar stands out for its raw honesty and courage to break away from the false narratives often portrayed in Bollywood. For years, mainstream cinema has tried to present a softened, unrealistic image of India-Pakistan relations, sometimes even showing Pakistan&#39;s ISI in a sympathetic or friendly light. This film does the exact opposite-and that&#39;s where its strength lies.<br/><br/>Dhurandhar presents a hard-hitting and realistic portrayal of ground realities, exposing the truth without unnecessary dramatization or sugarcoating. The storytelling is gripping, the performances feel authentic, and the narrative keeps you engaged from start to finish.<br/><br/>What makes this movie truly impactful is its commitment to realism and its refusal to dilute facts for commercial comfort. It doesn&#39;t try to please everyone-it tells the story as it is, and that honesty is refreshing.<br/><br/>A must-watch for anyone who appreciates meaningful cinema, strong storytelling, and films that dare to challenge long-standing misconceptions."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022994/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007211",
              "author": {
                "username": {
                  "text": "batra-19894"
                },
                "userId": "ur118093966"
              },
              "summary": {
                "originalText": "Drama That Moves, Action That Thrills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film constructs a layered, morally complex narrative where every character and action matters. Ranveer Singh delivers a mesmerizing performance, oscillating between vulnerability, determination, and strategic calculation. Sanjay Dutt commands every scene with gravitas, menace, and authority. Akshaye Khanna and R Madhavan enhance the ensemble with subtle, layered performances. Arjun Rampal&#39;s quiet threat maintains suspense, and Sara Arjun&#39;s emotional authenticity makes the stakes tangible. Aditya Dhar&#39;s direction masterfully balances suspense, strategic plotting, and thrilling action. Cinematography captures chaos and intimacy alike, and the score elevates tension and drama. The second half escalates into a breathtaking finale that combines adrenaline, emotion, and narrative payoff."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007211/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006749",
              "author": {
                "username": {
                  "text": "imdbfan-2857184149"
                },
                "userId": "ur199247562"
              },
              "summary": {
                "originalText": "Drama That Echoes, Action That Dominates"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From its opening frames, the film pulls you into a meticulously constructed universe of crime and politics. Ranveer Singh&#39;s performance oscillates between vulnerability and relentless determination, while Sanjay Dutt dominates every scene he inhabits with his commanding screen presence. Akshaye Khanna and R Madhavan provide smart, layered performances, giving weight to the subplots, and Arjun Rampal embodies quiet menace with precision. Sara Arjun delivers a performance that is both haunting and empathetic. Under Aditya Dhar&#39;s vision, the narrative carefully balances introspection and intensity, building tension before delivering explosive sequences that feel earned. The cinematography captures both the vast chaos and intimate moments with equal skill, while the soundtrack reinforces the film&#39;s psychological edge. The storytelling is meticulous, ensuring that no action feels gratuitous and every plot twist lands with maximum impact."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006749/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002851",
              "author": {
                "username": {
                  "text": "gituchora-52205"
                },
                "userId": "ur128375523"
              },
              "summary": {
                "originalText": "Entertaining throughout, no shortness of excitement"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The mammoth runtime holding actioners, Animal (2023) and now the most awaited movie of 2025 Dhurandhar, prove that even as attention spans have nosedived to a fleeting 3 seconds, powerful content can still hold sway for more than 3 hours. While Animal may have had a few cringe moments or story sagging sub plots, Dhurandhar has none. It is rich on patriotic sentiment, rooted in real events, entertaining and gripping throughout, and full of memorable action that never goes overboard. The performances are sharp, the tone is assured and the film knows exactly what it wants to be.<br/><br/>Aditya Dhar, director and co producer, has a history of creating riveting action political entertainers. He has hit the nail on the head with this one. Locations, action sequences, background research, casting, the zippy pace, the fine editing, all add up to make it a must watch as the year ends.<br/><br/>If you are even slightly aware of India&#39;s geopolitics, Dhurandhar will strike a chord.<br/><br/>Ranveer Singh is on top of his game here, and credit goes to the director again for shaping and controlling the energy that Ranveer brings. That said, what Ranveer recently did to Rishabh Shetty was unnecessary, misinformed and disrespectful of a belief that millions hold sacred. It had nothing to do with the craft on display in Dhurandhar and only distracted from the good work he has delivered on screen."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002851/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011017",
              "author": {
                "username": {
                  "text": "rajputsushant"
                },
                "userId": "ur91097780"
              },
              "summary": {
                "originalText": "Best Spy Thriller on Real Events"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch movie with real life events. Great work by filmmakers as they served the raw truth to audience. No filter only reality. Great storyline and ultimate acting by Akshay Khanna is the gem of the movie. Ranveer Singh has done very well. Sanjay and Arjun are also very good. Madhavan is good as always. Eagerly waiting for 2nd part."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011017/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007290",
              "author": {
                "username": {
                  "text": "vermarashmi-78333"
                },
                "userId": "ur123096414"
              },
              "summary": {
                "originalText": "Powerful Performances with Action Galore"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film opens with a tense sequence that immediately sets the tone for the high-stakes world of crime and politics. Ranveer Singh dominates every scene with a performance that captures his character&#39;s internal conflict, oscillating between calculated strategy and raw emotion. Sanjay Dutt exudes authority, his screen presence amplifying the weight of every interaction. Akshaye Khanna and R Madhavan bring intelligence and subtlety to pivotal sequences, making even supporting moments feel critical. Arjun Rampal&#39;s quiet menace casts a shadow over multiple scenes, while Sara Arjun&#39;s innocence and vulnerability inject genuine emotional gravity. Aditya Dhar&#39;s direction ensures that each frame, from sprawling urban landscapes to intimate close-ups, feels purposeful. The cinematography uses light and shadow masterfully to heighten tension, and the score punctuates suspense, making action sequences not just thrilling but narratively consequential. The second half escalates into breathtaking confrontations, with moral dilemmas and physical stakes converging in a finale that is both shocking and emotionally resonant."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007290/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010116",
              "author": {
                "username": {
                  "text": "hospitalityihg"
                },
                "userId": "ur194845177"
              },
              "summary": {
                "originalText": "Traitor is india"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What a great movie to show the reality of india that they are the real traitors that use innocent people to kill other innocent citizens and are so interested in Pakistan LOLLLL maybe they could&#39;ve sent people to clean up the trash of their indians who are traitor . But instead they are the trash and send their trash to Pakistan and then those indians become traitor of india to after getting in power. INDIA FOCUS ON CLEANING UP YOUR POVERTY AND EDUCATE YOUR PEOPLE. Instead of spreading hatred if india and pakistan people combined focused on bringing a peaceful treaty maybe their will be less hate and harm. New generation does not need this kind of hate you potray in movies but action wise great movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010116/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023024",
              "author": {
                "username": {
                  "text": "janakk"
                },
                "userId": "ur65166294"
              },
              "summary": {
                "originalText": "Mindblowing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolute cinematic with action and touch of reality. This movie is keep you engaged for 3 and half hour, great casting of actors as some of the legends have been casted in this film like Arjun Rampal, Akshay Khanna, Sanjay Dutt, Madhvan superb acting by these guys. Ranveer Singh role is phenomenal as the lead. Overall it&#39;s must watch film can&#39;t wait for part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023024/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010679",
              "author": {
                "username": {
                  "text": "mr-satyam-dey"
                },
                "userId": "ur35688776"
              },
              "summary": {
                "originalText": "Raw. Relentless. Real."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Finally, Bollywood has found its spine.<br/><br/>After decades of soft-focus RAW-ISI bromance fed to us through glossy YRF-style storytelling, Dhurandhar finally gives us a raw, uncomfortable, and realistic look at espionage. At almost 3.5 hours long, the film never drags - not for a single moment.<br/><br/>A major strength lies in its casting: when the supporting actors are chosen for talent and not because the film industry functions like a rojgar yojna, the result is authenticity. Every character feels lived-in, layered, and believable.<br/><br/>Ranveer delivers one of his finest performances - intense, grounded, and controlled. If only he applied the same restraint to his off-screen persona, his craft would shine even brighter.<br/><br/>From the hauntingly amazing background score to the realistic production design and unpolished action sequences free from flashy VFX, everything pulls you straight into the gritty underbelly of Pakistan.<br/><br/>Yes, there are a few lines sprinkled in to flatter the current ruling government - but they are sparse and don&#39;t disrupt the rhythm or credibility of the narrative.<br/><br/>This is the kind of cinema we should be supporting - especially after collectively committing a crime against logic by turning Pushpa 2 and Pathaan into blockbusters.<br/><br/>A word of caution: do not take kids or anyone uncomfortable with raw brutality. The violence here isn&#39;t senseless or stylized - unlike Marco, it exists to serve the story.<br/><br/>In the end, Dhurandhar stands tall as a compelling, intelligent, and unapologetically real film - a striking balance of fact and fiction, executed with rare conviction."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010679/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11056451",
              "author": {
                "username": {
                  "text": "Achintya_Gautam"
                },
                "userId": "ur207286448"
              },
              "summary": {
                "originalText": "A bloody, amazing Movie!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "So today I came back from the theatre from watching Dhurandhar and I&#39;ll be honest, this movie is a BANGER! (SPOILERS AHEAD!) The main motive of the movie was to make the public aware about the terrorist attacks like the Kandahar plane hijack and 26/11 in Mumbai and how the big gangs in Pakistan like the gang of Rehman Dakait were connected to this and how India had sent raw agents in Pakistan to give internal info to India, the main hero of this movie is Hamza Ali(raw agent) who was played by Ranveer singh. Keep in mind this movie is A rated. This movie is really good, I loved it and it&#39;s also very long, nearly 3 hrs. So if you have time go and watch it!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11056451/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018429",
              "author": {
                "username": {
                  "text": "KaranS-831"
                },
                "userId": "ur205406435"
              },
              "summary": {
                "originalText": "Must watch masterpiece!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Well researched movie with perfect casting and excellent attention to detail. 3 and a half hours of run time seemed too less to me.<br/><br/>Definitely give it a go if you like a good story that is based on real events. Excellent work by Akshaye Khana with his calm yet terrifying aura on screen, even overshadowing Ranveer at times. Aditya Dhar has met expectations after his very high standards set by URI."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018429/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015297",
              "author": {
                "username": {
                  "text": "avinasa"
                },
                "userId": "ur65507229"
              },
              "summary": {
                "originalText": "Movie has to be made like this!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolute thriller, perfect touch of reality, amazing acting by cast, great research and to the point editing and ofcourse Akshay Khanna the GOAT! Excellent use of graphics and this is a comeback of Hindi cinema and storytelling! Fantastic BGM and mix of different Genres of music! What a movie! Loved it to the core! Can&#39;t wait for a sequel!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015297/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006409",
              "author": {
                "username": {
                  "text": "gqeuubgg"
                },
                "userId": "ur176906510"
              },
              "summary": {
                "originalText": "Stars Ignite as the Story Intensifies"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every performance in this film feels earned, with Ranveer Singh standing out for his nuanced portrayal of a man torn by duty and conscience. The director builds a world of escalating tension, blending visceral action with moments of quiet introspection. Supporting characters are thoughtfully written, giving depth to the narrative. Cinematography captures both gritty realism and cinematic grandeur, while the editing keeps the story taut, making the long runtime feel justified and immersive."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006409/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004736",
              "author": {
                "username": {
                  "text": "Aaryaman-2"
                },
                "userId": "ur211420129"
              },
              "summary": {
                "originalText": "Dhurandhar A Must Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie delves straight into the plot. The screenplay is tight, and even though some dialogues are dramatic, they do not feel cringeworthy.<br/><br/>Ranveer Singh is easily one of the best things to happen to Bollywood. He completely transforms for the role and feels perfect in it.<br/><br/>This movie feels like an Akshay Khanna aura project. Everyone knew he would deliver great acting, but looking this good was unexpected.<br/><br/>Arjun Rampal has a comparatively short role, but his menacing presence genuinely makes certain scenes intimidating.<br/><br/>Madhavan is noticeably underutilised.<br/><br/>Sara looks beautiful and, for a newcomer, performs well. Her chemistry with Ranveer is not weird, but it is not very strong either.<br/><br/>You will feel the long runtime, but there is not a single scene that feels unnecessary or worth removing.<br/><br/>The action scenes are gory, but the overall violence is less than expected. I personally wanted to see more of action hero Ranveer.<br/><br/>The story is not a typical spy thriller. The way certain dialogues and situations are presented adds a strong dramatic impact.<br/><br/>The background music is powerful, and when the title track plays, the theatre energy rises instantly.<br/><br/>The final five minutes, which set up the next part, are genuinely exciting and elevate the overall experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004736/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}