{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xofcrotazcwzy472whzmjqrlu4sab42mndd67pb7d6mqbdf4skydk2o42vrnzyobs55lt6bvsovlwcphihrj36qyiq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11027049",
              "author": {
                "username": {
                  "text": "ss-37705-94556"
                },
                "userId": "ur122095514"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The best direction with best casting, with best story and incidence and with detailed and proper facts . Total marvelous work overall and people should experience its theatre experience and they should know whats real struggle behind our unsung heros . In short everything about this movie was an epitome of perfection."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027049/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023859",
              "author": {
                "username": {
                  "text": "adityag-37082"
                },
                "userId": "ur150966892"
              },
              "summary": {
                "originalText": "Raw Realism in Every Frame"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar delivers realistic cinema through its grounded spy thriller narrative, blending practical espionage tactics with authentic human emotions amid Karachis gritty underworld. Director Aditya Dhar uses precise cinematography and sound design to heighten practicality, turning ordinary moments into spine-chilling truths without exaggeration."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023859/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017136",
              "author": {
                "username": {
                  "text": "Abhinavb-73"
                },
                "userId": "ur211616776"
              },
              "summary": {
                "originalText": "Good movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ultimate acting all of actors. And akshay Khanna was epic! And Ranveer sing kya hi kehna. Arjun Rampal and Sanjay Dutt no one can beat and back ground music was ultimate no one can beat. In Animal movie Bobby deol was also insecure about akshay Khanna perfect entry and perfect songs. Over all I gave 4.5 star to this movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017136/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006791",
              "author": {
                "username": {
                  "text": "AvanL-3"
                },
                "userId": "ur203385984"
              },
              "summary": {
                "originalText": "Thrills, Stars, and Drama Combined"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every moment in the film feels intentional, from character introductions to the climactic confrontations. Ranveer Singh&#39;s performance is layered and compelling, alternating between strategic calculation and visceral emotional intensity. Sanjay Dutt commands scenes with effortless authority, and his presence adds depth to the underworld narrative. Akshaye Khanna and R Madhavan provide subtle, intelligent performances, ensuring that each plot development feels grounded and consequential. Arjun Rampal&#39;s menace keeps viewers constantly uneasy, and Sara Arjun&#39;s emotionally rich performance heightens the stakes. Aditya Dhar orchestrates the story&#39;s suspense, action, and moral complexity with precision. Cinematography captures both the chaos of the city and intimate character-driven moments, while the score amplifies tension at every turn. The second half escalates dramatically, culminating in a finale that combines breathtaking action, psychological complexity, and profound emotional resonance."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006791/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11035410",
              "author": {
                "username": {
                  "text": "theycallmecalm"
                },
                "userId": "ur197594081"
              },
              "summary": {
                "originalText": "What a movie. Absolute cinema 🎦"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It was a fantastic movie. 3.5 hours didn&#39;t felt like 3.5 hours really. I got so much hooked to the movie I forgot that i was sitting in a theatre. I forgot I had a phone. Akshaye khanna specially was amazing in this movie and all the other actors were amazing too. I loved this film and I recommend it to everyone else."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11035410/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007515",
              "author": {
                "username": {
                  "text": "gs-35906-69626"
                },
                "userId": "ur191849961"
              },
              "summary": {
                "originalText": "Must watch craft....."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best spy movie...Akshaye Khanna, playing a powerful Lyari gangster based is standout,\nArjun Rampal, as an ISI major, are also noted for strong, impactful role.<br/><br/>Aditya Dhar&#39;s direction is appreciated for its scale, realism, and atmospheric recreation of Karachi&#39;s Lyari town.<br/><br/>Overall best movie......"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007515/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013893",
              "author": {
                "username": {
                  "text": "prasanna_d_07"
                },
                "userId": "ur87776636"
              },
              "summary": {
                "originalText": "Akshaye Khanna - The real Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Absolute Cinema&quot;. Don&#39;t wait for OTT it&#39;s an theater movie.<br/><br/>Aditya Dhar has just drop another bang.<br/><br/>At last, a real SPY movie from Bollywood.<br/><br/>Even though the movie is 3.5 hours long, it doesn&#39;t seem sluggish &amp; boring.<br/><br/>You&#39;ll remain in the chairs until the very end.<br/><br/>The real Dhurandhar is Akshaye Khanna, his performance was amazing and his aura was unmatchable.<br/><br/>He is deserving of the award for best actor in a negative role.<br/><br/>From Chhava &amp; Dhurandhar, can say both characters portrayed by him was like he was playing the role in real life.<br/><br/>It&#39;s good to see a 50-year-old underappreciated gem making his mark in Indian cinemas."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013893/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012748",
              "author": {
                "username": {
                  "text": "VinayS-48"
                },
                "userId": "ur201388416"
              },
              "summary": {
                "originalText": "Khatarnaak movie by Aditya Dhar and team."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The characters were too good especially the main lead, Ranveer Singh - his actions, dialogs brings the intense on the screen. Akshya Khanna - my God, he literally killed it with his actions. Sanjay dutt, not to forget, perfect guy for a perfect role. Arjun Rampal - best suited for a villain role. Rakesh Bedi, comedy guy but has a good screen time for a relevant role.<br/><br/>And that line, &quot;Ghayal hoon, isilye ghatak hoon&quot;. Mind blowing writing, direction by Aditya Dhar.<br/><br/>Eagerly waiting for *The Revenge.*"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012748/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010364",
              "author": {
                "username": {
                  "text": "abhinaypande-19587"
                },
                "userId": "ur172783539"
              },
              "summary": {
                "originalText": "Go For It !!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I would like to Start with the Real Life elements used in the Film , Like 1999 Kandahar Hijack , 2001 Parliament Attack and 2008 Mumbai Attacks.<br/><br/>Along with The Real life Currency Scam which was done by then Finance Minister who&#39;s name is as we all know sounds like P Bambambram !<br/><br/>It truly shows the Incapability and non serious nature of Govts which were ruling back then.<br/><br/>The Story&#39; Hits you hard as your Blood boils thinking how incapable and corrupt politicians has ruled over this Nation without any true sense of Nationalism and Patriotism.<br/><br/>Now as per Movie&#39;s Story. It sets in Pakistan&#39;s Lyari Town area in Karachi which is even now famous for it&#39;s Lawlessness and Gangland wars\nThe Characters used in the film , Rahman Dakait , Arshad Pappu , Babu Dakait , Uzair Baloch , Jameel Sahab ( Based on Nabil Habol) , Asif Ali Zardaris close connection with these Gangsters , SSP Chaudhary Aslam , these are all Legendary status guys in Karachi&#39;s Gang history. Their Crimes n Corruption is talked about even to this date.<br/><br/>My suggestion is do watch some documentary or Videos on Lyari Gangwar before watching this movie. Then you will truly appreciate and enjoy the story even more.<br/><br/>Character of Ranveer is fictional and he is amalgamation of all Unknown Gunmens we all hear and are proud of who are living and bumping off India&#39;s enemies within Pakistan on daily basis.<br/><br/>The Story involving Ranveers Character is totally fictional and cleverly set up and mixed with the real life people and their lives. It&#39;s a very Smart mix of Reality and Fiction and Aditya Dhar has done it outstandingly.<br/><br/>The movie is 3 hour&#39;s 30 minutes but am not complaining, it&#39;s very well paced and each n every character is given enough time , so as audience we understand their Nature , motivation. Nothing feels rushed or underperforming.<br/><br/>A big and Special Shout out to Akshay Khanna Sahab, what an Acting. It seems he didn&#39;t act but was possessed by Soul of Rahman Dakait in entire film. When you watch him you will feel that this is how Rahman Dakait must have walked , talked , smiled, behaved , that&#39;s how Good Akshay Khanna is.<br/><br/>R madhavan is unrecognisable. He has done impeccable job as Ajit Doval ( name changed in movie)\nAnd Arjun Rampal, bhaisahab he is so Raw , intense that watching him in every scene gives you Literal Chills. He is surely gonna be the Big Bad Villain in 2nd Part. Yes there is a Second Part too.<br/><br/>And let me tell you the Last Scene , and the Voice of Sonu Nigam hits you different.<br/><br/>The film is dedicated to all the Unknown Gunmens who have sacrificed their entire life, without any form of Reward or Recognition so that we people can live safely . Salute to them , watch it for them atleast.<br/><br/>Just imagine we would never ever know even Names of those People.<br/><br/>Also the BGM is awesome, hits perfect cords at perfect Scenes.<br/><br/>Sanjay Dutt as SP Chaudhary Aslam plays his part well , and he does look exactly like the Real guy he is portraying.<br/><br/>The film is surely giving Burns to lot of Pakistan loving , Aman ki asha kind of Liberals but it&#39;s a Good Thing. They should feel the burn as the real Truth should be Known to all.<br/><br/>Final Verdict - Just go for it. Book your tickets and Watch it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010364/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036420",
              "author": {
                "username": {
                  "text": "bgholkar"
                },
                "userId": "ur27087811"
              },
              "summary": {
                "originalText": "A True Masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Carefully written script, great screenplay, apt casting, perfect roles, top class acting, epic movie. Every indian must watch this movie to understand politics at the international level at least neighbouring countries.<br/><br/>From beginning to end of the movie the plot keeps you on the edge of the seat. The film crew and the director has proved that even one of the longest movie is watched and appreciated by a reel loving and short span attention addicted person.<br/><br/>Epic..."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036420/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014184",
              "author": {
                "username": {
                  "text": "swatimhaswadkar-62074"
                },
                "userId": "ur151317870"
              },
              "summary": {
                "originalText": "A Gripping Spy Thriller Rooted in a Real Incident"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhaurandhar stands out because it&#39;s not just fiction - it&#39;s inspired by a real incident, and you can feel that authenticity in every scene. The intelligence details, the tension of the mission, and the emotional weight of undercover work are portrayed with respect and realism. A powerful tribute to the agents who risk everything behind the scenes."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014184/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010603",
              "author": {
                "username": {
                  "text": "tusharna-24998"
                },
                "userId": "ur135023728"
              },
              "summary": {
                "originalText": "A Riveting Spy Thriller That Every Indian Must Watch!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping and fully entertaining film that keeps you hooked from start to finish. Inspired by real events, it showcases courage, intelligence, and sacrifice in a way that every Indian should witness.<br/><br/>The entire star cast delivers complete justice to their roles, offering powerful and believable performances. The chemistry, intensity, and emotional depth from each actor elevate the movie immensely.<br/><br/>A special appreciation to the director, who handles the spy genre with precision and finesse. The storytelling is tight, the pacing is sharp, and the film maintains high tension without losing its heart.<br/><br/>In short, Dhurandhar is a compelling, patriotic, and brilliantly crafted thriller-a film that absolutely deserves your time and applause."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010603/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008867",
              "author": {
                "username": {
                  "text": "himanilb"
                },
                "userId": "ur27738291"
              },
              "summary": {
                "originalText": "A must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is by far one of the best spy movies coming out of India. The acting, the set-up, screenplay, the music is phenomenal. A big kudos to the director who has done a phenomenal job telling the story in the way should have been. Raw and gore. A special mention to Ranveer Singh for his phenomenal acting."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008867/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007209",
              "author": {
                "username": {
                  "text": "aayushpandey-83513"
                },
                "userId": "ur118093942"
              },
              "summary": {
                "originalText": "Stellar Cast in a Thrilling Adventure"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film is a careful orchestration of suspense, strategy, and emotional storytelling. Ranveer Singh anchors the narrative with a performance full of depth, portraying internal conflict, courage, and calculated action. Sanjay Dutt commands the screen with gravitas and menace. Akshaye Khanna and R Madhavan provide intelligent, layered performances that elevate the ensemble. Arjun Rampal&#39;s quiet menace creates palpable tension, while Sara Arjun&#39;s emotionally charged scenes humanize the narrative. Aditya Dhar blends suspense, action, and drama masterfully. Cinematography captures sprawling urban chaos and intimate moments, while the score punctuates tension. By the climax, the film delivers a thrilling and emotionally satisfying conclusion."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007209/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11050964",
              "author": {
                "username": {
                  "text": "AvvieeA"
                },
                "userId": "ur211891263"
              },
              "summary": {
                "originalText": "Amazing movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Of of the best movies of the past 5 years. Thankyou Aditya Dhar and team for such an amazing vision and execution. Need more of such movies in India. A 3.5 hour long film yet I was hooked all throughout. Real Cinematic art. Casting of akshaye khanna, ranveer sing, sets of Karachi, Action scenes, Arjun Rampal as Isi everything was spot on. The movie showed reality of Pakistan, how it&#39;s the terr*r factory of the world, with Lot of entertainment. Such movies are a part of India&#39;s real soft power and have the potential to go global. Cheers to the Team."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-24",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11050964/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009960",
              "author": {
                "username": {
                  "text": "jayendraawasthi"
                },
                "userId": "ur196658171"
              },
              "summary": {
                "originalText": "Best movie after a long long time"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is indeed a great film that has come after a long gap. All the characters in the film have been carefully selected and the actors have done complete justice to their roles. The screenplay of the film is quite brilliant which captures the real scenario. The music of the film is also of high quality which is being liked very much by the audience. Overall, this is a great film Waiting for the second part 🙏🏻"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009960/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005144",
              "author": {
                "username": {
                  "text": "nimcurry-4"
                },
                "userId": "ur211537565"
              },
              "summary": {
                "originalText": "Great movie after long long time"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is not a typical hero centric spy thriller romanticizing the pakistani love of bollywoodiyas. This is a raw thriller with ballastic and stealth characters circled around the politics, history and a strong hate hate relationship between India and pakistan. The BGM is great and keeps you hooked. Only downside I see is VFX gets sloppy at few places."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005144/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007461",
              "author": {
                "username": {
                  "text": "RahulB-4875"
                },
                "userId": "ur208274013"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I watched Dhurandhar recently, and it turned out to be a fantastic experience. The fact that it&#39;s inspired by real-life incidents adds a strong sense of authenticity. Even though the movie is slightly long, it never feels dull or dragging. The spy elements are handled really well, and the storyline keeps you invested till the end. Overall, Dhurandhar is a well-crafted film that delivers both thrill and emotion. Definitely recommended!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007461/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013979",
              "author": {
                "username": {
                  "text": "AjaypalS-96"
                },
                "userId": "ur211593851"
              },
              "summary": {
                "originalText": "Best Indian Spy action movie ever made!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is one of the best Indian movie I have ever watched in my life.<br/><br/>The research, every minor nude detailing, the background score, the cast of the film, the acting, dialogues, writing, cinematography, direction and many more things are just picture perfect....\nAditya Dhar has done an amazing amazing job ..\nHis hard work and dedication shows in the film👌\nAditya and the actors just nailed it\nI have watched this 3 days ago and this movie stays with you for a long long time...\nOnce in a generation there comes a movie like this...\nMust watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013979/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007351",
              "author": {
                "username": {
                  "text": "ajaypatel-52172"
                },
                "userId": "ur154427496"
              },
              "summary": {
                "originalText": "Edge-of-Your-Seat Action and Emotion"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film expertly blends tense narrative with high-stakes action, keeping viewers constantly engaged. Ranveer Singh delivers a performance that is both nuanced and commanding, perfectly embodying a man navigating a dangerous moral landscape. Dhar&#39;s direction ensures that every scene, whether action-packed or quiet, carries significance. Action sequences are realistic, visceral, and emotionally charged, while the supporting cast enhances the depth and complexity of the story. The cinematography captures every corner of the underworld with visual sophistication. The editing and score work hand in hand to maintain rhythm and tension, culminating in a finale that is as emotionally gripping as it is narratively satisfying."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007351/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015717",
              "author": {
                "username": {
                  "text": "snaprpankajtiwari"
                },
                "userId": "ur55438043"
              },
              "summary": {
                "originalText": "First time reality is displayed"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Hero doesn&#39;t look like cartoon anymore. It is reality best movie of the decade in spy world.<br/><br/>Performance of ranveer Singh sanjay dutt and akshay khanna is so Energetic and giving goosebumps with a lot scene. Akshay Khaana nailed it best performance ever real og.<br/><br/>The story seems se real direction is really good. Awesome."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015717/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020239",
              "author": {
                "username": {
                  "text": "BinaG-98"
                },
                "userId": "ur211642932"
              },
              "summary": {
                "originalText": "Best movie for India against pakistan"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of the boldest and most ambitious action thrillers Bollywood has delivered in recent years. Directed by Aditya Dhar and starring Ranveer Singh, Sanjay Dutt, Akshaye Khanna, R. Madhavan, Arjun Rampal, and Sara Arjun, the film plunges audiences into a gritty underworld saga inspired by real historical events and covert operations. At its core, the story follows Hamza (Ranveer Singh), a mysterious Indian agent who infiltrates Karachi&#39;s mafia and terror networks to dismantle them from within.<br/><br/>From the outset, Dhurandhar grabs attention with its intense world-building and meticulous attention to detail. The cinematography and background score elevate the film&#39;s atmosphere - weaving classic sounds with modern pulse - creating an immersive landscape that feels both cinematic and raw. The narrative unfolds over several chapters, and while the nearly 3.5-hour runtime may test some viewers&#39; patience, many feel it never drags thanks to tight storytelling and dramatic momentum.<br/><br/>Performances are a standout strength. Ranveer Singh delivers a restrained yet powerful central performance, anchoring the film&#39;s emotional and action beats with confidence. Akshaye Khanna, in particular, has been widely praised for his role, bringing depth and charismatic menace to his character. The ensemble cast contributes to a textured experience - every actor adds weight, making the film feel both large in scope and detailed in execution.<br/><br/>That said, Dhurandhar isn&#39;t without its flaws. The extended second half and occasional narrative excesses may feel overindulgent, and some scenes lean on familiar tropes instead of fresh storytelling. But for fans of high-stakes espionage, layered character work, and powerhouse performances, Dhurandhar delivers a visceral, engaging experience that&#39;s worth watching on the big screen."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020239/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026567",
              "author": {
                "username": {
                  "text": "siddbhatt-237-624447"
                },
                "userId": "ur58553746"
              },
              "summary": {
                "originalText": "A stunning feat"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I don&#39;t usually write reviews for movies but this was such a special movie that I felt the need to express my appreciation. This is a movie of rare brilliance and intensity, and one that holds your attention fully for 3.5 hours. The movie is technically brilliant, the casting is great and the script is taut with realistic dialogue. The performances are uniformly brilliant - no one puts a foot wrong and the background score elevates the viewing experience throughout. One rare thing about this movie is the number of unforgettable sequences it has - scenes that stay with you long after leaving the theatre. Watching this makes me wonder why everyone doesn&#39;t make movies in this manner, instead of making slop like Animal with its awful script and cringeworthy dialogue. Perhaps it comes down to the man who put all of it together - the Director Aditya Dhar. He is clearly in a different league to his peers and as he himself said - he wants to make films, not complete a &#39;project&#39;. Can&#39;t wait for part 2 and everything else Aditya Dhar will do for the rest of his career. And yes, I will be going back to the theatre to watch it at least one more time."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026567/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11046686",
              "author": {
                "username": {
                  "text": "traikhy"
                },
                "userId": "ur162007449"
              },
              "summary": {
                "originalText": "Espionage thriller, one of the best in india"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an engaging watch driven by strong performances-particularly from Madhavan and Akshaye Khanna-and an impressive musical backbone.<br/><br/>The film still offers enough substance to make it a worthwhile espionage thriller, one of the best in india.<br/><br/>Ranveer Singh delivers a strong and committed performance as Hamza, bringing physicality and emotional urgency to the role. His screen presence keeps the narrative engaging, especially during high-stakes action sequences.<br/><br/>R. Madhavan, as Ajay Sanyal-the Chief of the Intelligence Bureau-truly stands out. This is classic Madhavan method acting: restrained, intelligent, and layered.<br/><br/>Akshaye Khanna is exceptional as Rehman Dakait. His portrayal is chilling, especially in the brutally raw action sequences that are designed to make the audience uncomfortable-and they succeed. Once again, Akshaye completely dissolves into his character, reinforcing why he remains one of the most underrated actors in the Hindi film industry.<br/><br/>Arjun Rampal is convincingly menacing as Major Iqbal, while Rakesh Bedi does full justice to his role as a scheming politician, adding subtle menace and realism. Sanjay Dutt, as SP Chaudhary Aslam, feels routine and visually similar to several of his recent performances, offering little novelty.<br/><br/>The music is another major highlight. Composer Shashwat Sachdev smartly integrates classic Pakistani tracks like Hawa Hawa, ghazals such as Chupke Chupke, and qawwalis like Afreen Afreen, alongside Indian retro bangers like Piya Tu Ab To Aaja and Rambha Ho. These choices flow organically with the narrative rather than feeling forced.<br/><br/>The film&#39;s jukebox boasts several standout tracks, including the powerful title song, the reimagined Karvan qawwali, and Ez-Ez, all worth a listen.<br/><br/>The background score effectively amplifies tension and delivers the adrenaline rush needed to elevate the action-heavy moments."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11046686/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017451",
              "author": {
                "username": {
                  "text": "rinkudaxini"
                },
                "userId": "ur151159839"
              },
              "summary": {
                "originalText": "Aditya Dhar's Unflinching Vision: A Landmark Film for Indian Filmmaking"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s unflinching honesty is its greatest asset. It lays bare the critical issues on both sides of the border with skillful neutrality, never stooping to name-calling. The overall direction, writing, and marvelous ensemble performances deserve every bit of the praise they receive.<br/><br/>Mr. Dhar&#39;s boldness is commendable-he chose to relay the bare truth, and his execution was superb, pulling phenomenal, career-best performances from the entire cast. While I won&#39;t be surprised if the film is unfortunately overlooked in the Best Director and Best Actor awards due to clear ideological bias, its quality remains undeniable.<br/><br/>This movie is a watershed moment for Indian filmmaking. I&#39;m already certain Part 2 is going to be an even bigger hit."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017451/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}