{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6dbbsqyxdo6ib7cxh5nrzqlu4waj63emd567fdpj3qflanes22c23o43e7w5bl4nhog33ezqdozlr5k22ypgd",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11017034",
              "author": {
                "username": {
                  "text": "chand-suhas"
                },
                "userId": "ur23656818"
              },
              "summary": {
                "originalText": "Ghayal hun, isiliye Ghatak hun!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Narrated in 10 chapters, Aditya Dhar&#39;s highly ambitious magnum opus is that rare espionage thriller that enjoys proper research, aided by superb casting. The Director&#39;s confidence in his narrative, can be seen in the nearly 2 hours long first half with both halves getting 5 chapters each for a period of 10 years. Hamza infiltrates Pakistan&#39;s notorious gang run by Rehman Dacait and rises through the rank as his confidante. The way he gathers the information about how ISI uses these gangsters for their weapons is quite intriguing. The extreme violence is in sync with the current demand and I wasn&#39;t bothered by it. Despite the lengthy runtime, the film remains engaging though exhausting. The second half does get predictable and doesn&#39;t match the first half.<br/><br/>Ofcourse the other need of the hour, the whole politics of it is what leaves a bitter taste considering the original story was potent enough and the good performances carried the story forward. The jingoistic nationalism with Pakistan as the target was pretty much given and that is definitely not the issue. Yet, the opening disclaimer reads out loud and clear, that the film is inspired by true events and that it doesn&#39;t intentionally target anybody. When they resort to present this as the reality with the usage of actual terror attacks footage and call transcripts, it gets tougher to accept the politics behind this. Sure, the attempt is to trigger the strong emotional response which again was possible without over doing it. The film would have remained impactful even without the political appeasement it resorts to doing, not so subtly."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 6,
                "downVotes": 18
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017034/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031613",
              "author": {
                "username": {
                  "text": "siddhantprakash-15733"
                },
                "userId": "ur150508032"
              },
              "summary": {
                "originalText": "This is what we indian viewers deserve!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie feels new, refreshing, and different from other movies which is a very big plus point. The bgm is absolute banger. The best thing which i liked was how real, lively, and also dangerous the Lyari town felt (kudos to the set building team). Aisa feel ho raha tha ki actually Karachi me teleport ho gaya hu.<br/><br/>Glad that the movie showed the emotional issues a spy has to face while living a fake life in another country.<br/><br/>Some issues that i felt -\nThe love story\nEditing feels choppy in action sequences.<br/><br/>Sound design - Sometimes, the sound of a gun firing doesnt match with the shots being fired(especially in the 2nd half)\n(MINOR SPOILER AHEAD)\nThe ending chase sequence between SP aslam, Hamza, and Rehman dacait feels a little too &quot;Bollywoodised&quot; and doesn&#39;t match the vibe with the rest of the picture(tho it&#39;s not that big of an issue)."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031613/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011661",
              "author": {
                "username": {
                  "text": "SrijoneeD"
                },
                "userId": "ur211576680"
              },
              "summary": {
                "originalText": "The world of action thriller is back with Aditya Dhar and his team. Worth it !!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie was really amazing and engaging, like every moment was something new and eye catching. The suspense was intense in every seen . The overall acting was really really great with all the top quality actors . Even the newcomer actress performed really well compared to the other nepos of industries or any other genz&#39;s nowadays. Anyway the action , directory, script, visuals all were perfectly fitted and was a spectacular performance. Enjoyed every moment in the cinema hall and felt like actually feeling or connecting with the movie . And absolutely deserve recognition for it&#39;s spectacular, and beautiful acting skills of all the actors and actresses. Really love the roles of every single character . Each one of the actor played every role with lots of dedication that can be seen in the movie. Really really amazing. I recommend people to definitely not miss it out . Go watch quicklyyyy !!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011661/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006573",
              "author": {
                "username": {
                  "text": "drm-87332"
                },
                "userId": "ur168786726"
              },
              "summary": {
                "originalText": "A Cinematic Storm of Emotions and Thrills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every frame of the film reflects careful thought, from visual composition to character arcs. Ranveer Singh&#39;s performance is magnetic, anchoring the story with intensity and subtle emotion. The supporting cast enhances the film, providing depth and texture to a richly layered narrative. Director Dhar demonstrates a keen understanding of pacing, ensuring that suspense and action are interwoven with emotional beats seamlessly. The cinematography captures both chaos and quiet moments beautifully, while the soundtrack heightens tension and emotion. The story builds steadily, culminating in a finale that is powerful, shocking, and deeply satisfying."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 13,
                "downVotes": 7
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006573/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006568",
              "author": {
                "username": {
                  "text": "vishalkumarsahoo"
                },
                "userId": "ur172322778"
              },
              "summary": {
                "originalText": "High-Voltage Drama and Explosive Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s meticulous attention to character development sets it apart, creating a narrative that is both thrilling and emotionally resonant. Ranveer Singh shines, embodying his character with a mix of determination, fear, and humanity. Director Dhar orchestrates tension with finesse, balancing explosive action with quieter, introspective moments. The supporting cast delivers memorable performances that enhance the story&#39;s complexity. Cinematography and score elevate the narrative, highlighting the stakes and mood of each sequence. The climactic sequences hit with both impact and emotional gravity, leaving a lasting impression."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 14,
                "downVotes": 8
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006568/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11002914",
              "author": {
                "username": {
                  "text": "rahulvaidya055"
                },
                "userId": "ur114174865"
              },
              "summary": {
                "originalText": "The spy movie you deserve"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I just watched Dhurandhar on the first day and I am still trying to pick my jaw up off the floor. A 3-hour-30-minute movie that feels like it&#39;s 90 minutes long? Somehow they have pulled it off. The way different storylines are woven together is amazing. Every thread gets tied up and nothing feels forced. The tension just keeps climbing and the background music always keeps you engaged.<br/><br/>What really got me was how real everything felt. Real events are seamlessly made a part of the movie. It genuinely feels like you are inside the movie where one wrong move could end up in a catastrophic disaster for the titular characters. Each character got ample screen time to establish themselves in the movie. Dhurandhar is easily one of the best movies I have seen in years and I am already telling everyone that nothing like this is going to come out for the next 3 months. Go watch it on the biggest screen you can find, you ll thank me later."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 10,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11002914/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006251",
              "author": {
                "username": {
                  "text": "imdbfan-0004576675"
                },
                "userId": "ur199159274"
              },
              "summary": {
                "originalText": "BEST MOVIE TILL DATE!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar continuously keeps you involved in its storyline, gripping your attention from the very first scene right up to the closing moments. Every sequence feels purposeful, thoughtfully crafted, and emotionally engaging. The pacing is remarkably smooth, giving you no chance to drift away or feel disconnected. In fact, the scenes couldn&#39;t have been executed any better-there is truly zero room for improvement in terms of visual storytelling and narrative flow.<br/><br/>One of the film&#39;s strongest assets is its casting. All the actors, including those in supporting and side roles, are perfectly chosen and deliver performances that feel natural and convincing. Each character adds value to the plot rather than simply filling space. The leads maintain a strong screen presence, but what makes Dhurandhar feel so complete is how well the ensemble complements them. Their chemistry and timing elevate the film to a whole new level.<br/><br/>The use of music deserves special appreciation, particularly the placement of the title track. It arrives at exactly the right moment, enhancing the emotional intensity of the scene without overpowering it. The soundtrack blends seamlessly with the film&#39;s tone, helping to build atmosphere and deepen the audience&#39;s connection to the characters.<br/><br/>Visually, the cinematography in Dhurandhar is vibrant and immersive. Every frame appears carefully designed, making even the simplest moments aesthetically pleasing. The direction is confident, and the storytelling feels tight, with no unnecessary subplots or forced drama.<br/><br/>Overall, Dhurandhar stands out as a complete cinematic experience-engaging, beautifully acted, and emotionally resonant. It keeps you hooked, makes you care about its characters, and leaves you with a strong impact long after the credits roll. It&#39;s rare to find a film that excels so consistently across performance, music, pacing, and visuals, but Dhurandhar manages to do it all effortlessly."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 6,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006251/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006209",
              "author": {
                "username": {
                  "text": "Jv-423"
                },
                "userId": "ur208152574"
              },
              "summary": {
                "originalText": "Strong performance"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This how spy films are meant to be, potrayed the characters realisticly and never felt any scene out of the box. Ranveer singh performance is energetic and engaging along with Sanjay dutt, akshay khanna and R Madhavan. This movie has set a benchmark for how the spy films should be unlike the movies we see where the whole movie revolves around female character and artificial patriotism."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 6,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006209/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006955",
              "author": {
                "username": {
                  "text": "shubhamjaiswal-75927"
                },
                "userId": "ur118089243"
              },
              "summary": {
                "originalText": "Stars, Action, and Unforgettable Moments"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story grips you from its opening moments, pulling you into a world where danger lurks around every corner and loyalty is constantly tested. Ranveer Singh delivers a powerhouse performance, effortlessly balancing intensity with vulnerability, making his character both relatable and formidable. The action sequences are meticulously choreographed, keeping the tension high without ever feeling overblown. Director Dhar weaves a narrative that is as emotionally engaging as it is thrilling, giving depth to each subplot while maintaining a relentless pace. The cinematography perfectly captures both the gritty underworld and the quieter human moments, making every frame visually striking. The supporting cast complements the leads beautifully, adding layers to the political and criminal landscapes. By the second half, the stakes feel monumental, and the climax delivers a payoff that is both shocking and emotionally satisfying. This is a film that commands attention and leaves a lingering impact long after the credits roll."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 13,
                "downVotes": 8
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006955/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11049396",
              "author": {
                "username": {
                  "text": "preetishenterprises"
                },
                "userId": "ur194434577"
              },
              "summary": {
                "originalText": "\"Not All Roles Need Loud Dialogues\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Subtle acting works best in espionage dramas, and Ranveer Singh clearly understands that restraint extremely well. His performance is rooted in control rather than exaggeration, which suits the genre perfectly. Espionage is not about constant loud dialogues or dramatic outbursts; it is about silence, observation, internal conflict, and calculated decisions. Ranveer sticks to this realism and plays his character with discipline, allowing the audience to read what is happening beneath the surface rather than spelling everything out.<br/><br/>Akshaye Khanna adds solid depth and balance to the film. His presence strengthens the narrative and complements the lead performance effectively. The chemistry between the two feels organic, and their performances help maintain the serious, grounded tone the story aims for. Instead of competing for attention, both actors serve the film&#39;s intent, which is refreshing to see.<br/><br/>The problem lies not in the performances but in how modern audiences often judge cinema. Many online reviews seem to equate good acting with loud dialogues, aggressive expressions, or &quot;mass&quot; moments. Espionage films demand patience and attentiveness, as much of the tension exists internally rather than on the surface. When viewers approach such films expecting instant gratification, they risk missing the subtle layers that make the genre effective.<br/><br/>Online audiences, especially younger reviewers influenced by social-media hype, would benefit from watching such films with more observation and less overreaction. Not every role needs to shout to leave an impact. Quiet, restrained performances often require more skill and understanding of character.<br/><br/>Overall, this film deserves appreciation for attempting realism and for performances that respect the genre. It may not cater to everyone&#39;s expectations, but for viewers willing to engage thoughtfully, it offers a controlled and sincere cinematic experience."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11049396/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019979",
              "author": {
                "username": {
                  "text": "himanshukothari-88168"
                },
                "userId": "ur157099732"
              },
              "summary": {
                "originalText": "Overhyped movie.."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Don&#39;t know how it got so much rating...? 🤔\nStupid movie...\nPoor direction...Poor story..\nUseless starcast..\nSanjay dutt looks so ugly in the movie...\nHe looks better in real/reel life...<br/><br/>Only thing in the movie is that Ranveer Singh looks good with the lenses...&amp; Probably trying to get into Ranbir Kapur&#39;s shoes with this new hair style..&amp; it seems that the movie was made just to glorify Ranveer Singh...<br/><br/>Siddharth Malhotra&#39;s &quot;Mission Majnu&quot; &amp; &quot;Yodha&quot; were more than 10 times better....\nThis one is a overhyped movie..."
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 4,
                "downVotes": 10
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019979/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006211",
              "author": {
                "username": {
                  "text": "sanjoydey-43533"
                },
                "userId": "ur157797586"
              },
              "summary": {
                "originalText": "A Masterpiece Cult classic by Adithya Dhar and Whole Team"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The Story telling of this movie is insane , all the characters seem so real and extraordinary. Sir Akshaye Khanna , Ranveer singh, Arjun Rampal and Sanjay Dutt and all others has done a wonderful job. The Bgm is world class. The plot is so well presented. Definitely a pride moment for Indian Cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 7,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006211/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006216",
              "author": {
                "username": {
                  "text": "srshengokar"
                },
                "userId": "ur96631091"
              },
              "summary": {
                "originalText": "Outstanding , real , shocking. What a movie, every Indian should watch it. Cinematography, acting and the pace of movie is perfect. Bollywood should learn from dhurandhar."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What a movie, every Indian should watch it. Cinematography, acting and the pace of movie is perfect. Bollywood should learn from dhurandhar.<br/><br/>What a movie, learn from dhurandhar.<br/><br/>What a movie, every Indian should watch it. Cinematography, acting and the pace of movie is perfect. Bollywood should learn from dhurandhar.<br/><br/>What a movie, learn from dhurandhar.<br/><br/>What a movie, every Indian should watch it. Cinematography, acting and the pace of movie is perfect. Bollywood should learn from dhurandhar.<br/><br/>What a movie, learn from dhurandhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 8,
                "downVotes": 4
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006216/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019907",
              "author": {
                "username": {
                  "text": "sainipankaj-74718"
                },
                "userId": "ur120197456"
              },
              "summary": {
                "originalText": "⭐ 10/10 \"Finally, a Spy Thriller India Can Be Proud Of!\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is the kind of Indian spy movie I&#39;ve been waiting for years. At a time when most spy films either become too loud or too unrealistic, this one strikes the perfect balance between intelligence, tension, and entertainment.<br/><br/>What impressed me the most is how sharp and grounded the storytelling feels. There&#39;s no unnecessary melodrama, no forced comedy just pure, tightly woven espionage with a constant sense of danger. The screenplay is layered, the pacing never drops, and every twist actually feels earned instead of thrown in for shock value.<br/><br/>The lead performance is outstanding. The protagonist carries the entire film with an intensity that feels natural, not exaggerated. Even the supporting cast delivers everyone has a purpose, and not a single character feels wasted.<br/><br/>The action sequences are clean, gripping, and realistic. The background score elevates every moment without overpowering it. And the cinematography... absolutely stunning. It gives the film an international look while staying rooted in Indian intelligence operations.<br/><br/>What truly makes Dhurandhar special is its respect for the audience&#39;s intelligence. It trusts you to follow the clues, understand the stakes, and stay invested. I found myself fully absorbed from the first frame till the last.<br/><br/>After a very long time, an Indian spy movie has genuinely impressed me. Dhurandhar sets a new benchmark and proves that India can create world-class espionage thrillers without copying anyone.<br/><br/>A must-watch.<br/><br/>Pure class. 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 8,
                "downVotes": 4
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019907/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007086",
              "author": {
                "username": {
                  "text": "swatisinghk"
                },
                "userId": "ur176149750"
              },
              "summary": {
                "originalText": "A journey that hits harder than expected"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar combines razor-sharp storytelling with breathtaking action, creating a cinematic experience that demands attention. Ranveer Singh&#39;s nuanced portrayal of a morally conflicted operative elevates the narrative, while the supporting cast adds layers of complexity. Director Dhar navigates the balance between suspenseful strategy and high-stakes combat seamlessly. Each fight feels purposeful, each dialogue carries weight, and the cinematography accentuates both tension and emotion. The score underlines the narrative without being intrusive, ensuring the film&#39;s long runtime never feels excessive. It is a masterful convergence of direction, performance, and technical finesse."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 11,
                "downVotes": 7
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007086/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011611",
              "author": {
                "username": {
                  "text": "AbhishekR-8002"
                },
                "userId": "ur211577008"
              },
              "summary": {
                "originalText": "Wow 😲 Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Well-crafted film that blends thrilling action with emotional depth. The performances are top-notch, the visuals stunning, and the storytelling powerful.<br/><br/>Ranveer Singh delivers one of his most powerful performances, supported brilliantly by Akshaye Khanna, Sanjay Dutt and the rest of the ensemble, making the film consistently engaging and impactful."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 4,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011611/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011150",
              "author": {
                "username": {
                  "text": "umeshxz"
                },
                "userId": "ur165207195"
              },
              "summary": {
                "originalText": "Unknown Gunmen"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "To all the Unknown Gunmen working selflessly for Bharat🔥.<br/><br/>You know why Pakistanis disguised as Indians in India are rattled by the movie Dhurandhar? Because it has exposed Pakistan like none other.<br/><br/>THIS SCENE WHERE THE WHOLE THEATRE EXPERIENCED PIN DROP SILENCE.<br/><br/>The 26/11 sequence in #Dhurandhar shook me to the core.<br/><br/>The real call audio, the handlers celebrating death, and Ranveer&#39;s silent collapse... it felt painfully real.<br/><br/>It&#39;s a scene that leaves you angry, heartbroken, and hollow at the same time.<br/><br/>I&#39;m still not over it. #JaiHind🇮🇳✊🏻🚩"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 4,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011150/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011588",
              "author": {
                "username": {
                  "text": "anjaliknair"
                },
                "userId": "ur132200160"
              },
              "summary": {
                "originalText": "Awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an explosive, high-adrenaline espionage thriller that commands your full attention for its entire runtime. Director Aditya Dhar delivers a gritty, immersive experience, meticulously building the complex, brutal world of the Karachi underworld. Ranveer Singh is phenomenal, trading his usual flamboyance for a restrained, piercing intensity that grounds the spy-saga, while Akshaye Khanna delivers a masterclass in magnetic, chilling villainy-the highlight of the film. The technical craft is superb, with a pulsating background score that amplifies the tension and raw, impactful action sequences. It is a bold, ambitious, and tightly-woven film that rewards patience and sets a scorching, unforgettable stage for the announced sequel. A must-watch big-screen experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 4,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011588/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011620",
              "author": {
                "username": {
                  "text": "supershiva-51965"
                },
                "userId": "ur90913025"
              },
              "summary": {
                "originalText": "Nailed it"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A great attempt at story telling using actual footage and audio from real incidents. Correct depiction of extremist ideology present in Pakistan. All the characters nailed their parts and many things and shots shown in teaser and trailer will be covered in the next part. A great movie just like Uri: The surgical strike."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 4,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011620/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11038973",
              "author": {
                "username": {
                  "text": "Wilot"
                },
                "userId": "ur33945268"
              },
              "summary": {
                "originalText": "A Relentless, Intellectual Bloodbath"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If Uri was a surgical strike, Dhurandhar is an all-out siege. Spanning a massive 214 minutes, it avoids the &quot;3-hour slump&quot; by shifting its weight between visceral, R-rated action and a &quot;Trojan Horse&quot; plot that demands your constant attention. It is a rare action film that treats its audience as chess players rather than just spectators.<br/><br/>Action: Grounded, Brutal, and Kinetic\nUnlike the floaty, digital spectacle of modern blockbusters, the action here feels dangerously heavy.<br/><br/>The &quot;Splatter&quot; Realism: From motorcycle chases through narrow Karachi alleys to the &quot;meat-hook&quot; sequences, the violence is unflinching. It doesn&#39;t rely on slow-motion &quot;hero moments&quot;; instead, the choreography emphasizes the raw desperation of a spy fighting to survive deep undercover.<br/><br/>Sound as a Weapon: The background score by Shashwat Sachdev-blending Arabic hip-hop with metallic, industrial beats-turns every shootout into a sensory assault that keeps the adrenaline levels high for the entire runtime.<br/><br/>The Plot: A Labyrinth of Betrayal\nThe &quot;good plot twists&quot; you mentioned are the film&#39;s true engine. Rather than a simple good-vs-evil story, Dhurandhar plays with nested identities:<br/><br/>The Long Game: Ranveer Singh&#39;s Hamza Ali Mazari isn&#39;t just a spy; he is a man playing a role within a role. The script keeps you guessing whether he has genuinely been &quot;turned&quot; by the brotherhood of Akshaye Khanna&#39;s charismatic Rehman Dakait.<br/><br/>The Moral Grey: The biggest twist isn&#39;t a &quot;whodunnit&quot; but a &quot;who-am-I.&quot; The film brilliantly dismantles the bond between the hero and the villain, showing how nationalism can lead to a betrayal that feels as cold as it is necessary.<br/><br/>Standing Out in the Genre\nWhile many spy films (like the YRF Spy Universe) opt for &quot;Barbieland&quot; glamour, Dhurandhar feels lived-in. Akshaye Khanna&#39;s performance as the calculating mobster is a masterclass in quiet menace, often stealing the screen from the more restrained Ranveer Singh. It&#39;s the interplay between these two-and the shocking &quot;Part 1&quot; cliffhanger-that makes the length feel earned.<br/><br/>Final Verdict: Dhurandhar is a &quot;quantum leap&quot; for Indian action cinema. It&#39;s long, it&#39;s loud, and it&#39;s unapologetically violent, but it has the brains to match its brawn."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11038973/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016176",
              "author": {
                "username": {
                  "text": "movie_goer82"
                },
                "userId": "ur23328625"
              },
              "summary": {
                "originalText": "Very lengthy and over stretched"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This should have been a web series. It had few moments of its own, but most of the time it was boring and over stretched.<br/><br/>By the end of three and half hours, I had reached the point where I wanted to leave the hall without completing it.<br/><br/>Akshay Khanna did shine as Rehman dakait. He is very talented and underutilized actor in Bollywood. Whatever role is thrown at him, he adds soul into it.<br/><br/>The story is twisted narrative of actual events and the person (Ajit Dobhal in reality) played by the R Madhavn is the real culprit who went to Kandhar to release Azhar masood during Atal Bihari government. Later Azhar formed JeM and did various terror attacks on India.<br/><br/>Don&#39;t go to the theatre to learn the history because the fake version of it is shown in the movie. If you are an action spy movie fan, then only go for it."
                }
              },
              "authorRating": 3,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 9,
                "downVotes": 33
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016176/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007002",
              "author": {
                "username": {
                  "text": "alwayshappy-14068"
                },
                "userId": "ur118089338"
              },
              "summary": {
                "originalText": "Star-Studded Entertainment for Everyone"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling is immersive and layered, drawing viewers into a web of crime, politics, and personal vendettas. Ranveer Singh&#39;s performance is electric, balancing ferocity with quiet introspection, while the director&#39;s commitment to detail ensures the narrative never loses focus. The action sequences are grounded yet thrilling, blending realistic choreography with cinematic flair. Secondary characters, each distinct and purposeful, add depth to the storyline. Cinematography captures both the grandeur of cityscapes and the claustrophobic tension of alleyways and hideouts. The editing masterfully maintains suspense, gradually building toward an explosive second half. Every beat feels intentional, from the subtle glances between characters to the high-stakes confrontations. The film&#39;s ability to mix political intrigue with personal drama results in a rich, unforgettable viewing experience, leaving audiences in awe of its scale and precision."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 10,
                "downVotes": 7
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007002/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011650",
              "author": {
                "username": {
                  "text": "jaydeepmishra-92208"
                },
                "userId": "ur118952325"
              },
              "summary": {
                "originalText": "Enthralling Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s one of the best movies made on espionage...well-researched and well-written, with great acting and great direction...Dhar&#39;s direction is a masterclass in tension-building, structured in chapters that mirror a documentary&#39;s urgency. The screenplay, co-written with the director, weaves real archival footage with visceral recreations, blurring lines between fact and fiction in spine-chilling sequences-like a red-tinted assault where haunting audio of victims&#39; voices pierces the silence. Action set pieces are choreographed with brutal realism: no glossy CGI excesses, just bone-crunching hand-to-hand combats and sniper duels that leave you breathless. It&#39;s a film that prioritizes &quot;we will enter your home to kill&quot; over subtle and useless diplomacy. Ranveer Singh is subtle and layered...easily his best performance...Akshaye Khanna is charming and ruthless at the same time...Arjun Rampal looks like a demon...Madhvan looks uncanny like Ajit Doval...Rakesh Bedi is great in the role of a cunning politician...Sanjay Dutt is Sanjay dutt on screen which suits his character...Sara Arjun also plays her role pretty well...Danish Pandor, Saumya Tandon and actors playing khanani brothers are good too.."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011650/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011638",
              "author": {
                "username": {
                  "text": "IAMNOTVISHAL"
                },
                "userId": "ur203525334"
              },
              "summary": {
                "originalText": "Go and watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Just watched Dhurandhar what a eye opening BLOCKBUSTER!<br/><br/>From cinematography to music to the powerful storytelling, everything felt top-class.<br/><br/>Aditya Dhar sir, I&#39;m truly amazed by your direction.<br/><br/>Would love to work with you in any capacity crew, logistics, anything. It would be an honour to assist you someday! 🙏🎬<br/><br/>Anti critic ki MKC💀"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011638/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006077",
              "author": {
                "username": {
                  "text": "vickys-5336"
                },
                "userId": "ur211542144"
              },
              "summary": {
                "originalText": "BEST SPY THRILLER MOVIE IN BOLLYWOOD TILL DATE"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Have not seen this kind of cinema made in bollywood ever, aditya dhar just killed it. The depiction of story was very interesting and realistic. Background music made it more interesting, never felt bored even for a minute while watching the film. The integration of real life footage of terrorist attacks was too much needed. 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006077/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}