{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xopdjptazcwzy476wxxnzsrlqmobj334ptd4hla3c7ytttfjrkydc3oi2v5njcb4dwyacks5tfdf7dm4qg5bsnkgzki",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11029201",
              "author": {
                "username": {
                  "text": "getkenny"
                },
                "userId": "ur31588758"
              },
              "summary": {
                "originalText": "You too Brutus??"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every once in a while, a film comes along that reminds you why you fell in love with cinema in the first place. Dhurandar is that film.<br/><br/>From the opening scene, you&#39;re swept into a masterclass in storytelling. Aditya Dhar weaves a sprawling, 3.5-hour epic that somehow does not feel long. The entire theater sat in silence-glued to their seats, breathless. The film&#39;s clever chapter-by-chapter structure is pure genius. Each segment builds like a well-paced novel, and one stunning chapter even draws bold inspiration from Shakespeare&#39;s Julius Caesar.<br/><br/>The music is rocket fuel for this film. It doesn&#39;t just sit in the background; it drives scenes forward, lifts emotions, and pushes the story to its full potential, like powering a high-performance engine.<br/><br/>When it comes to action and visual effects, Dhurandar delivers something rare in Bollywood: raw, brutal &amp; unfiltered. Here, the action feels real, gritty, and visceral-reminding me of the savage intensity of Mad Max. It&#39;s honest and utterly thrilling.<br/><br/>But the true magic lies in the performances. Ranveer Singh transforms completely -a sher amongst lions like Scar from The Lion King.<br/><br/>Akshaye Khanna delivers a performance for the ages. His character is so deeply felt, so unforgettable, it will echo in film history-much like his Sid in iconic Dil Chahta Hai.<br/><br/>Rakesh Bedi, meanwhile, slips into the skin of a spineless politician with such precision it feels like a tailor-made glove. And then there&#39;s Madhavan and Arjun Rampal: both radiating menace, but standing on opposite ends of the spectrum.<br/><br/>Yes, Dhurandar touches on real-world politics. And why shouldn&#39;t it? Cinema has always been a mirror to society-a place where we confront hard truths, celebrate our struggles, and imagine a better world. To dismiss a film because it dares to address issues threatening our nation&#39;s freedom is to miss the point of art entirely.<br/><br/>Dhurandar isn&#39;t just a movie; it&#39;s a celebration of everything great about cinema. If you love film, see this. It will remind you why you do.<br/><br/>Ps: I am also glad the next part comes sooner than later."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029201/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008643",
              "author": {
                "username": {
                  "text": "Debaditya-4"
                },
                "userId": "ur211557442"
              },
              "summary": {
                "originalText": "This movie is a true Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Indian cinema has entered a new era with this film. And it&#39;s upward from here.<br/><br/>Amazing cast, gripping storyline, spellbinding cinematography and art direction and an oit of this world BGM.<br/><br/>All this plus the grave threat our country faces shown so tactfully with all the political and real life incidents."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008643/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007120",
              "author": {
                "username": {
                  "text": "maisumansingh"
                },
                "userId": "ur196195237"
              },
              "summary": {
                "originalText": "The perfect storm of character, chaos, and charisma"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the opening scene, Dhurandhar grabs your attention and never lets go. Ranveer Singh is phenomenal, full of energy and emotion. Sanjay Dutt, Akshaye Khanna, and R Madhavan give performances that feel effortless and real. Arjun Rampal is excellent in action scenes, and Sara Arjun touches your heart. Aditya Dhar&#39;s direction makes a complex story simple and engaging. The combination of politics, drama, and intense action makes it exciting throughout. Every minute is worth it, and the movie leaves a lasting impression."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007120/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014501",
              "author": {
                "username": {
                  "text": "mk-48750"
                },
                "userId": "ur103887137"
              },
              "summary": {
                "originalText": "Forget flying cars. Dhurandhar brings raw, bone-crunching hand-to-hand combat that feels dangerously real. This is action with consequences."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar has done it again. Moving past the high-josh of Uri, Dhurandhar dives deep into the gritty, shadowy world of covert ops, and the result is spectacular. This isn&#39;t a polished, stylish spy fest; it is a raw, bloody, and intense slow-burn that keeps you on edge for nearly nearly 3.5 hours.<br/><br/>Ranveer Singh delivers a career-defining performance as Hamza, stripping away his usual energy for a simmering, intense portrayal of a spy living on a knife&#39;s edge. But the surprise package is Akshaye Khanna-his portrayal of Rehman Dakait is chilling, understated, and absolutely magnetic.<br/><br/>The film&#39;s &#39;chapter&#39; structure gives it a novel-like depth, and the action sequences are grounded in realism rather than gravity-defying stunts. While the runtime is long, the payoff in the final act (and that cliffhanger!) makes every minute worth it.<br/><br/>Verdict: A brutal, brilliant, and brave piece of cinema. Don&#39;t wait for OTT-experience the sound design and tension in a theater."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014501/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007591",
              "author": {
                "username": {
                  "text": "manishhsen"
                },
                "userId": "ur154427183"
              },
              "summary": {
                "originalText": "Action, Emotion, and Star Power Combined"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every frame of this film feels carefully calculated to draw the audience deeper into its world. Ranveer Singh&#39;s portrayal of Hamza is both commanding and deeply human, allowing the audience to feel his internal conflicts. The director&#39;s approach to pacing ensures that even during quieter scenes, tension simmers beneath the surface. Action sequences are choreographed with sharpness and clarity, providing adrenaline without overshadowing the story. The screenplay masterfully balances crime, politics, and personal relationships, and each supporting actor leaves a distinct mark, making the narrative feel lived-in and authentic."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007591/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029134",
              "author": {
                "username": {
                  "text": "SubhankarD-410"
                },
                "userId": "ur211709677"
              },
              "summary": {
                "originalText": "One of the Best Spy thrill of Bollywood, India"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ranveer and Akshaye Khanna both were brilliant. The level of intensity they brought to the screen was just commendable. Aditya Dhar, Kudos to you man... What a lovely way of story telling. A movie of 3:32 hours, but didn&#39;t make bore for a minute.<br/><br/>You&#39;re the new favourite. Arjun Rampal, Sanjay and Maddy is also great. Waiting for part 2 eagerly."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029134/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026782",
              "author": {
                "username": {
                  "text": "rajji-p"
                },
                "userId": "ur36927052"
              },
              "summary": {
                "originalText": "Must watch movie by every Indian"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Good narration and direction. I was waiting for the scenes released to more Ajit Doval unknown men killing terrorists, but not many. Can&#39;t wait to see 2nd part for more feel good real incidents.<br/><br/>Unbelievable how much Indian army goes through to achieve such successful operations.<br/><br/>Every actor gave their best. Another masterpiece by Aditya Dhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026782/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007621",
              "author": {
                "username": {
                  "text": "imdbfan-3178182703"
                },
                "userId": "ur199251067"
              },
              "summary": {
                "originalText": "Thrills, Drama, and Unforgettable Stars"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watching this film is like navigating a minefield of tension and intrigue. Ranveer Singh delivers a powerhouse performance, conveying both the cunning and vulnerability of his character. The supporting cast is exceptional, with each character feeling fully realized and crucial to the story. Director Dhar&#39;s precision in crafting each scene ensures that suspense builds steadily, punctuated by high-impact action sequences. The background score intensifies every dramatic beat, and the cinematography frames every moment with visual storytelling that enhances the narrative. The film&#39;s exploration of moral ambiguity, loyalty, and betrayal is compelling, making it both thrilling and thought-provoking."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007621/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004764",
              "author": {
                "username": {
                  "text": "du-56128"
                },
                "userId": "ur131879754"
              },
              "summary": {
                "originalText": "A Must watch movie."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; is an absolute winner on every front. The story is gripping and brilliantly crafted, keeping you hooked from start to finish. The background music elevates every moment - whether it&#39;s action, emotion, or suspense, the BGM perfectly complements the narrative and enhances the overall experience.<br/><br/>Akshay Khanna delivers a phenomenal performance; his screen presence, expressions, and dialogue delivery are simply outstanding. Ranveer Singh and Arjun Rampal match the intensity with their powerful and controlled acting, adding great depth to the film. The trio&#39;s performances make the movie even more engaging and impactful.<br/><br/>The visual scale, storytelling, and performances make &quot;Dhurandhar&quot; a film that truly deserves to be experienced on the big screen. This is one movie you should definitely watch in the theatre for its full impact."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004764/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012956",
              "author": {
                "username": {
                  "text": "ashrut-jain"
                },
                "userId": "ur47224928"
              },
              "summary": {
                "originalText": "When the time comes nothing can stop an actor."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Simple pointers:\n1. Every filmmaker has a constitutional right to tell a story. Be it Mulk, Kashmir files, PK or Dhurandhar. So I think people spreading unnecessary criticism is not needed.<br/><br/>2. I was not able to take my eyes off Akahay Khanna. We all know him from 30 years but his time is now and even the heaven cannot stop him now. Shows the importance of time for an actor.<br/><br/>3. Music is outstanding. Loved the fact that they have portrayed woman in modern light.<br/><br/>Good work team."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012956/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029619",
              "author": {
                "username": {
                  "text": "SapnaK-68"
                },
                "userId": "ur208311439"
              },
              "summary": {
                "originalText": "🇮🇳🎬 Dhurandhar - Review (No Spoilers)"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is not just a film - it feels like an experience that stays with you even after you leave the theatre. The storytelling is strong and smooth, and at no point does it feel forced. The narrative pulls you in quietly and keeps you emotionally connected till the end.<br/><br/>What truly stands out is how real and believable everything feels. Every actor has performed with honesty - no overacting, no unnecessary drama. The emotions, dialogues, and reactions feel natural, making the characters feel like real people rather than reel heroes.<br/><br/>This film carries a deep sense of respect for India and its true fighters - especially the Army and the countless unknown soldiers whose sacrifices often go unnoticed. The emotions are subtle but powerful, and they hit you at the right moments without being loud.<br/><br/>The direction is mature, the background score supports the mood beautifully, and the film gives space to silence where needed - which makes the impact even stronger. It&#39;s the kind of cinema that makes you feel proud, emotional, and reflective at the same time.<br/><br/>Everyone who truly loves India, respects our soldiers, and believes in the sacrifices of our brave men and women should watch this film at least once in theatres. Some stories deserve to be experienced on the big screen.<br/><br/>⭐ Highly recommended."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029619/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11019005",
              "author": {
                "username": {
                  "text": "Shriyanshk-65"
                },
                "userId": "ur211633290"
              },
              "summary": {
                "originalText": "Amazing blend of real story and fiction."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Shows truth that no one ever showed. Amazing work and happy to see that they showed the reality to everyone on big screen without misleading with real names and events. The action is out of this world. The movie hit soo hard that the emotions were went high, Patriotism, thrill, anger every emotions were high."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11019005/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029979",
              "author": {
                "username": {
                  "text": "Swapnil-782"
                },
                "userId": "ur211570896"
              },
              "summary": {
                "originalText": "Dhurandhar is a Masterpiece. YRF spy movies were all garbage ."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is brilliant from the first scene till the last . There&#39;s never a dull moment . The storytelling, the cinematography the the bgm , the score , everything was tuned to perfection . The diverse music 🎶 from 90&#39;s hits to hanuman kind , everything blended in so beautifully . Maddy ( R madhavan ) was brilliant, so was Sanjay dutt . Ranveer singh nailed it as Hamza , but there was this one man who outshines everyone else !!! Oscar ( Akshaye ) Khanna !!!<br/><br/>The movie&#39;s depiction of real life adversities and Pakistan sponsored terror attacks was on point and well researched. Those real footages and conversations between terrorists and handlers boiled every Indian&#39;s blood. This is how Truth is shown This is how a Movie is made .This is Absolute Cinema ."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029979/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018246",
              "author": {
                "username": {
                  "text": "vm-77306"
                },
                "userId": "ur196780891"
              },
              "summary": {
                "originalText": "DHURANDHAR IS ADDICTIVE"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "3 hours 32 minutes duration that is NOT FELT from the start of the movie, you get hooked and feel like you can watch the second part too. It&#39;s made so well that you get addicted to it and want to dive deeper into the story. Seen it 3 times in the theatre definitely gonna go for the fourth time, it is a Must Watch for people who claim that Bollywood has stopped making good movies, this is one of the best grounded spy movie. The cameras are handheld with raw touch to them, the lightings also feel real be it outdoor or indoor. The details that they added to every scene is insane."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018246/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029531",
              "author": {
                "username": {
                  "text": "vijayaryan-26216"
                },
                "userId": "ur134144371"
              },
              "summary": {
                "originalText": "My Salute"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Finally, something good from Bollywood after so long! Or maybe I should say it was almost perfect-just take out the Ajit Doval scenes. I know they were a necessary part of the story, but they didn&#39;t quite fit the flow. Other than that, my god, the film was on absolute steroids, especially in the chaotically beautiful second half.<br/><br/>It was full of an amazing cast and sets that made me feel like I was living in dirty 2000s Karachi. The action was some of-if not the-greatest in any Bollywood film. Some scenes were so jaw-dropping that I forgot to breathe while my jaw kept dropping lower and lower.<br/><br/>And finally, the boldness to portray the story in its truest form. Salute to all those unknown gunmen who do such things, living in these harsh conditions for years without seeing their families, where danger lurks around every corner and you could die at any second. Why do they do it? I am sure they aren&#39;t going to have immense wealth or a dream of a happy, nice life afterward. Is it only the love for our nation (which is imperfect in so many ways) that makes them carry out these tasks? Maybe these great men have hope that someday this country will thrive. No matter how many corrupt politicians, selfish businessmen, or &#39;sar tan se juda&#39; gangs persist, Hindustan has never knelt, and it won&#39;t in the future."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029531/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11037588",
              "author": {
                "username": {
                  "text": "imdbfan-9753823899"
                },
                "userId": "ur199232673"
              },
              "summary": {
                "originalText": "this is how you make a spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is perfect mix of action,drama,storytelling and music.<br/><br/>Especially second half&#39;s action sequence it was damn good.everyones acting was really good.ranveers eyes talk to us and akshaye khannas aura was unmatchable.<br/><br/>Cant wait for dhurandhar part 2 hope they release it a bit late and create hype for it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11037588/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006731",
              "author": {
                "username": {
                  "text": "imdbfan-4644583677"
                },
                "userId": "ur198933662"
              },
              "summary": {
                "originalText": "High-Octane Action with a Stellar Cast"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative slowly tightens its grip, immersing audiences in a world of danger, loyalty, and moral conflict. Ranveer Singh anchors the story with precision, Sanjay Dutt commands presence, and Akshaye Khanna and R Madhavan add complexity. Arjun Rampal&#39;s menace and Sara Arjun&#39;s emotional performance raise the stakes. Aditya Dhar&#39;s direction integrates suspense, strategy, and action seamlessly. Cinematography captures both vast chaos and intimate moments, and the sound design accentuates tension. By the climax, the film delivers an unforgettable cinematic experience."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006731/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022582",
              "author": {
                "username": {
                  "text": "samyachatterjee"
                },
                "userId": "ur113774534"
              },
              "summary": {
                "originalText": "Best spy movie I have watched in recent years"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I finally caught Dhurandhar in theaters this weekend, and honestly, I&#39;m still recovering. If you&#39;re on the fence about committing to a 3.5 Hour runtime, just go for it this isn&#39;t your typical polished spy thriller; it&#39;s a gritty, violent, and absolutely relentless beast of a film.<br/><br/>The Vibe:\nDirector Aditya Dhar (of Uri fame) has completely flipped the script here. Instead of glossy locations, we get dropped straight into the claustrophobic, chaotic alleyways of Lyari, Karachi. The atmosphere is suffocating in the best way possible. You can practically feel the dust and tension. It feels less like a standard Bollywood actioner and more like a raw crime saga think Gangs of Wasseypur meets intense espionage.<br/><br/>The Performances:\nRanveer Singh is, expectedly, a powerhouse. Playing Hamza Ali Mazari (an undercover Indian spy), he sheds his usual flamboyant energy for something much darker and more feral. There are moments where he doesn&#39;t even speak, just conveys sheer panic and resolve with his eyes.<br/><br/>But-and I can&#39;t believe I&#39;m saying this-Akshaye Khanna steals the show. As the gangster Rehman Dakait, he is terrifyingly calm and charismatic. Every time he&#39;s on screen, the tension spikes. The dynamic between him and Ranveer is the heartbeat of the movie. Also, seeing Arjun Rampal back as the menacing ISI agent Major Iqbal and R. Madhavan as the intelligence chief brings such a solid weight to the cast.<br/><br/>The Music &amp; Action\nThe background score by Shashwat Sachdev is pulsating and heavy, perfectly matching the on-screen violence. Speaking of violence-be warned, this is a hard &quot;A&quot; rated film. The action is brutal, messy, and looks painfully real.<br/><br/>The Verdict:\nIs it perfect? Maybe not. It&#39;s long, and the political undertones might be heavy for some. But as a piece of cinema, it&#39;s a massive achievement. The cliffhanger ending sets up the sequel perfectly.<br/><br/>Bottom Line: Don&#39;t wait for OTT. This is a theatrical experience. Watch it for the scale, the insane performances, and the fact that Bollywood finally made a spy film that feels dangerous."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022582/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007448",
              "author": {
                "username": {
                  "text": "harneet-30363"
                },
                "userId": "ur132668877"
              },
              "summary": {
                "originalText": "Totally worth watching!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Maza aa gaya! The movie was seriously entertaining from beginning to end. The story kept me hooked throughout, the performances were full of energy, and the BGM was absolutely 🔥, lifting every scene to another level. Not a single dull moment - totally worth watching. I enjoyed every bit of it and would happily watch it again. Solid 10/10!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007448/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11031892",
              "author": {
                "username": {
                  "text": "ajitishika"
                },
                "userId": "ur155570519"
              },
              "summary": {
                "originalText": "Brilliantly made movie..the best movie on spyverse.."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Hats off to the director Aditya dhar for the concept ,content,editing,screenplay and directing such marvelous action sequences..top of the line..every character played so brilliantly..I never felt that the movie was more than 3 hours..this movie has blown away every indian ,no wonder it&#39;s making such huge collections every day..a must watch film."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11031892/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010922",
              "author": {
                "username": {
                  "text": "Arvindj-08"
                },
                "userId": "ur211569886"
              },
              "summary": {
                "originalText": "Worth watching"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurendar is an absolute powerhouse of a film, and I strongly recommend everyone to watch it! From the very first frame, the movie grabs your attention with its stunning visuals, intense background score, and a hero entry that sends pure chills down your spine. The story moves with a perfect balance of mass action, emotion, and suspense, keeping you hooked without a single dull second. The villain is written brilliantly, adding real weight and tension to the narrative. What truly makes the movie shine is the hero&#39;s emotional arc - raw, inspiring, and performed with unbelievable conviction. The action sequences are explosive, the dialogues hit hard, and the entire film feels like a grand cinematic celebration. Dhurendar is not just a movie, it&#39;s a thrilling experience that deserves to be watched on the biggest screen possible!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010922/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11032099",
              "author": {
                "username": {
                  "text": "sharmasanidhya-38063"
                },
                "userId": "ur99904291"
              },
              "summary": {
                "originalText": "Worst"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar - Movie Review<br/><br/>Dhurandar is a completely bakwas movie and a total waste of time. The story is weak and confusing, with no proper flow or purpose. Scenes feel random, and there is nothing in the film that keeps the audience engaged.<br/><br/>The acting is poor and looks forced. Dialogues are boring and sometimes cringe-worthy, making serious scenes unintentionally funny. Direction and editing are also very bad-the movie feels unnecessarily long and slow, with many useless scenes.<br/><br/>Music and background score fail to make any impact. Overall, Dhurandar offers no entertainment or value. It&#39;s best to skip this movie and save your time for something better."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-16",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11032099/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11079060",
              "author": {
                "username": {
                  "text": "northwest21"
                },
                "userId": "ur17971158"
              },
              "summary": {
                "originalText": "Loved this movie but with one evident flaw"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "No doubt this is a masterpiece. This movie has the potential to redefine Indian cinema like Satya. Everyone was perfect for their role. But I found one serious flaw which almost killed my interest.<br/><br/>At the end, in the car, Rehman picks a blade to fight Hamza. But when SP Chaudary shoots at Rehman, Rehman and Donga had every type of gun to defend themselves. They had every opportunity to kill Hamza with all the guns they had but instead use a blade.<br/><br/>Instead, the guns should&#39;ve been in the trunk and when SP attacks them, breaking the back windshield from the back seat and taking the guns would&#39;ve been more convincing."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-31",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11079060/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011331",
              "author": {
                "username": {
                  "text": "AyushS-8972"
                },
                "userId": "ur211565943"
              },
              "summary": {
                "originalText": "Good"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is a lively, crowd-pleasing entertainer that blends action, comedy, and emotional drama with surprising finesse. At its core, the film is driven by its charismatic lead, whose performance anchors the story even when the plot occasionally leans on familiar tropes. What makes Dhurandar engaging is not just its hero-centric narrative, but the way it uses humor and heartfelt moments to maintain an energetic rhythm from start to finish.<br/><br/>The story follows Dhurandar, a street-smart problem solver with a knack for turning chaotic situations into opportunities. When he becomes entangled in a local political conspiracy, the film shifts gears from light comedy to a more layered drama, revealing the vulnerabilities beneath his swagger. The screenplay balances these tonal shifts well, giving the character a satisfying arc that extends beyond the usual &quot;larger-than-life&quot; persona.<br/><br/>Supporting characters add color and depth, particularly the comic sidekick and the sharp, grounded female lead who often steals scenes with her wit. The villain, though somewhat formulaic, delivers enough menace to keep the stakes high. The dialogue is punchy and clever, offering plenty of memorable lines without feeling forced.<br/><br/>Technically, Dhurandar shines with its vibrant cinematography and energetic action sequences. The music is catchy and well-placed, enhancing both the emotional beats and the high-octane moments. A few pacing issues appear in the second half, where the plot dips into predictable territory, but the film quickly recovers with a strong, satisfying finale.<br/><br/>Overall, Dhurandar is an enjoyable, well-crafted entertainer that knows exactly what it wants to be. It delivers humor, heart, and heroism in equal measure-making it a worthy watch for fans of commercial cinema.<br/><br/>If you&#39;d like, I can also write a negative review, spoiler-filled analysis, or shorter/longer versions."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011331/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024338",
              "author": {
                "username": {
                  "text": "piyush-saraogi88"
                },
                "userId": "ur28689071"
              },
              "summary": {
                "originalText": "You Don't Just Watch Dhurandhar - You Live It"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar felt strikingly real - restrained, grounded, and never over-the-top.<br/><br/>The characters felt human, the storytelling honest, and not a single sequence felt unnecessary.<br/><br/>Excellent cinematography paired with a background score that quietly elevates every moment.<br/><br/>The inclusion of real audios, visuals, and names adds authenticity and depth.<br/><br/>This is a film meant to be seen in a theatre - you don&#39;t just watch it, you come out feeling like you lived through it."
                }
              },
              "authorRating": null,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024338/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}