{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xoddzktazcwzy476thrnbqr7tmsars2motr4pnaxb6mqbdf4skydkypeyf5pzyocteetaw5ufqkdwcneotby2uexcq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11016445",
              "author": {
                "username": {
                  "text": "VishweshT-2"
                },
                "userId": "ur211611139"
              },
              "summary": {
                "originalText": "Factually authentic and accurate"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A no drama, spurious or factual adulteration kind of a movie. It is a realistic action blockbuster movie, showcasing chronological facts and timeline of all the evil terrorising events done by Pakistan and few sleeper cell&#39;s that involve corrupt politicians of India aiding Pakistan.<br/><br/>The star cast selection is on point. Dhurandhar as a movie 🎥 gives an enthralling experience to its viewers who would be watching 👀 it in their nearby cinema halls.<br/><br/>Excitedly awaiting to watch the next part of Dhurandhar😍.<br/><br/>#Dhurandhar is a Dhurandhar movie to watch 💯."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016445/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004091",
              "author": {
                "username": {
                  "text": "Abhishek-0810"
                },
                "userId": "ur211531260"
              },
              "summary": {
                "originalText": "More Than Just Action: Grounded, Gritty, and Absolute Spy Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I went into Dhurandhar with mid expectations. The 4-minute trailer made it look like just another violent action movie, but I was completely surprised. While the movie is grounded, gritty, and impressive, I must state upfront that it isn&#39;t anywhere close to Kashyap&#39;s Black Friday, which remains the absolute benchmark for storytelling and its gutsy willingness to name names. However, Dhurandhar is a spy thriller told in its own unique way, and it does complete justice to the genre.<br/><br/>Director Aditya Dhar has done some serious work here. The writing is amazing, particularly the character arcs. He brilliantly weaves in historic terror attacks on India-the IC 814 hijack as the triggering incident, the 2001 Parliament attack, and the 26/11 Mumbai attacks-along with the key characters into a linear storyline that remains so engaging, you won&#39;t mind its 3.5-hour runtime. The treatment makes it feel frighteningly real. One scene, in particular, blew my mind: the screen goes entirely red, and a real recording plays with a transcript. That scene alone showcases the kind of maniacs we are dealing with.<br/><br/>The world-building is believable; it feels lived-in and authentic. The movie also shines in its minute details and research-for example, the mention of &quot;burger kids,&quot; which was slang used in Pakistan at the time for privileged, over-sensitive youth. Dhar uses this to contrast those oblivious kids with the dark, politically motivated bloodshed, orchestrated for power or personal vendettas.<br/><br/>While the story is satisfying, major plot points are reserved for the sequel. The good news is we don&#39;t have to wait long; the next part arrives in March 2026. Dhurandhar is an amazing spy thriller told in its own unique way. Don&#39;t miss it."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004091/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007203",
              "author": {
                "username": {
                  "text": "jparas-02310"
                },
                "userId": "ur118093867"
              },
              "summary": {
                "originalText": "Stars, Drama, and Non-Stop Excitement"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses audiences in a world of danger, loyalty, and moral ambiguity. Ranveer Singh delivers a layered performance, portraying a character torn between conscience and ambition, while Sanjay Dutt exudes authority and menace. Akshaye Khanna and R Madhavan enrich the narrative with intelligence and subtlety, and Arjun Rampal&#39;s quiet menace keeps tension taut. Sara Arjun&#39;s emotionally resonant scenes humanize the story. Aditya Dhar directs with precision, blending suspense, strategy, and adrenaline-filled action. Cinematography captures both chaotic environments and intimate character moments, and the score accentuates every beat of suspense and drama. By the second half, the story escalates into a thrilling, emotionally charged climax."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007203/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012866",
              "author": {
                "username": {
                  "text": "SajjadZ-16"
                },
                "userId": "ur211586689"
              },
              "summary": {
                "originalText": "Absolute Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I loved this movie, definitely one of the best Bollywood movie I&#39;ve watched in a long time. The violence paired with the BGM gives an absolute masterpiece and a new experience. Ranveer Nailed the character. However I think the heroine should have been someone else, Sara Arjun is a good character but she did not look good on screen with ranveer."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012866/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014813",
              "author": {
                "username": {
                  "text": "pranjal-56"
                },
                "userId": "ur211601028"
              },
              "summary": {
                "originalText": "Just Perfect!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those rare Bollywood films where the craft genuinely rises above everything else. What impressed me most is that the movie is not carried by just one performance. Akshaye, Rampal, Sanjay, Ranveer - everyone comes in with the presence of a lead, and together they hold the film with remarkable balance. Ranveer plays his part exactly the way it should be played, without overshadowing the world the film is trying to create."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014813/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11003871",
              "author": {
                "username": {
                  "text": "pahepoo"
                },
                "userId": "ur175505272"
              },
              "summary": {
                "originalText": "Watch it for its brilliance"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I loved the movie, this is how spy movies should be made- Great acting, good story, superb direction and wonderful screenplay. Aditya Dhar has done what no other director has come close to doing, give us a spy thriller with actual substance.<br/><br/>The BGM is fantastic, Akshaye Khanna has done a phenomenal job as always, I think Aditya Dhar definitely needs a lot of props for making the movie stating the truth even if it is uncomfortable.<br/><br/>There is a lot of talk about movie being long, good stories have always been long, I would much rather watch a Dhurandhar than watching a Pathan or Tiger movie."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11003871/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010095",
              "author": {
                "username": {
                  "text": "rahulkr-99949"
                },
                "userId": "ur71212429"
              },
              "summary": {
                "originalText": "Excellent movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a standout movie that keeps you engaged from start to finish. The story is fresh, well-crafted, and filled with impactful moments. Performances are strong, direction is sharp, and the music enhances every scene beautifully. It&#39;s a perfect mix of action, drama, and entertainment. A thoroughly enjoyable film and definitely worth watching!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010095/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022776",
              "author": {
                "username": {
                  "text": "Ganeshg-328"
                },
                "userId": "ur211662718"
              },
              "summary": {
                "originalText": "A must watch movie of this year"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Solid concept and content, extraordinary acting by every actor and the co actors , Akshay khanna nailed the performance by his solid screen presence, ranbir singh also give his excellent performance as a spy agent the next part of this movie is going mind blowing, the story and the screenplay is very engaging."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022776/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014383",
              "author": {
                "username": {
                  "text": "dipankardutta-59351"
                },
                "userId": "ur132255754"
              },
              "summary": {
                "originalText": "Excellent"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an absolute powerhouse of a film-one that grips you from the very first frame and refuses to let go. The movie delivers a rare combination of brilliant acting, tight storytelling, and a flawlessly executed screenplay, making it a truly memorable cinematic experience.<br/><br/>The performances are nothing short of exceptional. Every actor immerses themselves completely into their character, elevating each scene with raw emotion and authenticity. The storytelling is smooth, engaging, and layered, keeping you invested till the very end. The screenplay deserves special praise for its sharp writing, natural flow, and gripping pace.<br/><br/>Overall, Dhurandhar is a must-watch for anyone who appreciates top-tier filmmaking. It&#39;s one of those films that stays with you long after the credits roll."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014383/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016785",
              "author": {
                "username": {
                  "text": "moupriyasarkar-16106"
                },
                "userId": "ur155338438"
              },
              "summary": {
                "originalText": "Must watch of 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film handles real incidents with style and intensity. The acting is phenomenal, the action is explosive, and the music is absolutely top class. From teaser to trailer to the final movie, it&#39;s an absolute visual and emotional delight. The direction and research deserves huge appreciation.<br/><br/>Despite being 3 hours 30 minutes long, the movie keeps you fully engaged-time just flies! A top-notch film that stays with you long after the credits roll."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016785/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11060768",
              "author": {
                "username": {
                  "text": "guptaritesh-61117"
                },
                "userId": "ur149252005"
              },
              "summary": {
                "originalText": "Bollywood wasn't ready for this !"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar was an absolute blast!<br/><br/>The director really knew what he was doing- the story pulls you in and doesn&#39;t let go. And Akshay Khanna? Bhai came, acted, and quietly stole the entire movie right from under Ranveer Singh&#39;s nose.<br/><br/>Also, for the people calling it an &quot;propaganda movie&quot;... honestly, y&#39;all need to relax. Not every film is a secret mission - sometimes it&#39;s just a solid entertainer, and Dhurandhar delivers big time.<br/><br/>Now waiting for Part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11060768/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013134",
              "author": {
                "username": {
                  "text": "HimanshuP-249"
                },
                "userId": "ur211125724"
              },
              "summary": {
                "originalText": "Amazing thing to watch."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Clearly showing the reality is rare nowadays. Extremely good and best songs. Must watch movie. Never thought that bollywood can make movies like this which shows real events in this much great details. Acting of Akshay Khanna is literally amazing. Loved it so much. Paisa vasul movie. Must watch once."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013134/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015122",
              "author": {
                "username": {
                  "text": "nikhilpratapsingh-33571"
                },
                "userId": "ur132519012"
              },
              "summary": {
                "originalText": "Awesome"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great. Mov movie reality shown tremendous work Aditya Bharat good work superb acting shown exactly what is real with Pakistan and India Great movie nice should all shoot Show real picture this agent love story movies in Bollywood should not be made all unwanted this is the true picture of this cinema India and Pakistan."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015122/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012793",
              "author": {
                "username": {
                  "text": "vcrj-13313"
                },
                "userId": "ur167201346"
              },
              "summary": {
                "originalText": "Mind-blowing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watched Dhurandhar today. What a blast! 🔥\nAkshaye Khanna&#39;s intensity, Ranveer Singh&#39;s madness and Aditya Dhar&#39;s direction together create pure cinematic electricity.<br/><br/>The world-building, action and storytelling are top-notch.<br/><br/>Can&#39;t wait for Part 2 dropping next year!<br/><br/>#Dhurandhar #DhurandharReview."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012793/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005510",
              "author": {
                "username": {
                  "text": "cpqhcnyd"
                },
                "userId": "ur131220354"
              },
              "summary": {
                "originalText": "Keeps you hooked"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar really pulls you in with its energy, emotion and action. Even though it runs a bit long, the story feels alive-driven by honest performances that keeps you invested. The music is beautifully done too; it blends into the scenes in a way that makes the emotions hit deeper and the intense moments feel even more powerful.<br/><br/>What stays with you is how much care seems to have gone into every part of the film. And the way it ends makes you genuinely look forward to Part 2, which clearly has so much more to offer.<br/><br/>A warm, engaging watch that leaves you connected to its world."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005510/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027004",
              "author": {
                "username": {
                  "text": "kumaratulit"
                },
                "userId": "ur150927243"
              },
              "summary": {
                "originalText": "Must watch movie in theatre only"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Itw just wow and this Movie gives goosebumps time to time, well directed based on trye incidents, real picsa and audio give goosebumps, qll actor acted well but akshay khanna acted marvelously with great expressions must watch movie. Director tried to recreat pakistan in india in which he succeeded and this movie shows life of a real spy without any propaganda and narrative of liberals and shown real picture of pakistan."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027004/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016063",
              "author": {
                "username": {
                  "text": "shristarzz"
                },
                "userId": "ur71336253"
              },
              "summary": {
                "originalText": "Loved the movie akshaye rocks"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every one has done amazing performance\nStellar caste hats off to Aditya dhar.<br/><br/>Sarah arjun looks so pretty and her performance is amazing as well\nRanveer as usual gave a dhamakedar performance..loved the whole movie\nU can never get bored throughout this long movie.<br/><br/>It&#39;s a must watch to everyone .<br/><br/>Thank you."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016063/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018526",
              "author": {
                "username": {
                  "text": "singhricha-44378"
                },
                "userId": "ur162639326"
              },
              "summary": {
                "originalText": "\"Dhurandhar: The Most Real, Raw, and Riveting Movie I've Seen in Years\" 🔥🔥🔥🔥🔥🔥🔥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I just walked out of Dhurandhar, and I swear my heart is STILL racing. This movie didn&#39;t just impress me - it hit me like a shockwave. From the opening shot itself, I knew I was watching something special. The action is so raw, real, and intensely detailed that I actually caught myself gripping the armrest. No cheap tricks, no gravity-defying nonsense - just pure, hard-hitting realism that makes all those old, over-the-top spy movies look like comedy sketches. 💥<br/><br/>The story is unbelievably tight. Every scene matters, every character has weight, and the twists... wow. I didn&#39;t want to blink because the film moves with such precision. This is storytelling done right - sharp, emotional, and completely absorbing. 🎯<br/><br/>And the music? Goosebumps. Actual goosebumps. The background score during the major action beats is so powerful that it feels like the film is pumping energy straight into your veins. 🎶⚡<br/><br/>Dhurandhar isn&#39;t just good - it&#39;s on another level altogether. Smart, brutal, emotional, and insanely realistic. I&#39;m telling you with full excitement:\nThis is a 10/10 MUST-WATCH. Go NOW. You&#39;ll thank me later. 🔥🙌"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018526/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014144",
              "author": {
                "username": {
                  "text": "Saketh-75"
                },
                "userId": "ur211595000"
              },
              "summary": {
                "originalText": "NEVER GOT TO KNOW HOW 3 HOURS WENT BY"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar&#39;s pacing is flawless-never once did I feel the 3+ hours drag. The gripping narrative, sharp editing, and immersive performances kept me hooked 🎬🔥⏳ Time flew by seamlessly, making it one of the most engaging cinematic experiences I&#39;ve had ⭐🙌. It was engaging from start to finish and truly worth watching."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014144/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013139",
              "author": {
                "username": {
                  "text": "DHRUVIS-30"
                },
                "userId": "ur211588539"
              },
              "summary": {
                "originalText": "What a epic movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Clearly one of the masterpiece. Legitimate the best one out ther tells you about alot of aspects of the inside world. &quot;Dhurandhar is a gripping, power-packed film that delivers on every front-story, performance, and emotion. The narrative holds you from start to finish, and the lead actors absolutely shine with intensity and depth. The direction is sharp, the music elevates every moment, and the dialogues hit hard. A truly standout movie that leaves a lasting impact."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013139/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012512",
              "author": {
                "username": {
                  "text": "VipulS-515"
                },
                "userId": "ur211584278"
              },
              "summary": {
                "originalText": "Amazing, Fantastic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every single actor did justice to their roles. One hell of a movie. Must watch. Akshay khanna- totally fire, Ranveer singh- superb. From trailer to the movie, you stay hooked. Actions- top notch. Haters will try to find negative moments but won&#39;t find any. You will only come out of this movie as a fan of it."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012512/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11070617",
              "author": {
                "username": {
                  "text": "shashidhandu"
                },
                "userId": "ur161979768"
              },
              "summary": {
                "originalText": "excellent, must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Must watch, once in life time movie. Great acting, great story, great songs and background music, story narrates real events with some fiction\nDhurandhar succeeds because it feels like an &quot;event.&quot; It balances the requirements of a big-screen spectacle with a tightly wound script that avoids the usual &quot;masala&quot; tropes. The 4-minute post-credit cliffhanger is the perfect masterstroke, leaving the audience in a state of feverish anticipation for Part 2. It isn&#39;t just a movie; it&#39;s a shift in how Indian action cinema is perceived globally."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11070617/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011888",
              "author": {
                "username": {
                  "text": "RaviC-705"
                },
                "userId": "ur211579031"
              },
              "summary": {
                "originalText": "Dhurandhar the Movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolutely amazing movie. All the actors did a wonderful job. Ranveer Singh is a rock star.<br/><br/>Although it was comparatively long movie, but dint feel it. It was fast paced and mesmerising.<br/><br/>The director has done a splendid job. All the actors have done justice to their characters. Even if it was a small role.<br/><br/>A must watch movie. I can watch it again. Jai Hind 🇮🇳"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011888/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026177",
              "author": {
                "username": {
                  "text": "NandiniY-32"
                },
                "userId": "ur211688553"
              },
              "summary": {
                "originalText": "My review"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Thank you so much Aditya sir for such a wonderful movie and the truth you shown raw and real and all the actors they did such a incredible job wonderful acting wonderful music wonderful directing and ranveer singh and Akshaye khanna such a brilliant acting and the emotion and the rage of 26/11 and all terror attack the pain shown by ranveer is beautiful waiting for part 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026177/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11039139",
              "author": {
                "username": {
                  "text": "Jod-Neo-922"
                },
                "userId": "ur206128788"
              },
              "summary": {
                "originalText": "Dhurandhar Review by a fan"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I&#39;m not someone with deep knowledge of cinema. I watched Dhurandhar purely as a fan, and the film genuinely impressed me. It has a strong intensity from start to finish and keeps you engaged without needing over-the-top moments. The performances felt real and serious, and the story demands attention. Even if you don&#39;t understand every layer, the overall experience still works. The mood, background music, and emotions stay with you after the movie ends."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11039139/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}