{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6jbbjtazcwzy476xx5nbzr3tm2cb72ikd367oaha7wtttfjrkydc3oezvjprpb4dxgdljvwgm22chsfm7gtabwq24m",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11010664",
              "author": {
                "username": {
                  "text": "ujjwalsinha-87184"
                },
                "userId": "ur142331100"
              },
              "summary": {
                "originalText": "Must watch in theatres otherwise you will regret it"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I am not a reviewer but I am writing this as I could not stop myself to not just say anything after watching this movie.... Such a great movie after such a long time in Bollywood... loved this Spy thriller definitely Aditya Dhar has out done himself this time...If you love watching movies this is the film that should be watched in the theatres trust me you will regretted if you don&#39;t watch this in big screen."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010664/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006764",
              "author": {
                "username": {
                  "text": "maheshkulkarnimk"
                },
                "userId": "ur190977537"
              },
              "summary": {
                "originalText": "Action That Surprises, Drama That Stays"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every scene feels meticulously designed, blending high-octane action with character-driven drama. Ranveer Singh&#39;s performance is extraordinary, embodying both vulnerability and unyielding determination. The director&#39;s vision ensures that the political and underworld dynamics feel authentic and immediate, while the pacing keeps audiences constantly engaged. Action sequences are crisp, innovative, and serve the narrative rather than mere spectacle. The supporting cast adds layers of intrigue and complexity, enhancing the story&#39;s believability. Cinematography captures both intimate and large-scale moments with equal skill, complemented by a score that heightens tension and emotion. The film&#39;s second half escalates stakes brilliantly, culminating in a climax that is both thrilling and deeply satisfying emotionally."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006764/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004866",
              "author": {
                "username": {
                  "text": "ravinavkumar"
                },
                "userId": "ur126523947"
              },
              "summary": {
                "originalText": "Awesome me combination of music, plot, story telling and Acting."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I honestly waited a long time for a movie like Dhurandhar, and I&#39;m genuinely glad this one lived up to every expectation and more. It has that perfect balance of phenomenal acting, a gripping plot, and storytelling that keeps you thinking even after walking out of the theatre. Not many films today dare to touch subjects this real and bold, especially when it comes to patriotism. This movie speaks openly about the country - without shame, without over-correction, and without pretending patriotism is something outdated or embarrassing. It says things many Indians have wanted to express but never felt comfortable saying out loud. Huge respect to Aditya Dhar for that brave attempt alone.<br/><br/>Ranveer Singh delivered a controlled and mature performance - impactful without unnecessary exaggeration and completely aligned with the tone of the film.<br/><br/>The supporting cast collectively deserves appreciation. Saumya Tandon was a standout - she brought a calm strength and believable emotional depth that made her character genuinely felt. Akshaye Khanna added sharp intensity and a mysterious edge that kept every scene with him captivating, while R. Madhavan contributed a grounded emotional layer that balanced the film&#39;s heavy themes. Together, they lifted the narrative beautifully and made the world of the film feel authentic.<br/><br/>Great music really connected with the plot - not just useless music added like other films<br/><br/>One of the most refreshing things was the music - finally a film where the score and tracks respect the story. No forced dance numbers, no random romance songs - just music that fit the moment, enhanced the impact, and supported the plot instead of distracting from it.<br/><br/>For me, Dhurandhar is a complete package - honest storytelling, committed performances, brave messaging, and music that adds value. This movie restored faith that Indian cinema can still create films with purpose, emotion, and pride. Salute to the team for delivering something bold, thoughtful, and truly memorable."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004866/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029661",
              "author": {
                "username": {
                  "text": "Aapkaashis"
                },
                "userId": "ur200969582"
              },
              "summary": {
                "originalText": "Dhurandhar - A treat to the audience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "9/10 - Dhurandhar is a gripping spy-action thriller with a long runtime that never feels boring, thanks to a strong screenplay and powerful performances. Director Aditya Dhar ensures every character leaves an impact-this isn&#39;t just a Ranveer Singh show.<br/><br/>Performances:<br/><br/>Akshay Khanna shines as Rehman Dakait with standout swag and dialogue delivery.<br/><br/>Sanjay Dutt elevates the film&#39;s pace with a strong late entry.<br/><br/>Ranveer Singh&#39;s character arc is engaging and sets high expectations for Part 2.<br/><br/>R. Madhavan and Arjun Rampal make their limited screen time count.<br/><br/>Sara Arjun delivers a decent performance.<br/><br/>Technical Aspects:<br/><br/>Direction by Aditya Dhar is impactful.<br/><br/>Sashwat Sachdev&#39;s music blends perfectly with the tone.<br/><br/>Smart use of old Bollywood songs adds thrill.<br/><br/>Vikash Nowlakha&#39;s cinematography and Shivkumar V Panicker&#39;s editing are sharp."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029661/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018611",
              "author": {
                "username": {
                  "text": "abhihbti-82963"
                },
                "userId": "ur62091420"
              },
              "summary": {
                "originalText": "High energy - must watch in theater"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is pure energy from the moment it starts. It looks great, feels great, and keeps you hooked right till the last frame. The cast absolutely owns their roles with natural, heartfelt performances. The direction is tight, the flow is smooth, and the visuals hit the right vibe every time. Even with its longer runtime, the film never drags-credit to its solid pacing and top-notch production. Simply put, Dhurandhar is a stylish, high-voltage entertainer with standout acting and music you&#39;ll remember."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018611/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024654",
              "author": {
                "username": {
                  "text": "NeelP-85"
                },
                "userId": "ur200173328"
              },
              "summary": {
                "originalText": "Unfiltered movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an excellent movie that keeps you engaged from beginning to end. The story is clear, powerful, and easy to connect with. The actors deliver very strong performances and the emotions feel natural and real. The direction is well handled, and every scene adds value to the film. The background music supports the mood nicely without overpowering the scenes. Overall, it is a well-made and enjoyable movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024654/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011075",
              "author": {
                "username": {
                  "text": "Ai-159"
                },
                "userId": "ur211572178"
              },
              "summary": {
                "originalText": "Truly relatable"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The event that happened in the past are very well documented and exact foutage is being used to make it more relatable. The sheer dedication of Akshaya Khanna is hats off...\nEach and every actor did there role with sheer dedication. Some of the villains make you feel angry but it is actually meant that way. The use of tactics and navigating from overall situation is next level. This is a long movie but not for a moment you feel bored in between.💯💯💯"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011075/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016411",
              "author": {
                "username": {
                  "text": "AnkitA-488"
                },
                "userId": "ur211610661"
              },
              "summary": {
                "originalText": "Seriously, Go See \"Dhurandhar\" You Won't Regret It!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Okay, guys, stop what you&#39;re doing and book tickets for Dhurandhar right now. I just saw it and I am completely obsessed it&#39;s an absolute blast! Honestly, I was hooked maybe five minutes into the opening sequence. If you&#39;ve been waiting for a Bollywood spy thriller that actually delivers on its promise of non-stop action and genuine suspense, this is it.<br/><br/>Ranveer Singh as the titular agent? He was powerful! I mean, we know he&#39;s a great actor, but he brought such a raw intensity to this role. You can literally feel the weight of the world on his shoulders it was mesmerizing to watch. And can we talk about the antagonist? Akshaye Khanna absolutely crushed it. He has this calm, menacing vibe that made their confrontation scenes so incredibly gripping. Their dynamic is the engine of the movie, and it is firing on all cylinders.<br/><br/>I have to give huge props to the director, Aditya Dhar. He kept the pacing tight, even though it&#39;s a long movie it flew by! The action choreography felt real and gritty, not just some over-the-top CGI fest. Plus, the background score is just fantastic; it really amps up the suspense. I loved how the film wasn&#39;t just about explosions; it grounded the story in genuine human emotion, paying tribute to the sacrifices of our heroes.<br/><br/>Frankly, this film is a masterclass in making a huge-budget action spectacle feel authentic. It&#39;s a genuine winner and easily one of the best theater experiences I&#39;ve had this year. Trust me on this one; you need to see this movie on the biggest screen possible!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016411/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011544",
              "author": {
                "username": {
                  "text": "raju-47894"
                },
                "userId": "ur67623527"
              },
              "summary": {
                "originalText": "Engaging, Musical, Dialogue heavy, Akshaye Aura Farming"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie&#39;s background music is soul of this movie, right music/song placed at right moment.<br/><br/>Each character is written well and it&#39;s interesting<br/><br/>Movie is Raw with violence, and doesn&#39;t shy away from showing the real footages as it is.<br/><br/>This movie belongs to Akshaye Khanna, he dominated through his performance.<br/><br/>Akshaye khanna, Arjun Rampal instill fear in you through their performance. You don&#39;t want Ranveer&#39;s character to get caught by them.<br/><br/>Movie is written well enough that , you forgot that they are your enemies, and you want Ranveer to be loyal to them.<br/><br/>But one control room sequence slaps you harder and reminds you why are you here.<br/><br/>You can&#39;t be close to these people, who kill their own for their benefits.<br/><br/>Movie leaves us with next part craving, and it&#39;s good that we don&#39;t have to wait for another year or two years for it to come.<br/><br/>Overall solid watch, and a testosterone booster!"
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011544/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014348",
              "author": {
                "username": {
                  "text": "arkadeepkashyap"
                },
                "userId": "ur82438683"
              },
              "summary": {
                "originalText": "Exceptional Direction and Casting"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Villains shine more than hero. This film portrays the real picture of Pakistan and showing us the reality of our own incompetence during 26/11.<br/><br/>Akshaye khanna overshadowed everyone, it&#39;s a treat to our eyes to watch such performance. Arjun Rampal as Major Iqbal makes us hate him for the negativity. Ranveer Singh has done a decent job.<br/><br/>A must watch for every Indian."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014348/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004328",
              "author": {
                "username": {
                  "text": "prabin_21045"
                },
                "userId": "ur117377909"
              },
              "summary": {
                "originalText": "Twists, Tension, and Total Immersion - A Thriller That Never Lets You Breathe"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar (2025) is a gripping spy thriller that keeps you on edge from start to finish. The lead delivers a magnetic performance, supported by a strong cast that adds depth and weight to the story. The plot is layered with clever twists and turns, creating an immersive world that feels real and compelling. Cinematography and music enhance the film&#39;s atmosphere, drawing the audience in despite its long runtime. Bold and stylish, Dhurandhar rewards patient viewers and leaves you eager for what comes next."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004328/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006664",
              "author": {
                "username": {
                  "text": "Mustafa-006"
                },
                "userId": "ur203877223"
              },
              "summary": {
                "originalText": "Heartbeats Race in This Action Saga"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Supporting roles are executed with finesse, each character contributing meaningfully to the story and reflecting the director&#39;s meticulous attention to casting and character development. The antagonists are particularly well-portrayed, providing a believable, multi-layered challenge to the protagonist."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006664/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018834",
              "author": {
                "username": {
                  "text": "Yurendra"
                },
                "userId": "ur211629654"
              },
              "summary": {
                "originalText": "Dhurandhar - A Truly Marvelous Cinematic Experience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar - A Truly Marvelous Cinematic Experience<br/><br/>Dhurandhar is a gripping, 10/10 spy thriller that feels inspired by true events and unfolds against the backdrop of gang wars and terror networks, yet never loses sight of its human core. The storyline has enough meat to keep you engaged throughout, the writing is brilliant, and every character is crafted with nuance and detail while the sincere, steadily building screenplay keeps growing on you with every passing scene."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018834/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11043923",
              "author": {
                "username": {
                  "text": "AvikB-85"
                },
                "userId": "ur211835297"
              },
              "summary": {
                "originalText": "Dhurandhar at its best..."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The latest spy thriller delivers a relentless surge of adrenaline from start to finish. Its expertly choreographed action sequences are both inventive and breathtaking, keeping audiences on the edge of their seats. The narrative unfolds with intricate twists and turns, masterfully building suspense and intrigue. Viewers will appreciate the sophisticated blend of espionage and high-stakes combat. This film is an absolute must-see for any fan of the genre, offering a truly exhilarating cinematic experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-21",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11043923/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009785",
              "author": {
                "username": {
                  "text": "saswatsml"
                },
                "userId": "ur132538620"
              },
              "summary": {
                "originalText": "Good espionage thriller after a long time"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Bollywood has failed to make good thriller movies for a very long time. Dhurandhar has crossed all the expectations and is a banger of a thriller. The direction, the storey build up, acting, music too notch. It&#39;s a 3.5 hrs long movie but won&#39;t let you move even an inch from your seats. The movie is fast moving and in no place you would feel is getting slow."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009785/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013798",
              "author": {
                "username": {
                  "text": "sumanthrsr"
                },
                "userId": "ur118637390"
              },
              "summary": {
                "originalText": "A perfect recipe of Spy film to mass audience"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Captures the ground reality along with real incidents of terrorism. No unnecessary songs/characters/scenes. Everything stiched perfectly from story to screenplay to casting. This movie sets a standard for other spy movies from bollywood, hope to see such movies prioritising reality over fantasy. A must watch, if you love spy movies."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013798/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11036266",
              "author": {
                "username": {
                  "text": "vijaynema-11398"
                },
                "userId": "ur120363687"
              },
              "summary": {
                "originalText": "Beyond Bollywood: Dhurandhar Redefines the Spy Genre"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of the best movies I&#39;ve watched in my lifetime. What a film! The story, screenplay, action, and characters are all outstanding. Every frame feels powerful and engaging.<br/><br/>Special mention to Akshaye Khanna and Ranveer Singh - their performances are simply brilliant and elevate the film to another level.<br/><br/>This movie is beyond Bollywood. The usual Salman-Shah Rukh spy movies don&#39;t come anywhere close to this level of intensity, realism, and storytelling. A true spy thriller done right.<br/><br/>A must-watch for anyone who loves serious cinema and high-quality filmmaking."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11036266/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025758",
              "author": {
                "username": {
                  "text": "JayC-870"
                },
                "userId": "ur211683185"
              },
              "summary": {
                "originalText": "Amazing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The best movie of the year, the acting was so good and everyone have played the role very incredibly especially akshay Khanna,ranveer singh,arjun rampal and sanjay dutt. The love angle was also on point and it was also on the exact moment which was needed to elevate the story.overall it was once in the lifetime film and so excited for the next part."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025758/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11062429",
              "author": {
                "username": {
                  "text": "bsahu-85955"
                },
                "userId": "ur131658096"
              },
              "summary": {
                "originalText": "10/10 Paisa Wasool"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It was an amazing experience.<br/><br/>I wish the movie had better CGI at times when they used it, though granted didn&#39;t used it that much obviously.<br/><br/>But I loved the story, the movie was actually really good at grounding everything, I didn&#39;t felt that much of hate against Pakistan even though I wanted it to be.<br/><br/>But I guess that&#39;s what the second part is going to be."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11062429/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016827",
              "author": {
                "username": {
                  "text": "JadejaY-2"
                },
                "userId": "ur211613851"
              },
              "summary": {
                "originalText": "Dhurandhar - A Bold, Gritty Return to Spy Thriller Grandeur"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ranveer Singh&#39;s much-awaited comeback with Dhurandhar is a high-stakes, high-velocity spy thriller - ambitious in scope, heavy on scale, and unafraid to tread dark, violent paths. Directed by Aditya Dhar, the film plunges audiences deep into the murky underworld of Karachi&#39;s mafia and the shadowy world of covert operations, borrowing from real-life events while weaving an intense fictional narrative.<br/><br/>One of the film&#39;s strengths is its ensemble cast. Alongside Ranveer Singh, actors like Akshaye Khanna, Sanjay Dutt, Arjun Rampal, R. Madhavan and Sara Arjun deliver solid performances that add weight and variety to the film&#39;s many layers. Critics and many viewers have particularly singled out Khanna&#39;s portrayal for offering a &quot;masterclass&quot; in villainy, while Ranveer plays a more subdued-but searing-spy whose moral compass and inner turmoil define much of the film&#39;s gravitas.<br/><br/>Visually and atmospherically, Dhurandhar excels. The film&#39;s world-building - its depiction of Karachi&#39;s underbelly, the cramped rooms, the smoky dens, the sense of paranoia and danger - feels immersive and convincing. The background score and sound design add to the tension and mood, often turning confrontations into thunderous cinematic moments.<br/><br/>But the film is not without flaws. Its runtime - around 3.5 hours - demands patience. The narrative occasionally falters: some sequences feel overly long, pacing dips in the second half, and certain violent or dramatic scenes verge on excess or rely on cinematic clichés that may strike some as heavy-handed or even jarring. Also, a few production limitations (notably in visual effects) and a sometimes predictable storyline keep it from being a flawless triumph.<br/><br/>Overall, Dhurandhar is a bold, often thrilling, occasionally exhausting cinematic ride - not just a movie, but a statement of scale. It&#39;s a film that asks a lot from its audience, yet gives back in tension, performances, and uncompromising ambition. For fans of gritty espionage thrillers and hard-hitting drama, it&#39;s a must-watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016827/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013827",
              "author": {
                "username": {
                  "text": "prattbetta"
                },
                "userId": "ur45911831"
              },
              "summary": {
                "originalText": "Uninformed & Innocent Indians Must Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every uninformed, misinformed, and comfortably ignorant Indian who outsourced their thinking to TV news anchors must watch Durandhar. This film rips open the lies, compromises, and manufactured narratives that kept our nation deliberately weakened for decades. It is not entertainment-it is an awakening. If this unsettles you, it was meant to. Satyameva Jayate 🇮🇳🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013827/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023724",
              "author": {
                "username": {
                  "text": "snehilkumar-88193"
                },
                "userId": "ur80219301"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Turned out an entertaining watch even though I entered without any expectations. In Theatre experience, back ground music, storytelling via chapters were some elements that made this movie quite entertaining along with solid performance from some veteran actors :D<br/><br/>It&#39;s no Gangs of Wasseypur, but close comes to satisfy that itch. If you like long epics, certainly recommended.<br/><br/>It is an 8.5/10 for me - reducing points for few romantic cheesiness that was not instrumental to plot, mild-propaganda(but keep an open mind as same goes for Hollywood war/spy movies too), and Ranveer physique being too heroic for a spy :)<br/><br/>Can&#39;t wait for next part!!!"
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023724/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011400",
              "author": {
                "username": {
                  "text": "Tram-96"
                },
                "userId": "ur211574568"
              },
              "summary": {
                "originalText": "What an amazing movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Greatest movie I saw this year. And based on real story? Real footages? Real conversations and a true backstory to back it all up? Amazing view. One of the few Indian movies I have seen after A Wednesday, 3 Idiots, URI, article 15 and now this. Good future ahead from Indian movies can&#39;t wait to see more."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011400/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022953",
              "author": {
                "username": {
                  "text": "Rehman786"
                },
                "userId": "ur120266932"
              },
              "summary": {
                "originalText": "A must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After long time I have watched a movie that gave me all kind of entertainment and did not even noticed how 3.5 hrs passed away enjoying a master piece. Script cinematography action presentation all top notch.<br/><br/>Mostly a void movies when bollywood try to sell it by saying true story. But, this is really something we all indians should know how our brave soldiers work and what they do for the nation that never even discussed anywhere."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022953/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012985",
              "author": {
                "username": {
                  "text": "kumarpriyajit"
                },
                "userId": "ur88765768"
              },
              "summary": {
                "originalText": "Absolute mayhem!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Never before have I sat through an entire Bollywood movie in one stretch without getting a little bit bored or checking my phone. This movie builds each character so intricately, and gives very subtle yet deep dive into their psyche. It is obvious why &quot;certain people&quot; get offended by this movie and are recommending everyone not to watch it. It shows everything raw and unfiltered. The scene with red screen and actual audio recordings - this is when everyone was silent. Not a single popcorn crunching sound, not a single slurping of last few drops of coke. Go watch this movie if you haven&#39;t - the action sequences with background music fits so well, the acting of Akshaye and Ranveer is just out of this world. And the raw portrayal of the story - no &quot;Aman ki Asha&quot; crap and item songs with enemy intelligence agency. Raw and Powerful! 10/10<br/><br/>Note to Aditya Dhar ji - Actress was too young for Ranveer (the story is about a 19yo girl, but you can cast someone older to play the role if they look young). Romance between them was a bit uncomfortable to watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012985/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}