{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4u6termtizcsyik7gthxmjrrttmybr63untt6xqcwb32u3anas2wds2oyrtbzdrztr2csybg4jfrvw3fzkcd6a",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11006160",
              "author": {
                "username": {
                  "text": "nitishsahsah"
                },
                "userId": "ur150743260"
              },
              "summary": {
                "originalText": "Worth watching"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s been a long time since Bollywood pulled together a cast this big and truly made it count. Great chemistry, sharp pacing and strong performances kept me hooked. I&#39;m still replaying scenes in my head. A film that&#39;s absolutely worth your time and deserves all the praise coming its way and definitely a movie I&#39;d recommend without hesitation."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 24,
                "downVotes": 7
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006160/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006327",
              "author": {
                "username": {
                  "text": "satyajeetdash-60955"
                },
                "userId": "ur143268882"
              },
              "summary": {
                "originalText": "Best Spy movei of 2025 since after baby"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best movie to watch i have watched this in theatre for 2 times still want to watch this again....not a single moment you feel bore in this movie the songs, the cinematography is so goated that I feel so amazed to see.you need to watch the movie in theatres for the best sound effect and the use of music in movie was so nice."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 28,
                "downVotes": 9
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006327/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005988",
              "author": {
                "username": {
                  "text": "harshzaveriz"
                },
                "userId": "ur116901601"
              },
              "summary": {
                "originalText": "Constant thrill for 3+ hr, intricately detailed in all aspects"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A once in a decade spy thriller, and coming from the director of Uri, the movie is such an upgrade on revealing Pakistan&#39;s reality, the other spy-universes don&#39;t even come close to the unabashed portrayal of reality and the constant sense of danger our Indian spies must be going through each moment behind the enemy lines.<br/><br/>More than a one-time watch as I am sure one could pick out more details in subsequent viewings and connect them with the real life characters the movie alludes to."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 29,
                "downVotes": 10
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005988/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012897",
              "author": {
                "username": {
                  "text": "manishagarwal-67679"
                },
                "userId": "ur99857933"
              },
              "summary": {
                "originalText": "Best"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best movies till date. Dhurandhar is one of those rare films that pulls you straight into its world from the very first frame. It is intense, gripping, emotional, and crafted on a massive scale. What stands out most is the powerhouse performance by Ranveer Singh, who disappears completely into the character. His raw intensity, vulnerability, and unpredictable energy make the film unforgettable."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 16,
                "downVotes": 4
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012897/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006000",
              "author": {
                "username": {
                  "text": "abhisheksingh-72561"
                },
                "userId": "ur97481075"
              },
              "summary": {
                "originalText": "GAME CHANGER!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar&#39;s Dhurandhar is a long, intense, and ambitious film that has earned strong but divided reactions from both critics and audiences.<br/><br/>A Gritty, Geopolitical Thriller<br/><br/>Set against the backdrop of real historical events like the 1999 hijacking and the 2001 Parliament attack, the story follows a RAW agent who goes deep undercover into Karachi&#39;s Lyari underworld to dismantle a gangster-ISI terror nexus. The film is structured into distinct chapters and builds a gritty, complex world of espionage and geopolitical maneuvering.<br/><br/>The Major Strengths<br/><br/>路 Powerhouse Performances: The cast is consistently praised as a major highlight. Ranveer Singh delivers a controlled, intense performance, often described as career-best. Akshaye Khanna is frequently called the scene-stealer, bringing a chilling, charismatic menace to his role.<br/><br/>路 Technical Craftsmanship: The film is noted for its high production values, visceral action choreography, and a pulsating background score that significantly elevates the tension.<br/><br/>路 Immersive World-Building: Director Aditya Dhar is commended for creating a detailed, believable, and ruthless world of Karachi&#39;s underworld and intelligence operations.<br/><br/>Key Points of Criticism<br/><br/>路 Demanding Runtime: This is the film&#39;s most debated aspect. With a runtime between 212 to 214 minutes (over 3.5 hours), many reviews note that the narrative feels overstretched, particularly in the first half.<br/><br/>路 Uneven Pacing: The slow-burn, deliberate pace of the first hour, dedicated to character and plot setup, tests the patience of some viewers expecting a faster thriller.<br/><br/>路 Contested Romantic Subplot: The romantic track between Ranveer Singh&#39;s character and the politician&#39;s daughter (played by Sara Arjun) is seen by some critics as an underwritten element that could have been trimmed.<br/><br/>Final Verdict &amp; Audience<br/><br/>Dhurandhar is not a light, breezy watch. It is a dense, serious-minded spy saga that requires and rewards patience. Most reviews conclude that if you can commit to its epic length and appreciate grounded, performance-driven geopolitical thrillers, it offers a compelling big-screen experience.<br/><br/>However, if you prefer fast-paced, straightforward action or have limited tolerance for very long films, you might find it challenging. The film also ends with a clear setup for a sequel.<br/><br/>I hope this non-spoiler review helps you decide. Are you generally a fan of long-form, detailed storytelling in films, or do you tend to prefer tighter narratives? Knowing this could help me provide more tailored insights."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 20,
                "downVotes": 6
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006000/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006070",
              "author": {
                "username": {
                  "text": "jangidkartikeya"
                },
                "userId": "ur133212899"
              },
              "summary": {
                "originalText": "Best indian spy movie with the flavour of gangster drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar movie is proudly nationalist spy movie shows reality of terrorist &amp; isi &amp; 0.5 front &amp; focusing on real face of them not showing lies like raazi &amp; isi universe. Dhurandhar is extremely well made movie, which gives the entertainment of different genre like spy, action, gangster drama, thriller etc. Watching Dhurandhar is like watching a spy novel on screen chapterwise which excites us more &amp; more, each chapter has its sub story which leads to final chapter story which provides this movie uniqueness &amp; excites viewers with each chapter. Movie Direction, Art Direction, Editing, &amp; Acting of each actor is superb. This movie music is top notch, every song either old, remix, &amp; original elevate the characters, action sequences, &amp; story. It really shows true face of isi &amp; pakistan &amp; their thoughts on indians not like some isi universe. I really like this movie as an indian &amp; as an movie buff. Hats off to aditya dhar to finally giving us nationalist, traditional, &amp; extremely well made spy movie to all Indians. Jai Hind!!仇仇"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 26,
                "downVotes": 9
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006070/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010288",
              "author": {
                "username": {
                  "text": "rajyashjainbm"
                },
                "userId": "ur98406880"
              },
              "summary": {
                "originalText": "Brilliant Movie - Must Watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar honestly shocked me in the best way possible. It&#39;s been a long time since a Hindi movie pulled me in this deep. The film is raw, intense and hits you straight in the gut. The scale is massive, the performances are crazy good (Ranveer and Akshaye Khanna absolutely killed it), and the whole world-building is so real that for a moment you feel like you&#39;re actually standing right inside the chaos.<br/><br/>What I loved the most is that the movie doesn&#39;t shy away from showing the dark truth behind terrorism, politics and how our soldiers and officers actually risk everything. Some scenes are brutal, yes, but they are meant to be brutal. That&#39;s the point - it&#39;s not fake heroism, it&#39;s the real cost of violence.<br/><br/>The cinematography, background score, the long but gripping storyline - everything comes together like a proper cinematic experience we rarely get nowadays. This is not a &quot;timepass movie,&quot; this is one of those films that stays in your head hours after you walk out of the theatre.<br/><br/>India honestly needs more movies like this - fearless, strong and unfiltered. Dhurandhar isn&#39;t perfect, but it is powerful. And in today&#39;s times, that&#39;s more important.<br/><br/>Highly recommended."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 13,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010288/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006331",
              "author": {
                "username": {
                  "text": "PromitD-7"
                },
                "userId": "ur208211662"
              },
              "summary": {
                "originalText": "Top notch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Indian Intel spy film never been that thrilling and so near to the actual incidents. Kudos to the script writer, director. Even the Villains are mind-blowing. Akshay Khanna&#39;s screen presence is on another level. Every chapter is intense and never feels bored despite a 3.5 hr runtime. One request, don&#39;t ruin this in season 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 19,
                "downVotes": 6
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006331/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007664",
              "author": {
                "username": {
                  "text": "soubhikpoddar"
                },
                "userId": "ur160923113"
              },
              "summary": {
                "originalText": "nice"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar 3.5猸\npositive:\n1. Gripping story with a fine worldbuilding\n2. All dhurandhar cast shines specially Akshay khanna,arjun rampal,sanjay dutt and R madhvan sir\n3.5 perfect use of A rated certificate\nthe voilence is bloody heaven\nnegative:\n1. The romantic angle can&#39;t stands out\n0.5 movie takes time but its important for the worldbuilding\ncaution:\ndon&#39;t expect heavy action its just like a political drama between gangstars with some actions."
                }
              },
              "authorRating": 7,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 5
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007664/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11046102",
              "author": {
                "username": {
                  "text": "AtimaN-5"
                },
                "userId": "ur211852400"
              },
              "summary": {
                "originalText": "Cringefest at best!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The rule of thumb, never, to never go with high expectations! Let down is harder. For all its grandilosque statements, gut wrenching action, torture scenes bordering on savagery, the uniqueness of the plot (?)\nAn impressive cast is not enough.<br/><br/>After a while, the characters were interchangeable. The mannerisms, abuses, dangling cigarettes ( lol), the sneers, were visible. For many Shades and face fuzz acted as a cloak for histrionics!<br/><br/>The vote swayed between bulging biceps, swaying locks, sneery snarl, filthy mouths, beastly mannerisms!<br/><br/>The person who stood out is Rakesh Bedi. He stole the show with his performance. A small but much needed human, comic relief came from him. As for the deeper insight into the politics of the two nations. It is lost in all the unnecessary violence. On a serious note, topics of national security, real threats to our country, need for more, more &amp; much, much more were touched upon in graphic details. How can an average cinegoer, out for entertainment, munching on warm popcorn in the dark help in matters our government fails at is baffling? A documentary would have sufficed. They are planning a sequel; beware!"
                }
              },
              "authorRating": 5,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 6,
                "downVotes": 14
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11046102/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11088945",
              "author": {
                "username": {
                  "text": "RaghavendraB-78"
                },
                "userId": "ur212146723"
              },
              "summary": {
                "originalText": "All indians must watch this movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is superb akshay khanna acting is superb he is totally in the character the movie shows how india made somany security steps to track terror activities the story line is superb ranveer singh acting is excellent it&#39;s must watch movie to all indians and we should feel proud how our country has taken steps to kill these terror activities."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-02",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11088945/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011644",
              "author": {
                "username": {
                  "text": "R4j33-D"
                },
                "userId": "ur211576640"
              },
              "summary": {
                "originalText": "Marvelous - Dhurandhar in every sense"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "All Indian spy movies that have been made in recent times are useless and far from reality - with RAW-ISI agent romancing each other and what not, so my hope were were not very high.<br/><br/>Simply put - I was not aware of movie&#39;s length when I went to see it a local Vue cinema yesterday i.e. On 7th Dec. Show start time was 19:55, but the film actually started at about 20:20, intermission came and went and when film was finished I asked my wife for time and she said 23:55 - phew... I can&#39;t recalled going to to a 3+ hour film which got me so hooked that I forgot about time have passed by - tells you all about the story and screenplay.<br/><br/>A must watch!! Can&#39;t stress much - this being my first every movie review and might be the only one for long time."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 8,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011644/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11001528",
              "author": {
                "username": {
                  "text": "anshulyadav-30934"
                },
                "userId": "ur98329538"
              },
              "summary": {
                "originalText": "Star Studded Piece of Art"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "In a world of stylized and glamourised spy thrillers, specially in bollywood with all the big dance numbers and objectification of female stars. This movie by Aditya Dhar presents a Raw and power packed action spy thriller with absolutely well performed by brilliant actors Ranveer, Akshay Khanna, Arjun Rampal and Sanju Baba. But, the one actor that takes the crown of acting is our underrated superstar Akshay Khanna as Rahman Dakait. His silence in between scenes speaks so much that dialogues couldn&#39;t. It&#39;s a pure cinematics experience with the production quality top notch and music and background score taking scenes to a tier above. Shashwat Sachdeva&#39;s music has added the calm and charm to the movie. It&#39;s a long movie but it builds the characters so well that you are hooked to it. Can&#39;t wait for part 2 releasing in March 2026. It&#39;s an absolute must watch cinema experience. So definitely go and enjoy folks!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-05",
              "helpfulness": {
                "upVotes": 12,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11001528/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010195",
              "author": {
                "username": {
                  "text": "erasharma-65541"
                },
                "userId": "ur98313066"
              },
              "summary": {
                "originalText": "Blockbuster Alert. \"Don't miss this one.\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watch Dhruandhar and I must say After many years a film truly kept me engrossed for the entire 3 hours and 34 minutes. Totally worth watching.<br/><br/>The direction by Aditya Dhar is commendable and the performance by actors is truly remarkable, especially Akshay Khanna-He absolutely nailed it.<br/><br/>The music is so so good that it perfectly compliments the film and enhances the overall experience.<br/><br/>This movie is definitely not for kids, but for everyone else - it&#39;s a complete theatre experience. Please don&#39;t wait for OTT release.<br/><br/>After a long time, I walked out of the cinema genuinely satisfied."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 12,
                "downVotes": 3
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010195/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006388",
              "author": {
                "username": {
                  "text": "kritika13"
                },
                "userId": "ur188286723"
              },
              "summary": {
                "originalText": "Emotion, Intensity, and All-Out Entertainment"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tension is woven into every scene, making the narrative impossible to predict yet always believable. The protagonist commands the screen with a magnetic intensity, fully embodying the moral dilemmas and physical demands of the story. The action sequences are intricate and thrilling, blending martial skill with cinematic artistry that keeps viewers on edge. Dialogue is sharp and meaningful, never filler, reflecting complex motivations and alliances. The cinematography skillfully juxtaposes violence with moments of introspection, while the soundscape accentuates every heartbeat of suspense. The plot&#39;s political intrigue is intricately layered, adding stakes beyond mere survival. Secondary characters are compelling, providing texture and realism to the story&#39;s dangerous world. Every element, from choreography to set design, is purpose-driven, culminating in a finale that is as emotionally charged as it is viscerally exciting."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 18,
                "downVotes": 7
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006388/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007021",
              "author": {
                "username": {
                  "text": "sagarlaad"
                },
                "userId": "ur118088501"
              },
              "summary": {
                "originalText": "Big Screen Action with Powerful Acting"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative unfolds with patient intensity, drawing viewers into a high-stakes world of politics and crime. Ranveer Singh&#39;s performance is layered and compelling, capturing internal conflict and determination, while Sanjay Dutt commands attention with his presence. Akshaye Khanna and R Madhavan deliver strong supporting roles, adding dimension to the story. Arjun Rampal and Sara Arjun bring additional emotional depth, making the consequences feel urgent. Aditya Dhar orchestrates a perfect balance of action, strategy, and character development. Cinematography captures both chaos and quiet reflection, while the score enhances every tense and emotional beat, making the viewing experience immersive and gripping."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 33,
                "downVotes": 17
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007021/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004758",
              "author": {
                "username": {
                  "text": "Pranavs-491"
                },
                "userId": "ur211535303"
              },
              "summary": {
                "originalText": "Landmark film in Indian Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Easily the best espionage thriller film to have come out of our country\nMarkers have tried to keep it extremely close to reality\nThe action is gruesome .<br/><br/>Despite of the fact that the film is 3hr 34 mins long the film is pretty nicely paced no sequence feels dragged maybe barring the love angle between Ranveer and Sara.<br/><br/>The acting is incredible .<br/><br/>Makers have voluntarily decided to not give the actors a pakistani accent which wasn&#39;t a huge problem for me.<br/><br/>The way that the Pakistani underworld is shown is incredible .<br/><br/>And Also the way some real footages have been included in the film will send chills down your spine .<br/><br/>The length could&#39;ve been shorter but still a great watch."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 21,
                "downVotes": 9
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004758/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004016",
              "author": {
                "username": {
                  "text": "Afrin-82"
                },
                "userId": "ur211530664"
              },
              "summary": {
                "originalText": "Must watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie time was too long... Other than that movie was awesome... Every character was awesome.. Songs could be better...ending also could have been better... But hope next part will be good with lots of thrills and much more. Ranveer singh justified his role. Guys it&#39;s a good movie... Go watch it....."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 27,
                "downVotes": 13
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004016/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11035731",
              "author": {
                "username": {
                  "text": "adventurehed"
                },
                "userId": "ur135547496"
              },
              "summary": {
                "originalText": "Good movie but nothing like everyone's raving about"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Went to watch the movie reading and listening and reviews everyone&#39;s talking about ( Bollywood starts, critics) and saying it&#39;s a new standard in Indian cinema\nIs not that, I&#39;m not sure what the motivation behind it. There are much better movies made in India who no one don&#39;t talks about.<br/><br/>Good movie otherwise but not what I was expecting."
                }
              },
              "authorRating": 6,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 5,
                "downVotes": 6
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11035731/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026049",
              "author": {
                "username": {
                  "text": "HasanQ-71"
                },
                "userId": "ur211686651"
              },
              "summary": {
                "originalText": "Nothing really made sense"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar mistakes length, noise, and seriousness for intelligence. What it actually delivers is a convoluted spy drama that collapses the moment you stop admiring the background score and ask the most basic question: what was the mission?<br/><br/>The film opens with a hijacking by Jaish, after which Indian intelligence decides the best response is to send a criminal-turned-agent to Karachi to infiltrate a Lyari gang that has nothing to do with Jaish, terrorism, or the hijacking. Why Karachi? Why Lyari? Why this gang? The movie never bothers to explain.<br/><br/>From here, the agent inexplicably helps Rehman Dakait rise in the underworld. This rise then attracts two conveniently placed intermediaries who introduce Rehman to the ISI chief, a chain of events so dependent on blind luck that it accidentally turns espionage into a lottery. Neither the agent, Rehman, nor R&amp;AW plans this. It just... happens. Twice.<br/><br/>Ironically, terrorism only escalates because of the agent&#39;s involvement. Rehman starts supplying weapons to the ISI after the agent embeds himself in the gang. If the goal was to prevent attacks on India, the mission is not just a failure it is actively counterproductive.<br/><br/>At one point, the agent declares his ambition to become the &quot;King of Karachi,&quot; a line that sounds dramatic but leads absolutely nowhere. He neither becomes king, nor dismantles any terror network, nor prevents any attack. Instead, the plot gets distracted by a half-baked romance and ends with the agent assassinating the very man he helped empower.<br/><br/>The film then abruptly ends, as if it suddenly remembered it had been running for over three hours and needed to stop.<br/><br/>Dhurandhar wants to be gritty, intelligent, and epic. It is actually a bloated, poorly thought-out narrative where cause and effect don&#39;t exist, stakes are retroactively invented, and the protagonist&#39;s mission remains unclear even in the final act.<br/><br/>This isn&#39;t slow-burn storytelling.<br/><br/>This isn&#39;t complex espionage.<br/><br/>This is just noise masquerading as depth.<br/><br/>If you remove the performances, the score, and the scale, you&#39;re left with a spy thriller where the spy shouldn&#39;t have been sent in the first place and where the story only works if you don&#39;t think about it at all."
                }
              },
              "authorRating": 3,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 6,
                "downVotes": 14
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026049/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006403",
              "author": {
                "username": {
                  "text": "sabanraj"
                },
                "userId": "ur173817302"
              },
              "summary": {
                "originalText": "Where Drama Meets Explosive Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Intense sequences are paired with quieter, reflective moments, giving the story depth and texture. The performances are immersive, with actors fully committing to their roles. The action is carefully constructed, realistic, and suspenseful. The director&#39;s handling of complex storylines is masterful, weaving together political intrigue, personal conflict, and adrenaline-fueled set pieces seamlessly."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 28,
                "downVotes": 14
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006403/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007028",
              "author": {
                "username": {
                  "text": "kanuraj-41830"
                },
                "userId": "ur118089047"
              },
              "summary": {
                "originalText": "Action-Packed Scenes with Emotional Depth"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film excels in blending intense action with layered storytelling. Ranveer Singh carries the film with a dynamic performance, while Sanjay Dutt brings authority and menace. Akshaye Khanna and R Madhavan add depth and intelligence to the ensemble, and Arjun Rampal&#39;s quiet intimidation contrasts beautifully with Sara Arjun&#39;s poignant innocence. Director Aditya Dhar&#39;s control over pacing, tension, and character arcs ensures that every sequence feels vital. Cinematography captures both the chaos of the city and intimate human moments, while the music and editing enhance the immersive experience. By the climax, the narrative&#39;s suspense and emotional resonance reach a powerful peak."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 28,
                "downVotes": 14
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007028/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007005",
              "author": {
                "username": {
                  "text": "jaiswalshubham-55118"
                },
                "userId": "ur118089476"
              },
              "summary": {
                "originalText": "Full-On Action with Heartfelt Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the first frame, the film establishes a tense, almost hypnotic rhythm that only intensifies as the story unfolds. Ranveer Singh&#39;s nuanced portrayal anchors the narrative, making his character&#39;s internal dilemmas deeply relatable. The director demonstrates remarkable control over tone, weaving high-octane action with quieter, character-driven scenes. Supporting actors enhance the film&#39;s emotional resonance, bringing authenticity to every interaction. Visuals are striking, with every frame composed to heighten drama and tension, while the score complements the narrative without overpowering it. The film&#39;s layered plot, interweaving crime, politics, and human ambition, keeps the audience engaged throughout. By the finale, the story&#39;s full scope and consequences hit hard, leaving a lasting impression of intensity and sophistication rarely seen in mainstream cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 25,
                "downVotes": 12
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007005/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006565",
              "author": {
                "username": {
                  "text": "ohghut"
                },
                "userId": "ur166746581"
              },
              "summary": {
                "originalText": "A Star-Driven Ride of Pure Thrill"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From quiet, tension-filled moments to explosive action, the film is a masterclass in cinematic storytelling. Ranveer Singh&#39;s portrayal is compelling, conveying the internal and external conflicts of a man navigating a dangerous world. Director Dhar&#39;s vision is precise, blending suspense, action, and character-driven drama seamlessly. The supporting cast brings authenticity to the narrative, while the cinematography captures every nuance of mood and environment. The background score intensifies emotions subtly, allowing audiences to feel the stakes without distraction. Each scene contributes meaningfully to an unforgettable cinematic journey."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 20,
                "downVotes": 9
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006565/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006316",
              "author": {
                "username": {
                  "text": "rsbhoslekdham"
                },
                "userId": "ur112362253"
              },
              "summary": {
                "originalText": "A Classic Spy thriller!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best movie of 2025. No doubt. Even though some parts feel lengthy, the quality of the film totally overshadows it. Totally worth it.<br/><br/>And most importantly this movie is made for big screen only, don&#39;t wait for it to arrive on Netflix or so. The amount of action shown is made for big screen experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 21,
                "downVotes": 10
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006316/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}