{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xojbbltazcwzy47wxx3ojsrtu4oaj62imt76pnaxcomqbdf4skydk2o42f5mjyoa7dk7rslet2n2rzfb6f7ofrmkdq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11006921",
              "author": {
                "username": {
                  "text": "bhfjgpft"
                },
                "userId": "ur177078911"
              },
              "summary": {
                "originalText": "When Passion Meets Power on the Big Screen"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From its very first frame, Dhurandhar establishes itself as a high-caliber film that combines extraordinary acting with visionary direction. The lead actor delivers a tour-de-force performance, embodying the complexities of a man navigating political intrigue and personal conflict. The supporting cast is equally compelling, breathing life into every subplot and providing emotional resonance. The director&#39;s craft shines in the film&#39;s narrative structure, blending intense action, political tension, and human emotion with seamless precision. Real-life events and subtle humor are woven into the story organically, enhancing both authenticity and engagement. Cinematography, editing, and background score elevate the cinematic experience further, creating suspense, thrill, and emotional depth. Dhurandhar is a rare film where direction and performance come together flawlessly, leaving a lasting impact on audiences."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006921/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015763",
              "author": {
                "username": {
                  "text": "manishadhar"
                },
                "userId": "ur108837293"
              },
              "summary": {
                "originalText": "A Cinematic Masterpiece - Dhurandhar Shines Bright"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is nothing short of a triumph. It&#39;s bold, gripping, and beautifully realized. From the very first frame, the film grips you with its powerful storytelling and refuses to let go. Aditya Dhar proves once again that he is in a league of his own; his direction is nothing short of extraordinary, blending intensity, emotion, and scale with flawless precision.<br/><br/>The cast delivers performances that elevate the film to another level. Akshay Khanna is brilliant and magnetic, bringing nuance and depth to every scene he appears in. Ranveer Singh is electric as always, delivering an energetic and emotionally rich performance.<br/><br/>The script and storytelling are exceptionally tight, engaging, and layered, keeping you invested throughout. The background score deserves special mention; it intensifies the emotional beats and elevates every action sequence, making the film feel grand and immersive.<br/><br/>Dhurandhar is a rare blend of stellar acting, masterful direction, and brilliant writing. An absolute must-watch for anyone who loves impactful cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015763/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013634",
              "author": {
                "username": {
                  "text": "jketankumar83"
                },
                "userId": "ur35923193"
              },
              "summary": {
                "originalText": "A Masterclass from Aditya Dhar - Gripping, Powerful, and Shockingly Real"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A Masterclass from Aditya Dhar - Gripping, Powerful, and Shockingly Real<br/><br/>Aditya Dhar delivers an absolute knockout. This isn&#39;t just another action-packed thriller-it&#39;s a razor-sharp political spy drama crafted with astonishing technical finesse. The moment it starts, you realize you&#39;re watching something rare. Even though it&#39;s labeled &quot;inspired by real events,&quot; it feels uncannily real, almost like the filmmakers lifted an actual classified operation and put it on screen.<br/><br/>The casting is flawless by Mukesh Chhabra.<br/><br/>Rakesh Bedi, Sanjay Dutt, Akshaye Khanna, Sara Arjun and Many more are in blazing form-commanding, intense, unforgettable. And Ranveer Singh reminds us yet again why he&#39;s one of the most powerful actors of this generation. Every scene he&#39;s in hits with impact.<br/><br/>The music and background score by Shaswat Sachdev is a beautiful surprise. The use of timeless melodies and perfectly timed songs elevates the emotion without ever slowing the pacing.<br/><br/>Special applause for the editing team. Cutting a long, story-heavy film into something this engaging is a triumph. The interval placement-subtle, without a forced &quot;shock moment&quot;-is exactly how mature filmmaking should be done.<br/><br/>Yes, the film leans into strong contemporary political ideologies, and the story isn&#39;t fully complete yet. But honestly? It&#39;s still one of the most gripping, well-made spy dramas to come out of Indian cinema in years. A must-watch. 10/10."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013634/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010554",
              "author": {
                "username": {
                  "text": "meetngandhi"
                },
                "userId": "ur62593220"
              },
              "summary": {
                "originalText": "Movie presentation at its peak"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar delivers hard-hitting truth with sharp dialogues, powerful acting, and gripping presentation. The red-screen realism adds raw brutality, making the film unforgettable and brutally honest from start to finish. A bold, unfiltered cinematic punch that stays with you. Do watch it its rare to see this in bollywood."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010554/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024175",
              "author": {
                "username": {
                  "text": "ShivamS-4670"
                },
                "userId": "ur211672841"
              },
              "summary": {
                "originalText": "Super hit"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Anti-nation people are saying bad for thiss movie because this movie show the truth of cheap pakistan\nThat&#39;s why some people are offended 🤣\nBtw the movie is super duper hit\nHatsoff to makers\n#Dhurandhar\n#india\n#ranveersingh\n#akshaykhanna\n#saraarjun\n#sanjaydutt\nVery very brilliant movie\nI am waiting for dhurandhar 2."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024175/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014598",
              "author": {
                "username": {
                  "text": "MANISHG-372"
                },
                "userId": "ur211599384"
              },
              "summary": {
                "originalText": "Masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie was fantastic. Avoid the love angle story shows real face of Pakistan and politics between .<br/><br/>Acting top notch\nStory telling top notch\nDirection class\nAnd no aman ki asha in the movie (jo sach hai woh hai)<br/><br/>This movie is not just a entertainer its teaches that what Pakistan in reality is and what they do."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014598/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007626",
              "author": {
                "username": {
                  "text": "imdbfan-7663223182"
                },
                "userId": "ur199250978"
              },
              "summary": {
                "originalText": "Heartfelt Drama, Edge-of-Seat Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The storytelling in this movie is both meticulous and compelling, keeping the audience invested from the first scene. Ranveer Singh&#39;s portrayal is layered and compelling, offering glimpses of vulnerability amid the chaos of his violent world. Supporting actors enhance the narrative with performances that feel authentic and lived-in. The director ensures that action sequences are both visually spectacular and narratively meaningful, never overshadowing the plot or character development. Cinematography captures the duality of tension and beauty, and the carefully curated background score amplifies the emotional resonance, making the film a truly unforgettable cinematic journey."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007626/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11060282",
              "author": {
                "username": {
                  "text": "SudipR-156"
                },
                "userId": "ur211331811"
              },
              "summary": {
                "originalText": "Monumental, Path Breaking and Historic"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is filmmaking of the highest order-undoubtedly one of the greatest spy/espionage films ever made in India. It&#39;s gripping, intense, and powered by real-life timelines that add an extra layer of authenticity to the screenplay. The performances are outstanding, the background score is electrifying, and the songs blend seamlessly into the narrative. But above all, it&#39;s the world crafted by ADITYA DHAR that keeps you hooked and wanting more. After all, the &#39;DHAR&#39; in &#39;DHURANDHAR&#39; truly stands for ADITYA &#39;DHAR&#39;."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11060282/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11067701",
              "author": {
                "username": {
                  "text": "PrimeX-6"
                },
                "userId": "ur200189112"
              },
              "summary": {
                "originalText": "Brutality With Purpose"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandar is a relentless, hard-hitting thriller that doesn&#39;t flinch from the cost of violence and duty. The film grips you tighter as it moves forward, culminating in a final act so intense and brutal that looking away feels impossible. Performances are raw and convincing, the action is grounded and unsensationalized, and the emotional weight - clearly inspired by real-world counter-terror realities - hits deep. Rather than glorifying heroism, Dhurandar forces the audience to sit with its consequences.<br/><br/>Verdict:\nDark, uncompromising, and unforgettable - Dhurandar earns its intensity and leaves a lasting impact."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11067701/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015480",
              "author": {
                "username": {
                  "text": "sahilmohile"
                },
                "userId": "ur143575029"
              },
              "summary": {
                "originalText": "An experience like never before"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every character has been written some brilliantly, with every actors delivering one of their career best performances is just amazing.<br/><br/>Elevates the entire experience. An experience like never before in Hindi Cinema.<br/><br/>Aditya Dhar has done a spectacular job as the writer&amp;director.<br/><br/>2025&#39;s best film!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015480/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11005432",
              "author": {
                "username": {
                  "text": "Sharad-210"
                },
                "userId": "ur211540113"
              },
              "summary": {
                "originalText": "Realistic, Grounded, Killer Casting and Acting"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping and emotionally charged drama that stands out for its powerful storytelling and strong cinematic identity. From the very first frame, the film immerses the audience in a world where ambition, morality, and inner conflict collide, creating a narrative that is as entertaining as it is thought-provoking.<br/><br/>What truly elevates Dhurandhar is its character-driven narrative. The protagonist is written with remarkable depth-flawed, determined, vulnerable, and relentless. His journey is not just a linear progression but a layered transformation, marked by moments of triumph, introspection, and intense struggle. The supporting cast also delivers equally compelling performances, ensuring that every emotional beat lands with authenticity.<br/><br/>The direction is tight and confident, with each scene crafted to serve the story. The pacing is steady and engaging, balancing high-tension moments with quieter, reflective sequences that give the audience space to breathe. The writing is sharp, filled with dialogues that resonate long after the credits roll. It avoids clichés and instead presents a fresh, grounded perspective on themes like loyalty, identity, and personal redemption.<br/><br/>Visually, the film is stunning. The cinematography perfectly captures the mood-whether it&#39;s the intensity of confrontational scenes or the subtle beauty of character-driven moments. The music and background score complement the narrative beautifully, enhancing emotions without overpowering them.<br/><br/>What makes Dhurandhar truly impactful is its ability to maintain emotional honesty. It is not just a story; it is an experience-one that leaves the viewer thinking about the choices we make and the consequences we face.<br/><br/>Overall, Dhurandhar is a must-watch for audiences who appreciate meaningful cinema with strong performances, engaging drama, and a story that stays with you. It is bold, heartfelt, and brilliantly executed.<br/><br/>A must see!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11005432/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029662",
              "author": {
                "username": {
                  "text": "socks-47207"
                },
                "userId": "ur194278066"
              },
              "summary": {
                "originalText": "Best movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Yes this movie have violence but not that much , you are going to love this movie especially the action. The movie is 3 hours long I have watched it 2 times and I&#39;ll rate this 10 , the acting of ranveer singh, akshay khanna , Sanjay dutt , every actors have played their roles very well . Avoid this if you are sensitive to violence."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029662/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006546",
              "author": {
                "username": {
                  "text": "imdbfan-9818616692"
                },
                "userId": "ur198195865"
              },
              "summary": {
                "originalText": "Blaze of Emotions & Thunder of Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s narrative is both intricate and thrilling, combining the political and the personal with fluidity. Ranveer Singh delivers a nuanced performance, capturing vulnerability beneath a hardened exterior. Director Dhar stages action sequences that are exhilarating yet purposeful, blending spectacle with story. Supporting actors contribute authenticity and emotional resonance, enriching the narrative fabric. Cinematography and score work in harmony to heighten tension, making every scene visually striking and emotionally compelling."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006546/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010757",
              "author": {
                "username": {
                  "text": "ankitsingh-11921"
                },
                "userId": "ur85795126"
              },
              "summary": {
                "originalText": "One of the finest episgone movie made by bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Till now baby had the thrown of best spy genre movie now it&#39;s Dhurndar one of the best till made from background score to cinematic experience all the actors had ace there roles special mention would be Akshay Khanna the shows topper than ranveer singh on full fire 🔥 mode. The movie was 3.5 hours long but mostly you don&#39;t feel that the interval part was 2 plus hours but the whole movie had grip to stay you hooked also the climax the 26/11 scene will give you goosebumps and the 2nd part release date is also being told by makers in climax so be ready to get aditya dhar spy universe totally worth watching...."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010757/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027068",
              "author": {
                "username": {
                  "text": "mahikarmakar"
                },
                "userId": "ur196255148"
              },
              "summary": {
                "originalText": "Damnnnnnn.....crazyyy movieeeeee...."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Damnnnnnn.....crazyyy movieeeeee..... fantastic music......loveddd it....best movie can be watch in 2025....can&#39;t wait for another part....👍🏻👍🏻👏🏻👏🏻👏🏻.....supurbbbb....lil too brutal for sensetive once....👏🏻but one word.... fantastic...must watch..... fabulous castingggg.........loved it...... Ranveer Singh killed it....akshay Khanna....wow....and sara beautiful...👏🏻👏🏻👏🏻💗"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027068/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006456",
              "author": {
                "username": {
                  "text": "harmityotam"
                },
                "userId": "ur192026042"
              },
              "summary": {
                "originalText": "Full of Action, Drama, and Star Energy"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film opens with a tense, atmospheric sequence that immediately establishes the perilous world of Karachi&#39;s underworld. Ranveer Singh dominates the narrative with a performance that oscillates between calculated intelligence and raw emotion, capturing his character&#39;s internal moral conflict. Sanjay Dutt enters with an air of authority, each dialogue and gesture commanding the room, establishing him as a figure of gravitas and menace. Akshaye Khanna and R Madhavan provide nuanced counterpoints, their subtle expressions and timing adding layers to pivotal scenes. Arjun Rampal&#39;s presence is quietly chilling, every glance carrying latent threat, while Sara Arjun brings emotional clarity, her innocence highlighting the consequences of the criminal world. Director Aditya Dhar orchestrates each sequence meticulously, blending strategy, tension, and action seamlessly. Cinematography captures sprawling urban chaos and intimate character beats alike, while the soundscape elevates suspense without overwhelming the narrative. Every second of the second half escalates stakes dramatically, delivering thrilling confrontations, shocking twists, and deeply resonant emotional payoffs."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006456/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029402",
              "author": {
                "username": {
                  "text": "pushpakpatil-56685"
                },
                "userId": "ur186147730"
              },
              "summary": {
                "originalText": "An absolute masterpiece."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Movie is based on realism and shows real state of terrorism. Its a well crafted masterpiece. You should watch it with your family ro make them aware about terrorism and what happens behind the closed door.<br/><br/>This movie really white washes the delusional YRF so called spy universe. We need more directors &amp; producers to make these type of movies."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029402/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11029623",
              "author": {
                "username": {
                  "text": "nikitasrivastav"
                },
                "userId": "ur166115784"
              },
              "summary": {
                "originalText": "Brilliant, Bang-on, Hard work visible"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "You can see everyone in the movie has worked very hard. This is a director movie which made each role stood out as the movie progress\nSo impressed by hard work of entire cast. Ranveer and Akshey are remarkable but others have also given their 1000%\nI hope more such movies are made, but perhaps will less violence and gore scenes, they were too much at time in the film."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11029623/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006973",
              "author": {
                "username": {
                  "text": "KiranT-008"
                },
                "userId": "ur203913456"
              },
              "summary": {
                "originalText": "A Star-Driven Experience Packed with Thrills"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative is meticulously structured, combining intelligence with visceral impact. Ranveer Singh delivers a performance that oscillates between vulnerability and determination, while Sanjay Dutt brings authority and menace. Akshaye Khanna and R Madhavan provide nuanced support, and Arjun Rampal&#39;s controlled intensity heightens tension. Sara Arjun&#39;s presence adds an emotional anchor, making the stakes feel personal. Aditya Dhar&#39;s direction ensures that the action is meaningful and the suspense builds steadily. Cinematography captures both the story&#39;s scale and emotional intimacy, and the musical score amplifies every critical moment. By the second half, the stakes rise to an unforgettable crescendo, blending action, drama, and emotion seamlessly."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006973/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023709",
              "author": {
                "username": {
                  "text": "kaushikaditya-89632"
                },
                "userId": "ur87809630"
              },
              "summary": {
                "originalText": "Best Rating"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a full paisa-vasool movie that keeps you hooked from start to end. The story is strong, emotional, and has that raw desi feel which connects directly with the audience.<br/><br/>The direction is tight and well planned-no faltu scenes, no boring moments. The lead actor gives a solid, dhamakedaar performance and completely lives the character. You can feel the emotions, anger, and determination in every scene. Supporting cast is also very natural and adds weight to the story.<br/><br/>Background music is powerful and perfectly matches the mood of the film. Some scenes give you goosebumps, especially during high-voltage moments. Cinematography is realistic and earthy, showing the ground reality nicely. Action scenes look raw and believable, not over-the-top filmy drama.<br/><br/>What makes Dhurandhar special is its strong message, desi emotions, and powerful dialogues that stay with you even after the movie ends. It&#39;s not just entertainment, it&#39;s content with heart.<br/><br/>Overall, Dhurandhar is a must-watch, especially if you like meaningful cinema with mass appeal. Pure desi swag + strong content combo. Highly recommended!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023709/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013108",
              "author": {
                "username": {
                  "text": "SanskarK-97"
                },
                "userId": "ur211586465"
              },
              "summary": {
                "originalText": "A Relentless Thriller Revealing the Hidden Threats Behind India's Security Challenges"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping and unapologetic political thriller that dives straight into the uncomfortable truths the film wants to highlight. The narrative boldly portrays how, within the movie&#39;s storyline, Pakistan as a country along with its government and sections of the Pakistan Army is shown to actively support terrorism. The film makes this theme central, illustrating how extremist outfits are funded, sheltered, and encouraged to operate against India. Groups inspired by ISIS and other terror organizations are shown receiving systematic backing, creating a chilling picture of state-linked destabilization.<br/><br/>Another striking layer of Dhurandhar is its portrayal of India&#39;s internal political decisions. The film does not hesitate to suggest that during the UPA government era, several crucial national security concerns were overlooked. It showcases how intelligence warnings, terror-related indicators, and sensitive geopolitical signals were, according to the film&#39;s viewpoint, ignored or sidelined, leading to gaps that compromised India&#39;s internal security framework.<br/><br/>Despite dealing with complex political themes, Dhurandhar never loses its cinematic grip. The screenplay is sharp, the pacing intense, and the tension is sustained throughout. The lead performances add weight and credibility, capturing the struggle of intelligence officers fighting not only hostile forces across the border but also bureaucratic hesitation and political missteps at home.<br/><br/>Overall, Dhurandhar is a bold, thought-provoking film that raises difficult questions about governance, terrorism, and the unseen pressures shaping India&#39;s stability. It is a must-watch for anyone who appreciates powerful, politically charged storytelling that resonates long after the credits roll."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013108/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018478",
              "author": {
                "username": {
                  "text": "ramyasharmaoct"
                },
                "userId": "ur129884332"
              },
              "summary": {
                "originalText": "What a movie mann!! Brilliant 👏"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar left me genuinely impressed. The cast was absolutely marvellous - every actor delivered their role with such precision and intensity that it pulled me straight into the story. The script is brilliantly written, and the storytelling is gripping from start to finish. Each scene felt purposeful, powerful, and beautifully executed.<br/><br/>Huge kudos to Aditya Dhar! Your vision, direction, and attention to detail are outstanding. You truly brought this narrative to life in the best way possible. 👏<br/><br/>I&#39;m already counting down the days for Chapter 2 in March - can&#39;t wait to see how the next part unfolds!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018478/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010580",
              "author": {
                "username": {
                  "text": "dubeyhritwika"
                },
                "userId": "ur149921843"
              },
              "summary": {
                "originalText": "Brilliant"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is more than just a movie; it is an essential, high-voltage cinematic call to remember. Dhurandhar fearlessly and relentlessly depicts the very real, insidious threats and the dark plots orchestrated against our nation by the neighboring country, brilliantly weaving real-life historical trauma like the IC-814 hijack and Parliament attack into its gripping narrative. Ranveer Singh&#39;s raw, career-defining performance as an Indian agent operating deep behind enemy lines is a powerful tribute to the uncredited heroes of our intelligence services. Go watch it for India, understand the price of peace, and witness a patriotic, adrenaline-pumping drama that refuses to shy away from confronting the truth. It is a massive, must-see spectacle that ignites national pride and confirms Aditya Dhar as a master storyteller of courage and justice."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010580/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11047450",
              "author": {
                "username": {
                  "text": "JOY02kDAS"
                },
                "userId": "ur132739900"
              },
              "summary": {
                "originalText": "December, 2025 turns into Dhurandhar 2025!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "For years, Bollywood espionage was a landscape of secularly balanced sugarcoating and safe narratives. But Aditya Dhar-the captain of URI-has dismantled that blueprint. With &#39;Dhurandhar,&#39; he delivers a masterclass in &#39;unapologetic nationalism&#39; that is as technically brilliant as it is emotionally devastating. By dividing the film into chapters, Dhar gives the audience breathing space in a narrative that moves with the speed of a galloping local, meticulously building the &#39;Why&#39; before diving into the high-octane &#39;How&#39; of the mission. The intermediate chapters plunge the viewer into the chaotic belly of Lyari, where the film transcends traditional action-drama. It is here that we see the mission evolve from a strategy on a map to a desperate fight for survival. Dhar&#39;s mastery lies in his ability to reveal character through conflict-every bullet fired and every silent stare tells us exactly what these men are fighting for.<br/><br/>The soul of the film, however, lies in its most haunting sequence: the moment the screen is bathed in red. In those few minutes, as a conversation pierces the silence, the theater transforms. It isn&#39;t just cinema anymore; it is a visceral encounter with a national scar that shatters the soul to its core. Every countryman of Bharat felt a pain beyond words-a moment of collective grief that serves as the fuel for the fire that follows.<br/><br/>The performances are, without question, the heartbeat of this project:<br/><br/>Ranveer Singh delivers his most disciplined performance yet-cold, calculated, and stripped of all flamboyance.<br/><br/>Akshaye Khanna, the &quot;aura farmer,&quot; commands the screen with a gravitational pull that only a veteran of his caliber could provide.<br/><br/>R. Madhavan, as the &quot;Silent Signal&quot; Sanyal, is the film&#39;s moral and intellectual anchor, proving that sometimes the loudest impact is made in total silence.<br/><br/>Arjun Rampal brings an intimidating physicality that injects a much needed sense of menace in his character. While Sanjay Dutt&#39;s intense performance adds a layer of seasoned wisdom. Newcomer Sara Arjun is a cheerful revelation, filling her shoes with a maturity that anchors the emotional stakes.<br/><br/>The technical craft is the final piece of this perfect puzzle. Shashwat Sachdev&#39;s score isn&#39;t just background music; it is the film&#39;s pulse, pounding in sync with the audience&#39;s heartbeat.<br/><br/>The cinematography captures the grit of Lyari and the vastness of the mission&#39;s scope with a visual language that is both poetic and brutal.<br/><br/>Aditya Dhar has doubled his efforts, proving that Uri was no fluke. Every frame of Dhurandhar feels organic, masterfully crafted, and earned. It is a project that doesn&#39;t just meet expectations-it Clinches cinematic brilliance and redefines nationalism for a new era.<br/><br/>Dhurandhar hasn&#39;t just arrived; it has conquered. So much so that it has turned December 2025 into DHURANDHAR 2025!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11047450/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017537",
              "author": {
                "username": {
                  "text": "tiwariankit-28021"
                },
                "userId": "ur157341837"
              },
              "summary": {
                "originalText": "Akshay Khanna is the lead"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Not at all a fan of Ranveer. Watched it for Akshay Khanna, Arjun Rampal, R. Madhavan and Sanjay Datt. And I loved my decision because they exceeded the expectations. Arjun Rampal plays a character who is calm when speaking but brutal when doing which is makes it a realy dangerous personality so he played the role well. Not sure why people are not noticing that."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017537/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}