{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xolcrotazcwzy472vhhnrurxqmwarz2iotz67ka7d6mqbdf4skydkzoq4v7mryobxhxnjcilvprjwqfidvmktx7oqq",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11007600",
              "author": {
                "username": {
                  "text": "ajayykumarr"
                },
                "userId": "ur154427079"
              },
              "summary": {
                "originalText": "Star-Studded Cast in a Dramatic Ride"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie&#39;s brilliance lies in its seamless mix of strategy, emotion, and chaos. Ranveer Singh carries the story with magnetic intensity, while every supporting actor brings authenticity to their roles. The director&#39;s command over tone and pacing ensures that suspense is constant, with even small interactions loaded with tension. The action is kinetic and sharply choreographed, never just for spectacle, and the film&#39;s layered storytelling keeps the audience guessing. Political undertones and real-world relevance add depth, while the cinematography captures both the sprawling cityscapes and intimate moments with equal artistry, resulting in a cinematic experience that lingers long after the credits roll."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007600/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11038218",
              "author": {
                "username": {
                  "text": "asaprules"
                },
                "userId": "ur186087130"
              },
              "summary": {
                "originalText": "Well written, good pacing and thrilling"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the main things that I loved about the movie was how they introduced each character with text, it was amazing. The way they put up text and then changed it according to their names made their names easy to understand and remember. Each character had a unique and interesting personality which made you root for them.<br/><br/>Amazing movie overall and great storyline."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11038218/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012810",
              "author": {
                "username": {
                  "text": "sangramkanade"
                },
                "userId": "ur156639068"
              },
              "summary": {
                "originalText": "Thrilling watch"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A must watch for every nationalistic person 🇮🇳\nBrought reality to me what our History books can never show.<br/><br/>Aditya Dhar please continue to create such masterpieces.<br/><br/>Art 370, Baramulla and now this.<br/><br/>Absolutely masterpiece direction from Aditya.<br/><br/>Great performances by Akshay Khanna, Ranveer Singh, R Madhavan, Sanjay Dutt.<br/><br/>A must watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012810/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11049490",
              "author": {
                "username": {
                  "text": "Abraham-36"
                },
                "userId": "ur200111486"
              },
              "summary": {
                "originalText": "Emotional rollercoaster"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Although it has run time of 3hr+ but the movie was so engaging that after the movie we crave more. The political aspects of the movie may or may not be accurate but it&#39;s a fictional movie , aditya dhar clearly said inspired on real events not based on real events\nSo let&#39;s just take watch it as entertainment, that&#39;s what movies are supposed to be."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11049490/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11037192",
              "author": {
                "username": {
                  "text": "Neha-326"
                },
                "userId": "ur211779273"
              },
              "summary": {
                "originalText": "Just too good!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Amazing watch, great acting, shooting, direction and music! Powerful acting, especially Ranveer Singh&#39;s restrained intensity and Akshaye Khanna&#39;s charismatic villainy, Gripping action sequences.... Atmospheric cinematography...A bold mix of espionage and gangster drama inspired by real events.... A must watch!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11037192/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007759",
              "author": {
                "username": {
                  "text": "yashs-34490"
                },
                "userId": "ur167185438"
              },
              "summary": {
                "originalText": "A refreshing spy movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Most of the movie take place in Pakistan Karchi,that to in a small part of it, the action was amazing , they used the 18+ certificate in a proper way and the director vision was clear, the movie rewaken the spy movie genre in India. The movie run parallel to major terrorist event that happen in India(i.e 26/11), they used real footage in the movie which bring in more realism to it ."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007759/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11040223",
              "author": {
                "username": {
                  "text": "bronzereload"
                },
                "userId": "ur24433082"
              },
              "summary": {
                "originalText": "Powerful Cast and Captivating Storytelling"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Indian cinema and TV have seen many action packed espionage and crime thrillers lately, but this one definitely hits it out of the park. It&#39;s raw, unhinged, and packed with energy from the begging till the very end. Ranveer Singh did great as the lead, but Akshaye Khanna, R. Madhavan, Sanjay Dutt, Gaurav Gera, Arjun Rampal and Rakesh Bedi all carried the movie with as much (or even more) zeal and energy. This is a perfect example of casting done right. The movie is among the longest in recent times, but split beautifully into chapters, woven together in seamless storytelling, with glimpses of real incidents that connect (and stir emotions) with the audiences, that at no point does it feel like it&#39;s dragging on. The set designing was on point, although more easily identifiable locations like the Rose Garden underpass, could have been substituted with lesser known public infrastructure that would pass for the actual locations in the story. Keeping that aside, no matter how gritty, gory, violent, and to some extent disturbing, some of the scenes might be, this is one of those movies that would make me go for seconds."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-20",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11040223/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010951",
              "author": {
                "username": {
                  "text": "sujeetjeet"
                },
                "userId": "ur83442282"
              },
              "summary": {
                "originalText": "Dhurandhar (2025) - A Gripping Spy Thriller Based on the Reality of Indian Undercover Missions That Delivers on Every Front!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar (2025) - A Gripping Spy Thriller Based on the Reality of Indian Undercover Missions That Delivers on Every Front!<br/><br/>Aditya Dhar&#39;s Dhurandhar is an absolute powerhouse of a film - a bold, ambitious spy action thriller that reminds us why we fell in love with Bollywood&#39;s big-scale storytelling. From the moment it starts, you&#39;re pulled into a gritty, high-stakes world of espionage, betrayal, and patriotism that&#39;s inspired by real events, and it never lets go.<br/><br/>Ranveer Singh is phenomenal as the undercover operative Hamza - restrained yet explosive, delivering one of his career-best performances with subtle intensity that builds to an unforgettable climax. But this is truly an ensemble triumph: Akshaye Khanna steals every scene as the menacing Rehman Dakait, oozing charisma and menace, while R. Madhavan, Sanjay Dutt, and Arjun Rampal bring incredible depth and presence to their roles. No one feels like a side character; everyone shines.<br/><br/>Hats off to director-writer Aditya Dhar (@AdityaDharFilms) for crafting a dense, meticulously researched universe with atmospheric world-building that&#39;s unlike anything we&#39;ve seen in recent Indian cinema - special credit to journalist Aditya Raj Kaul (@AdityaRajKaul) as research consultant, whose expertise lends that authentic, reportage-level edge to the geopolitics, Karachi underworld details, and covert operations. What makes it truly powerful is how it portrays the harsh reality of Indian undercover missions - the sacrifices, moral dilemmas, and sheer courage our unsung heroes endure.<br/><br/>The cinematography is stunning, the action sequences are raw and visceral, and the background score thunders through the theater, elevating every twist and turn. It&#39;s politically sharp, emotionally charged, and packed with Shakespearean betrayals that keep you on the edge of your seat.<br/><br/>Dhurandhar is paisa vasool entertainment - a muscular, patriotic saga that&#39;s thrilling, thought-provoking, and brilliantly executed. Ranveer is back in top form, and this feels like the start of a new benchmark for Bollywood spy thrillers. Highly recommended - catch it on the big screen! #Dhurandhar."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010951/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004496",
              "author": {
                "username": {
                  "text": "Ritu-340"
                },
                "userId": "ur211533594"
              },
              "summary": {
                "originalText": "The best movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "In 3.5 hours, there was not a single moment I got bored. Absolutely amazing. The people giving 1 rating - I am sure they have yet to watch the movie. Every star played the role beautifully. Akshay Khanna was the best. RC was too good. Even the side actors were so good that everyone lived the part. A must watch!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004496/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11025515",
              "author": {
                "username": {
                  "text": "mo_reviews_mo_vies"
                },
                "userId": "ur176490277"
              },
              "summary": {
                "originalText": "Dhurandhar Part 1: A Fiction Forged from Brutal and Painful Reality"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar truly is a breath of fresh air in the otherwise formulaic, predictable and endlessly unmemorable list of Bollywood movies that have come out in 2025. This movie has the potential to change Bollywood and its attitude on film making, prioritizing story, characters, cinematography over style (which this movie also has an abundance off).<br/><br/>The genius of the movie lies in its ability to hold the attention of viewers for a full 3.5 hours through meticulous world building of the infamous Lyari Town (based in Karachi) during the late 2000&#39;s. The movie does a great job of showing how the gangs in small Pakistani Towns are linked to global terrorist events.<br/><br/>The movie is a technical masterpiece with great cinematography, tight editing and a unique use of background score and old Bollywood songs. The acting and casting are top notch with outstanding performances from all the supporting cast as well. Starting with the gang members, they have been given opportunities to show their own unique personalities. Sara Arjun has also played a convincing character of a young daughter of an MP who has been stifled from enjoying her life at her age and is a perfect candidate for honey potting for Ranveer Singh&#39;s character. Rakesh Bedi as the MP of Lyari Town is as conniving and sketchy as the leaders of the gangs so much so that he uses his daughter as a pawn in order to maintain his political control over Karachi.<br/><br/>As for the main cast, each actor has truly metamorphized into their respective roles. R Madhavan is unrecognizable as the sharp, morally unshakeable and simmering underneath with anger Indian Intelligence Bureau Chief Ajay Sanyal. Arjun Rampal plays the cunning, vile and evil ISI Major Iqbal (although he has a short stint in this movie, the sequel might have a larger focus on him as the main antagonist). Sanjay Dutt was the perfect pick to play the frank, foul mouthed and strong-willed SP Aslam Chaudhary. His resemblance to the real-life character is uncanny.<br/><br/>However, Akshay Khanna takes the cake when it comes to playing the barbaric, ambitious and family loving gang leader Rehman Baloch (aka Rehman Dakait). His screen presence is magnetic and he takes the centre stage of any scene he is in. Last but by no means the least, Ranveer Singh has a perfectly played the role of an undercover spy who is trying to make his name in the Karachi Gang syndicate to uncover the people responsible for committing the terrorist atrocities on India. His understated performance (quiet contrary to his bombastic and extrovert real life personality) shows the man&#39;s versatility and ability to shape shift into any role given to him. Dhurandhar might very well be the turning point in his career giving him the much-needed impetus to go onto possibly become the future king of Bollywood.<br/><br/>As a cinephile, I can&#39;t be more excited to recommend this movie to everyone. The movie truly has the potential to break the old hero centric mould of Bollywood movies and usher in a new age of story and character centric movies. This however can only be possible if we as the audience show our support by watching this movie in the theatres and make it a financial success."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11025515/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004903",
              "author": {
                "username": {
                  "text": "rawtevandana"
                },
                "userId": "ur97328932"
              },
              "summary": {
                "originalText": "Masterpiece of decade"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I didn&#39;t give it 10 just to make this review believable. First of all a wonderful, excellent background score, hats off to Shashwat Sachdev. Best of Akshay Khanna and Ranveer Singh. Superb shots, actions and thrilling plot. All the team and characters deserves a huge round of applause. Not bored for even a second."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004903/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007286",
              "author": {
                "username": {
                  "text": "patelahaan"
                },
                "userId": "ur123096540"
              },
              "summary": {
                "originalText": "Edge-of-Seat Action, Powerful Story"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film masterfully blends action, suspense, and human emotion into a gripping cinematic experience. Ranveer Singh anchors the story with a performance that balances moral conflict, emotional depth, and physical intensity. Sanjay Dutt exudes authority and menace, while Akshaye Khanna and R Madhavan provide subtle, intelligent performances that enrich the ensemble. Arjun Rampal&#39;s quiet menace keeps tension taut, and Sara Arjun&#39;s emotional presence heightens stakes. Director Aditya Dhar orchestrates intricate plotting, high-octane action sequences, and suspenseful storytelling with precision. Cinematography captures both the vastness of the city and intimate emotional moments, while the score amplifies tension and drama. By the final act, the film delivers a thrilling, emotionally satisfying, and visually stunning climax that lingers long after the credits roll."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007286/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006615",
              "author": {
                "username": {
                  "text": "imdbfan-7046107835"
                },
                "userId": "ur198243927"
              },
              "summary": {
                "originalText": "The Perfect Mix of Action & Heart"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The brilliance of Dhurandhar lies in its layered storytelling, exceptional performances, and visionary direction. The lead actor carries immense weight with effortless conviction, portraying a character whose choices are both compelling and morally complex. The supporting cast amplifies the narrative, adding depth and nuance in every scene they appear. The director ensures that even with a sprawling plot, the story flows seamlessly, balancing political intrigue, emotional depth, and adrenaline-pumping action. Background score, cinematography, and editing all work in harmony to create tension, release, and emotional impact at the right moments. The way real historical and political events are interwoven with fiction demonstrates a keen understanding of narrative craft. Dhurandhar is cinematic storytelling at its most polished and exhilarating, proving the power of combined talent in performance and direction."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006615/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007580",
              "author": {
                "username": {
                  "text": "raghavjha-60710"
                },
                "userId": "ur154427281"
              },
              "summary": {
                "originalText": "Drama That Keeps You on the Edge"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film opens with subtle tension, establishing a sense of unease that grows steadily as the story delves into crime, politics, and personal loyalty. Ranveer Singh delivers a powerhouse performance, embodying his role with a careful balance of intellect, courage, and vulnerability. The ensemble cast strengthens the film, bringing depth and complexity to every subplot. Action scenes are executed with precision and intensity, reflecting real-world stakes. The director&#39;s command of pacing, narrative structure, and visual storytelling ensures the film never loses momentum, while the music and editing amplify suspense, creating a cinematic experience that feels both thrilling and grounded."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007580/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024159",
              "author": {
                "username": {
                  "text": "biswajitbs-48385"
                },
                "userId": "ur131988018"
              },
              "summary": {
                "originalText": "MIND BLOWING 💥💥"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Totally raw and close to reality story telling, amazing cinematography, lit screenplay and top of that the protagonist as well as other characters have delivered it their 200 %... Cherry on the top- perfect music by Sachdeva sir...short of words to describe it..just awesome... eagerly waiting for the &quot;REVENGE&quot;."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024159/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006407",
              "author": {
                "username": {
                  "text": "rajputsameer-89621"
                },
                "userId": "ur176213963"
              },
              "summary": {
                "originalText": "Unstoppable Energy, Unforgettable Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative tension grows steadily, drawing viewers into a world of betrayal, ambition, and survival. Action scenes are meticulously staged, delivering thrills while advancing character development. Performances feel authentic, particularly in emotionally charged scenes. The director orchestrates the story with confidence, maintaining a rhythm that keeps the audience engaged and invested in the unfolding drama."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006407/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012753",
              "author": {
                "username": {
                  "text": "Rudrajyotid"
                },
                "userId": "ur211584127"
              },
              "summary": {
                "originalText": "10/10 - \"A Brilliant, Gripping Masterpiece from Start to Finish!\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those rare films that grabs you from the very first frame and refuses to let go. Equal parts thrilling, emotional, and thought-provoking, it showcases a level of craftsmanship that deserves to be celebrated.<br/><br/>The storytelling is tight and purposeful, weaving together suspense, character depth, and beautifully layered themes. Every scene feels deliberate, every moment impactful. The director deserves immense credit for creating a world that feels both authentic and cinematic.<br/><br/>The performances are absolutely outstanding. Each actor brings nuance and intensity, elevating the narrative with believable emotions and memorable character arcs. Whether it&#39;s a quiet moment or a high-voltage confrontation, the cast delivers with stunning consistency.<br/><br/>Visually, Dhurandhar is breathtaking. The cinematography, color palette, and framing give the film a striking personality, while the background score amplifies the mood without ever overwhelming it. The music lingers long after the movie ends.<br/><br/>What truly makes Dhurandhar exceptional is its boldness. It doesn&#39;t shy away from exploring complex ideas, yet it remains thoroughly entertaining. It&#39;s smart without being pretentious, thrilling without relying on clichés.<br/><br/>In an age of formulaic storytelling, Dhurandhar stands out as a refreshing, masterfully crafted film. It&#39;s the kind of movie that stays with you - demanding to be discussed, rewatched, and remembered.<br/><br/>A must-watch. Easily one of the best films of the year."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012753/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015385",
              "author": {
                "username": {
                  "text": "AniketS-712"
                },
                "userId": "ur211385660"
              },
              "summary": {
                "originalText": "Dhurandhar-Absolute Reality"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It is indeed the Best Bollywood Film of 2025 The Brutality,The Music, The World Building,Acting,Camera Work,everything was spot on The way they have Linked Real Incident Footage with the Film is outstanding There is A Scene of Red Screen with some voice recordings which will boil your blood Akshaye Khanna was the Show Stealer in Part 1 He had more screen time than Ranveer Singh and he has done an outstanding job Ranveer Singh was Outstanding Too The Scene where he breaks down during the 26/11 Attacks ,his expressions ,it was so emotional One thing I Did not expect from The Film was Comedy It has many elements of Comedy which works beautifully You will Laugh in the Theatre,better than today&#39;s Comedy films Sanjay Dutt too shined His Aura,his dialogue Delivery was everything R Madhavan too shined And Arjun Rampal made my blood boil with his acting The way they celebrated 26/11 attacks was really disturbing Overall Dhurandhar is The Best Spy Film in Bollywood, not even comparing to YRF Spy Universe This film should be experienced in Theatre and not on OTT<br/><br/>Thank You Aditya Dhar."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015385/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016675",
              "author": {
                "username": {
                  "text": "Adityam-165"
                },
                "userId": "ur211613104"
              },
              "summary": {
                "originalText": "Pure Cinema without any propaganda"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This film feels like pure cinema in the truest sense of the word. It avoids cheap tricks, unnecessary noise, and exaggerated storytelling, and instead focuses on presenting a grounded, immersive experience that feels honest and real. There is no forceful messaging, no agenda-driven narrative, and no misleading or fabricated information. What you get is a film that respects the intelligence of its audience and trusts them to feel, think, and experience the story in their own way.<br/><br/>The storytelling is tight and meaningful, carefully balancing emotion, realism, and cinematic beauty. Every scene feels purposeful, and every moment adds weight to the overall journey. The film doesn&#39;t rely on over-the-top drama or unrealistic heroism. Instead, it shows human struggle, silence, tension, and resilience in a way that feels authentic. The world it creates feels lived-in, familiar, and believable, as if you are not just watching a story but stepping into real moments of real lives.<br/><br/>Performances are powerful yet restrained. The actors don&#39;t &quot;perform&quot; their roles; they live them. Their expressions, silences, and body language speak more than loud dialogues ever could. The direction is confident and mature, allowing scenes to breathe rather than rushing through emotions. The cinematography captures rawness and beauty in equal measure, making even the quietest frames feel impactful and meaningful.<br/><br/>What makes this film truly special is its honesty. It doesn&#39;t manipulate emotions, it earns them. It doesn&#39;t sell fantasy; it presents reality through a cinematic lens that feels respectful and sincere. This is not just a movie for entertainment; it is an experience that stays with you long after the screen fades to black.<br/><br/>This is cinema at its purest - simple, truthful, and deeply powerful."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016675/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007238",
              "author": {
                "username": {
                  "text": "kjha-58688"
                },
                "userId": "ur118094736"
              },
              "summary": {
                "originalText": "Heartfelt Drama, Edge-of-Seat Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s layered plot and detailed world-building allow every character moment to resonate. Ranveer Singh&#39;s performance is dynamic and multi-faceted, navigating moral dilemmas and action sequences with equal ease. Sanjay Dutt brings gravitas and intensity, his presence amplifying the stakes of every scene. Akshaye Khanna and R Madhavan deliver intelligent, restrained performances that give depth to the ensemble, while Arjun Rampal&#39;s quiet menace ensures suspense remains constant. Sara Arjun&#39;s emotional portrayal provides humanity and vulnerability, anchoring the story&#39;s emotional core. Aditya Dhar&#39;s direction is precise and assured, weaving together suspense, strategy, and explosive action sequences seamlessly. Cinematography and sound design enhance every moment, from quiet character beats to chaotic action sequences. By the climax, the film delivers a perfectly balanced combination of tension, emotional resonance, and visual spectacle."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007238/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007444",
              "author": {
                "username": {
                  "text": "shri-70721"
                },
                "userId": "ur131647176"
              },
              "summary": {
                "originalText": "Raw Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolute cinema, this is the very core of SPYness which was missing in many of the previous movies. Don&#39;t demean this movie by saying it as a propaganda, absolute directorial masterpiece. Akshya Khanna and Rampal&#39;s ruthlessness Harshness, Madhavan&#39;s portrayal of IB, Ranbir&#39;s solid performance are the main highlights. No artificial hand to hand combat scenes everything felt real."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007444/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017712",
              "author": {
                "username": {
                  "text": "Mukesh-766"
                },
                "userId": "ur211620516"
              },
              "summary": {
                "originalText": "Trusted"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The real class of bollywood with the pinch of truth and reality, awesome movie. Dhurandhar is a refreshing film that blends strong storytelling with powerful performances. The movie keeps you hooked from start to finish with its sharp dialogues, clever twists, and engaging pace. The direction is tight, and every scene feels meaningful.<br/><br/>The lead actors deliver standout performances, especially in emotional and intense moments. The background score elevates the drama, and the cinematography adds richness to the storytelling.<br/><br/>What makes Dhurandhar special is how it balances entertainment with depth. The thrilling plot, unexpected turns, and well-crafted characters make it a memorable watch.<br/><br/>Overall, Dhurandhar is a must-watch for anyone who enjoys smart, impactful cinema."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017712/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006442",
              "author": {
                "username": {
                  "text": "NeelR-9"
                },
                "userId": "ur203386588"
              },
              "summary": {
                "originalText": "Power, Action, and Heartfelt Drama"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "From the first act, the film establishes a world steeped in tension, loyalty, and betrayal. Ranveer Singh anchors the film with a performance rich in nuance, conveying a character torn between duty and personal ethics. Sanjay Dutt&#39;s authoritative presence creates an immediate sense of power and threat, while Akshaye Khanna and R Madhavan&#39;s performances add intelligence and subtle emotional depth. Arjun Rampal&#39;s quiet menace is consistently unnerving, and Sara Arjun&#39;s presence lends emotional weight to every pivotal scene she inhabits. Aditya Dhar&#39;s direction meticulously balances intricate plotting, intense character moments, and explosive action sequences. Cinematography captures both grand city vistas and intimate emotional nuances, while the soundtrack heightens tension without ever overshadowing the drama. The second half escalates suspense, delivering a finale that is both thrilling and deeply satisfying, combining visual spectacle with heart-wrenching emotional stakes."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006442/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11054752",
              "author": {
                "username": {
                  "text": "harshitabhargava-10443"
                },
                "userId": "ur152507420"
              },
              "summary": {
                "originalText": "Powerful, Gripping, and Unforgettable"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is an absolute masterpiece. From start to finish, the film keeps you completely hooked with its intense storyline and tight screenplay. The acting was great, especially by Ranveer Singh, Sanjay Dutt, and Akshaye Khanna, who deliver powerful and convincing performances. Each actor brings depth and intensity to their role, making the characters truly compelling. The direction is top-notch, with every scene adding weight to the narrative, and the background score perfectly elevates the tension and emotion. Even after the movie ended, I am not able to get it out of my head. It stays with you long after the credits roll. Truly deserving of a full 10 stars."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-25",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11054752/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024824",
              "author": {
                "username": {
                  "text": "vishalvwb"
                },
                "userId": "ur125608060"
              },
              "summary": {
                "originalText": "Dhurandhar: An awesome cinematic experience."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping thriller that feels inspired by true events and unfolds against the backdrop of gang wars and terror networks. It&#39;s a well made crafted cinematic experience. Aditya Dhar and his team did a marvelous work. Akshay Khanna as Rehman Dackot is super this character made him immortal in cinema . Background score also keep you engaged all time . Waiting for sequel.<br/><br/>No doubt it&#39;s a finest bollywood movie this year."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024824/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}