{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6ncrntazcwzy47wuxznjyrtumqbbz3mpt57xnadd6mqbdf4skydk3o4yfxnzyoa5mjxygblkaxpeebbcirii3gr5q",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11020863",
              "author": {
                "username": {
                  "text": "KavyaS-870"
                },
                "userId": "ur211648141"
              },
              "summary": {
                "originalText": "Excellent Authentic movie and acting ...."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "No.1 movie in terms of military.... Ranveer singh acting was excellent, he is most muscular than ever, more masculine than ever...he was looking like a dangerous lion rooming hungrily.....Akshay khanna acting was stupendous...Every side actor did their very best ..... Realistic authentic movie ever ...."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020863/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11004782",
              "author": {
                "username": {
                  "text": "riturajuna"
                },
                "userId": "ur61786040"
              },
              "summary": {
                "originalText": "Dhuadhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The real spy of India 🇮🇳\nThis movies show the real side of Pakistan against India.<br/><br/>Akshay Khanna is just mind boggling.<br/><br/>Ranveer done an amazing job.<br/><br/>It shows the deep hatred of Pakistan ISI towards india.<br/><br/>Also it shows the political weakness of Indian govt. During 2005-14.<br/><br/>Eagerly waiting for next part in March 2026 🔥🔥🔥🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-06",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11004782/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006793",
              "author": {
                "username": {
                  "text": "kqvqmrjq"
                },
                "userId": "ur177077846"
              },
              "summary": {
                "originalText": "When Action Roars and Drama Resonates"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The director demonstrates incredible control over narrative structure, maintaining suspense, pacing, and emotional resonance across a long runtime. Fight sequences, emotional moments, and politically charged scenes all feel authentic due to the strong synergy between direction and performance.<br/><br/>The film is a rare example of cinema where every actor, from leads to minor roles, benefits from insightful direction, creating a truly immersive experience."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006793/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015571",
              "author": {
                "username": {
                  "text": "abhisheksingh-27708"
                },
                "userId": "ur132554184"
              },
              "summary": {
                "originalText": "Perfect movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Perfect for me and for me aditya dhar had done great job and Akshay khanna had done a Here is a &quot;Dhurandhar&quot; (powerful/impactful) review of the recent blockbuster &quot;Animal&quot; (assuming you are looking for a review of a high-impact, intense film).<br/><br/>Animal: A Visceral, Unapologetic Beast\nSandeep Reddy Vanga&#39;s &quot;Animal&quot; is not just a film; it is a seismic event in Indian cinema. It is a &quot;Dhurandhar&quot; entry in the genre of crime dramas-bold, bloody, and brutally intense. At its core, the movie is a twisted father-son saga, but wrapped in layers of hyperbolic violence and toxic masculinity that refuse to apologize for their existence.<br/><br/>Ranbir Kapoor delivers the performance of a lifetime. As Ranvijay, he is terrifyingly calm yet explosively violent, shedding his chocolate-boy image for something far darker. His transformation from a neglected son to an obsessive protector is chilling. Anil Kapoor brings a weary gravity to the role of the father, while Bobby Deol, despite limited screen time, leaves a haunting impact as the mute antagonist.<br/><br/>The background score is thunderous, elevating the action sequences into operatic chaos. However, the film is not without flaws. The runtime is punishing, and the screenplay occasionally drags under its own weight. Critics may argue the morality is questionable, but as a piece of cinema, it is undeniable. &quot;Animal&quot; is a wild, untamed beast that roars loud enough to shake the foundations of Bollywood.<br/><br/>Would you like me to write a review for a different specific movie or in a specific style (e.g., funny, critical)?"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015571/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007348",
              "author": {
                "username": {
                  "text": "dguptamunia"
                },
                "userId": "ur196874683"
              },
              "summary": {
                "originalText": "Fantabulous 😁 movie, 10 on 10"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I had been waiting for this movie from the very day it was announced. I watched it yesterday. Those 3 hours and 34 minutes felt as if I lived those moments while watching the movie. Ranveer Singh, as usual, was fire.<br/><br/>The perfect casting, perfect action, perfect direction, and perfect editing. The simultaneous use of songs and action is unique and awesome. I love the &quot;Gehra Hua&quot; and &quot;Karvaan&quot; songs.<br/><br/>It&#39;s a 3 hours and 34 minutes movie, but it was so engaging that I was not eager to leave my seat for a break.<br/><br/>I am eagerly waiting for the next part.<br/><br/>Thanks to Aditya Dhar for presenting a different kind of Bollywood movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007348/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006972",
              "author": {
                "username": {
                  "text": "Mangesh303"
                },
                "userId": "ur199122660"
              },
              "summary": {
                "originalText": "A Star-Packed Saga with Explosive Twists"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s initial sequences introduce viewers to a tense, layered universe where loyalty and betrayal intersect. Ranveer Singh&#39;s performance is magnetic-his subtle glances and controlled expressions in the early intelligence-gathering scenes communicate more than dialogue ever could. Sanjay Dutt brings a formidable presence, making scenes of confrontation electric with authority. Akshaye Khanna&#39;s sharp timing and R Madhavan&#39;s nuanced expressions enrich the ensemble, providing depth to each interaction. Arjun Rampal&#39;s menace is understated but palpable, and Sara Arjun&#39;s emotional vulnerability heightens the stakes. Aditya Dhar orchestrates a perfect balance of narrative tension, strategy, and action sequences, from close-quarters fights to sprawling chase sequences. Cinematography captures the dichotomy of violent chaos and intimate personal drama, while the soundtrack amplifies suspense. The second half escalates with relentless intensity, delivering emotional and adrenaline-fueled payoffs in equal measure."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006972/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11074146",
              "author": {
                "username": {
                  "text": "nikhilkainturae"
                },
                "userId": "ur131609539"
              },
              "summary": {
                "originalText": "Omg whaatt a movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "If you are tired of watching spies flying in cars, romancing enemy agents, and defying physics while saving the world, Dhurandhar is the wake-up call you&#39;ve been waiting for. This isn&#39;t just a movie; it is a raw, gritty, and unapologetic documentation of what actual intelligence work looks like.<br/><br/>You hit the nail on the head compared to the glossed over narratives we&#39;ve been fed by the likes of the &quot;Spy Universe,&quot; this film is a brutal reality check. Unlike other films that try to balance the narrative by showing &quot;good people on both sides&quot; or romanticizing the enemy for the sake of diplomacy, Dhurandhar has the guts to call a spade a spade. It doesn&#39;t sugarcoat the enemy&#39;s intent. There is no forced romance track diverting from the mission. Ranveer&#39;s character, Hamza, isn&#39;t there to sing songs, he is there to dismantle a terror network from the inside. Instead of gravity defying bike jumps, we get actual tradecraft infiltration, encryption, silence, and the suffocating pressure of being undercover in Karachi. The tension in the 26/11 sequences is more heart pounding than any CGI explosion. The film dares to show the detailed planning and infrastructure of terror across the border without filtering it for &quot;mass appeal.&quot; It shows the ugliness of the threat India faces, which is the &quot;reality&quot; many are too afraid to accept.<br/><br/>Dhurandhar exposes the &quot;candy-floss espionage&quot; of YRF for what it is entertainment divorced from reality. This film respects the audience&#39;s intelligence and the sacrifices of our actual unsung heroes.<br/><br/>It&#39;s not just a must watch; it&#39;s a history lesson wrapped in a thriller. If you care about the truth, you watch Dhurandhar. The rest can keep watching their cartoons."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-30",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11074146/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006643",
              "author": {
                "username": {
                  "text": "imdbfan-5945811657"
                },
                "userId": "ur198244034"
              },
              "summary": {
                "originalText": "Massive Moments, Massive Madness"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Ranveer Singh delivers one of his career-defining performances, embodying the moral ambiguity of a man caught between loyalty and survival. The director orchestrates a gripping narrative that seamlessly blends high-octane action with quiet, tense moments of introspection. Supporting actors enhance the story, providing texture and depth. Every frame feels meticulously designed, while the soundtrack pulses with subtle menace, making the second half a breathtaking ride that lingers long after the credits roll."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006643/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016591",
              "author": {
                "username": {
                  "text": "AdityaC-559"
                },
                "userId": "ur211612015"
              },
              "summary": {
                "originalText": "\"Dhurandhar is a good one.."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandhar&quot; is a gripping Bollywood epic that walks a tightrope between raucous entertainment and propagandistic provocation. The film tells the story of an Indian spy, Hamza Ali Mazhari, played by Ranveer Singh, who infiltrates enemy territory to extract crucial intel on impending terror strikes. With its high-octane action sequences, powerful dialogues, and intense performances, &quot;Dhurandhar&quot; has captured the attention of audiences and critics alike."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016591/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018119",
              "author": {
                "username": {
                  "text": "pagarsuyog"
                },
                "userId": "ur92729990"
              },
              "summary": {
                "originalText": "Dhurandhar - A Powerful, Gripping Triumph."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is one of those rare films that pulls you in from the very first frame and never lets go. Packed with emotion, intensity and impeccable craft, the movie stands out as a bold and refreshing cinematic experience.<br/><br/>Ranveer Singh delivers a phenomenal performance, effortlessly carrying the weight of a complex character. He switches between vulnerability and ferocity with ease, reminding us once again why he is one of the most compelling actors of his generation. His screen presence is magnetic, every scene feels elevated because of his commitment and energy.<br/><br/>The storytelling is tight, engaging and beautifully layered. The direction brings out both the rawness and the depth of the narrative, while the cinematography adds a rich visual texture that enhances the mood of the film. The background score fits perfectly, amplifying emotions without overwhelming them.<br/><br/>What makes Dhurandhar truly special is how it blends entertainment with meaning. It&#39;s gripping, but also thoughtful. Stylish, but also soulful. By the time the credits roll, you&#39;re left thinking about the characters, the choices they make, and the world they inhabit."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018119/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017744",
              "author": {
                "username": {
                  "text": "dximperial"
                },
                "userId": "ur126876963"
              },
              "summary": {
                "originalText": "Outstanding"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "After such a long time, Bollywood has come back with something truly amazing. This film is a perfect blend of great storytelling, strong performances, and emotional moments that stay with you long after it ends. Honestly, it feels like a breath of fresh air and a reminder of what Bollywood is capable of when everything falls into place."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017744/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11070268",
              "author": {
                "username": {
                  "text": "burman-27462"
                },
                "userId": "ur147617618"
              },
              "summary": {
                "originalText": "Best Movie of 2025"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping and well-crafted film that keeps you engaged from start to finish. From the very first scene, the movie pulls you into its world with a powerful atmosphere and a strong sense of realism. The storytelling is tight and impactful, with a solid narrative that blends emotion, intensity, and raw truth seamlessly. Every scene feels purposeful, and there are no unnecessary distractions, making the experience immersive and thought-provoking.<br/><br/>What truly stands out in Dhurandhar is how boldly it showcases reality. The film does not shy away from hard-hitting truths and presents them in a way that feels honest and grounded. It reflects real emotions, real struggles, and real consequences, which makes the story resonate deeply with the audience. The intensity is balanced well with emotional depth, allowing viewers to connect with the characters on a personal level.<br/><br/>The performances are commendable, with each actor delivering a convincing and natural portrayal. The lead performance, in particular, leaves a strong impact, capturing both vulnerability and strength with great finesse. The supporting cast also adds value, making the narrative more layered and believable.<br/><br/>Aditya Dhar&#39;s direction deserves special praise. His vision is clear, confident, and courageous. The way he handles sensitive themes while maintaining cinematic brilliance is truly admirable. The cinematography enhances the mood of the film, while the background score subtly amplifies the tension and emotions without overpowering the scenes."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-29",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11070268/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11089740",
              "author": {
                "username": {
                  "text": "myselfcruzzie"
                },
                "userId": "ur70349231"
              },
              "summary": {
                "originalText": "Not a film. But a MOVEMENT."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What an incredible ride.<br/><br/>What an extraordinary experience.<br/><br/>Three and a half hours slipped by without me even noticing, leaving me glued to my seat, still wondering what could possibly come next.<br/><br/>Every single frame feels deliberate, crafted with unmistakable intention to hold your attention no matter what. In an era where attention spans barely last 30 seconds, Aditya sir fearlessly shattered that cycle with 3 hours and 34 minutes of pure, absolute cinema.<br/><br/>A masterpiece that doesn&#39;t just play on screen, it captivates your soul."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-02",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11089740/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006564",
              "author": {
                "username": {
                  "text": "Alauddinghazi"
                },
                "userId": "ur198196083"
              },
              "summary": {
                "originalText": "The Ultimate Blockbuster Feeling"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Tension, emotion, and thrilling action coexist seamlessly, making the film a standout cinematic experience. Ranveer Singh gives a career-defining performance, capturing complexity and inner turmoil with subtlety. Dhar&#39;s direction orchestrates sequences that are visually stunning and narratively satisfying. Supporting actors add depth, enhancing both character and story. Technical aspects, including cinematography, editing, and music, elevate every scene. The result is a film that is immersive, gripping, and unforgettable in every sense."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006564/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11064577",
              "author": {
                "username": {
                  "text": "utkarshyadav-98656"
                },
                "userId": "ur189369547"
              },
              "summary": {
                "originalText": "Best Movie in last 2 years"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Thank you Aditya Dhar for making this film. Absolutely loved it. It has everything an audience needs. A must watch in theatre, I am waiting for 2nd Part.<br/><br/>The supporting cast contributes significantly, fleshing out a realistic criminal ecosystem. Cinematography and editing combine to maintain tension, while the score punctuates key moments. The narrative&#39;s blend of action, politics, and human drama makes the film a truly immersive experience."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11064577/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018329",
              "author": {
                "username": {
                  "text": "leo-129-339"
                },
                "userId": "ur123172742"
              },
              "summary": {
                "originalText": "Totally worth watching"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "One of the best movies I watched till date. Worth every penny you pay. The acting, the storyline - all was amazing. The best part - this movie finally shows the real face of Pakistan and their agenda. Even BBC got triggered by the movie and they landed in Lyari to do some cover up. But I see Pakistanis abroad did verify that what movie shows about Lyari is totally true. Kudos to Dhar!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018329/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016507",
              "author": {
                "username": {
                  "text": "NeelamA-2"
                },
                "userId": "ur211610435"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a gripping film that blends raw realism with high-intensity drama. The story follows Hamza, an undercover Indian agent who is sent deep into the dangerous streets of Karachi to infiltrate one of the most feared mafia networks. Living among gangsters, criminals, and power-hungry leaders, Hamza must carefully earn their trust while secretly working to stop a rising terror operation. As he gets pulled deeper into their world, the line between duty and survival becomes dangerously thin.<br/><br/>What makes Dhurandhar truly stand out is the way it presents this world with such authenticity. The violence, the politics, and the emotional pressure Hamza faces all feel real and intense. The action scenes are extraordinary yet believable, and the performances bring a strong emotional weight to the narrative.<br/><br/>Overall, Dhurandhar is a powerful, fast-paced thriller that delivers both heart and heavy realism-an absolutely compelling watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016507/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014359",
              "author": {
                "username": {
                  "text": "Fuzail-7"
                },
                "userId": "ur211594782"
              },
              "summary": {
                "originalText": "Brilliantly made film and a very real make"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This i would actually rate and 8.5 and it&#39;s a really great watch and honestly I would watch it again given the fact it&#39;s a 3½ hour movie and it&#39;s amazingly directed and narrative was also perfectly set and executed .. this guy aditya dhar just makes hits ... amazing director and the cast just😍😘😚👌Ranveer Singh was always a great and promising actor but he brought his A-game,reminded me of his alaudin khilji role of padmavat ,and Akshaye khanna is on a roll now 🔥🔥and sanjay baba is great as always. This is the best spy bollywood movie compared to all the hits like pathaan, tiger series,war series etc. And this a big compliment."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014359/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012806",
              "author": {
                "username": {
                  "text": "mitrashruti"
                },
                "userId": "ur76188998"
              },
              "summary": {
                "originalText": "Mindblowing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A movie worth of your 4 hours.. not a single dull moment... a must must must watch... AK is spectacular, RS in his best acting performances after Padmavat I feel.. rest Madhavan, SD, and AR are best in their roles, and what to say abt music, the bgm , you will be hooked to them for next 3-4 days.. ."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012806/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027280",
              "author": {
                "username": {
                  "text": "blasterm-36582"
                },
                "userId": "ur189287113"
              },
              "summary": {
                "originalText": "Wonderful movie with a lot of action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I loved the movie. It has been well directed and all actors have done a wonderful job with their roles.<br/><br/>The story too has been depicted in a manner that keeps the audience engaged and the locations of the shoot are well chosen.<br/><br/>A couple of songs here and there are unnecessary but I can understand they have to cater to a variety of audiences.<br/><br/>Can&#39;t wait for the second part!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027280/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11048839",
              "author": {
                "username": {
                  "text": "visinha"
                },
                "userId": "ur91846275"
              },
              "summary": {
                "originalText": "It's a next level"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I don&#39;t know where to begin but my 2 cents is to avoid negative review as it&#39;s totally pointless.<br/><br/>Aditya Dhar everytime raises the bar to the next level. I am not sure how many times I might have watched URI. Article 370 another great movie from him. One thing I can say if any war movies or Spy movies are made I like Aditya to do so with an ultimate story telling and direction.<br/><br/>Now in regards to movie, it showed how the events generally occurred through terrorism and how each of us are affected by that.<br/><br/>One remain engaged fully in the movie with great action scenes(some scenes are not suitable for children under age 16), chase and solid music.<br/><br/>A must watch movie based on true events, unlike a YRF spyverse with no head and tail and always portraying ISI in a good way working with RAW to save India from evil forces."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11048839/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027585",
              "author": {
                "username": {
                  "text": "monikaprasadroy"
                },
                "userId": "ur121951896"
              },
              "summary": {
                "originalText": "Heavy, Haunting, and Impossible to Ignore"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "You know a film is compelling - truly a banger meant for an intelligent audience - when the experience inside the theatre itself becomes a statement.<br/><br/>When people are already seated well before the film begins, not because they were early, but because they didn&#39;t want to miss a second. When not a single phone rings, no screens light up, no restless scrolling - just collective stillness. When no one gets up, not even once, not for water, not for comfort, not for distraction - even as legs go numb and time stretches. When there&#39;s no cross-talk, no commentary, no casual reactions, because everyone is too absorbed to speak. You know it&#39;s working when the only sounds in the theatre are sharp gasps, involuntary screams, and silence so heavy it presses on your chest - especially during those brutal scenes where it almost feels like the audience itself is enduring the pain on screen.<br/><br/>That&#39;s what Dhurandhar does.<br/><br/>From the very first shot, the film doesn&#39;t ease you in - it pulls you under. There&#39;s no warm-up, no cushioning. You&#39;re submerged immediately, watching continuously, without blinking, without relief. Time becomes irrelevant. Three and a half hours pass, your body protests, your legs go numb - and yet you don&#39;t flinch for even a second, because the screen refuses to loosen its grip.<br/><br/>The background score and songs are absolute bangers - not decorative, not loud for effect, but perfectly timed, one after the other, amplifying tension, dread, rage, and inevitability. The music doesn&#39;t tell you what to feel - it locks you into it.<br/><br/>What&#39;s remarkable is how long it takes to realise what kind of film you&#39;re watching.<br/><br/>At some point - much later - it hits you:\nthis is a villain-driven movie.<br/><br/>And even more unsettling - the villains are the main characters.<br/><br/>The film doesn&#39;t announce this. It lets you discover it slowly, uncomfortably, once you&#39;re already emotionally invested. That delayed realisation is part of its brilliance.<br/><br/>There are moments that don&#39;t just disturb - they linger physically.<br/><br/>Your blood boils.<br/><br/>Your throat tightens.<br/><br/>You unexpectedly shed a tear or two.<br/><br/>The Kandahar attack sequence - the neck slicing - is horrifying not because it&#39;s graphic, but because it&#39;s matter-of-fact, stripped of dramatics. The torture sequence involving Arjun Rampal isn&#39;t sensational - it&#39;s procedural, controlled, and therefore far more unsettling. And the 26/11 audio recordings playing against a red screen - that moment doesn&#39;t scream at you. It haunts you.<br/><br/>What makes Dhurandhar successful isn&#39;t just scale, performances, or technical finesse. It&#39;s the way it demands attention and then earns it completely. It trusts its audience to sit with discomfort, to process moral ambiguity, to endure silence, brutality, and restraint without spoon-feeding emotion.<br/><br/>This is not a film you casually watch.<br/><br/>It&#39;s a film you experience collectively, in a theatre, in silence, in tension, in shared unease.<br/><br/>And when the lights come back on, you don&#39;t walk out buzzing or cheering.<br/><br/>You walk out quieter. Heavier. Still processing.<br/><br/>That&#39;s how you know it worked."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027585/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020800",
              "author": {
                "username": {
                  "text": "urarchive"
                },
                "userId": "ur142497240"
              },
              "summary": {
                "originalText": "Best spy movies till date... in Bollywood"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The story is awesome as well as all the characters are very strong<br/><br/>Every moment in this movie is engaging<br/><br/>Eagerly waiting for the second part<br/><br/>You will never find any useless Bollywood masala<br/><br/>You will never feel that it is a long movie at all<br/><br/>I am assuming Arjun Rampal movie would be very dangerous character in the second part<br/><br/>It shows how a spy very silently completes his work in disguise in other country."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020800/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016132",
              "author": {
                "username": {
                  "text": "Shubh-89"
                },
                "userId": "ur211609099"
              },
              "summary": {
                "originalText": "Best movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Real movie Dhurandhar is an absolute cinematic triumph. From the very first frame, the film grips you with its intensity, and by the end, it leaves you speechless. Ranveer Singh delivers one of his most compelling performances to date-raw, powerful, and brilliantly layered. Akshaye Khanna&#39;s calm yet menacing."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016132/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007161",
              "author": {
                "username": {
                  "text": "manojs-50957"
                },
                "userId": "ur118092663"
              },
              "summary": {
                "originalText": "Non-Stop Action with Amazing Performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film immerses viewers in a meticulously constructed world of crime, politics, and human conflict. Ranveer Singh anchors the story with a nuanced performance that portrays a man navigating moral ambiguity with courage and intelligence. Sanjay Dutt dominates scenes with gravitas and menace, while Akshaye Khanna and R Madhavan provide layered support that adds depth to the narrative. Arjun Rampal&#39;s quiet menace keeps audiences on edge, and Sara Arjun&#39;s emotional authenticity heightens the stakes. Aditya Dhar orchestrates action, suspense, and drama with precision, ensuring that pacing, tension, and character development interweave seamlessly. Cinematography captures both grand urban landscapes and intimate emotional moments, while the score heightens every dramatic beat. The second half escalates to breathtaking action, shocking revelations, and emotional resonance, delivering a finale that is both thrilling and satisfying."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007161/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}