{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4w6bdbktazcwzy476whrobqr7r4qaj63motz7xlatepytttfjrkydc3oi4v5prkb4dsfr6zmkah7v4wd72vy7i63kiqy",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11011386",
              "author": {
                "username": {
                  "text": "akxhayk"
                },
                "userId": "ur89948871"
              },
              "summary": {
                "originalText": "Cinematic Spectacle You Can't Miss"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is the Cinematic Spectacle You Can&#39;t Miss\nGenre: Spy Thriller / Action Drama\nDirector: Aditya Dhar\nIf you&#39;re looking for a reason to head to the theaters this week, Ranveer Singh&#39;s Dhurandhar is it. Directed by Aditya Dhar (the mastermind behind Uri: The Surgical Strike), this film isn&#39;t just a movie; it&#39;s a visceral, high-octane experience that reminds us why we love the big screen.<br/><br/>Here is why Dhurandhar is an absolute must-watch:\n1. Ranveer Singh Like Never Before\nRanveer sheds his usual flamboyant energy to deliver a performance of simmering intensity. As Hamza, an undercover intelligence agent infiltrating the hostile underworld of Karachi, he is restrained, gritty, and explosive. His transformation, both physical and emotional,into a man living on a razor&#39;s edge is arguably one of the finest of his career. You don&#39;t just watch him; you fear for him.<br/><br/>2. The &quot;Apex Predator&quot; ,Akshaye Khanna\nEvery great hero needs a terrifying villain, and Akshaye Khanna steals the show as Rehman Dakait. His portrayal of a menacing crime lord is chilling. The psychological cat-and-mouse game between him and Ranveer is the heartbeat of the film. Their face-offs are not just about punches; they are masterclasses in acting.<br/><br/>3. A Stellar Ensemble Cast\nThe supporting cast is a dream team. R. Madhavan brings quiet authority as the intelligence strategist, Arjun Rampal is formidable as the ISI adversary Major Iqbal, and Sanjay Dutt adds raw power as SP Chaudhary Aslam. It&#39;s rare to see so many heavyweights sharing the screen, and each one gets a moment to shine.<br/><br/>4. The Scale and Action\nAditya Dhar has crafted a world that feels dangerous and real. The action sequences,especially the hand-to-hand combat,are raw and brutal, avoiding unnecessary slow-motion for a more grounded impact. The recreation of the gritty Lyari town and the high-stakes espionage operations will keep you on the edge of your seat.<br/><br/>5. It&#39;s an Epic Saga\nBe prepared: this is a massive film (clocking in at over 3 hours), but it uses that time to build a dense, complex story inspired by real geopolitical events. It feels like an epic novel brought to life. Plus, the ending perfectly sets up the confirmed sequel (Part 2 arrives March 2026), leaving you desperate for more.<br/><br/>Dhurandhar is a masterclass in tension, patriotism, and storytelling. It&#39;s gritty, emotional, and visually stunning. Don&#39;t let the runtime scare you-this is a saga that demands to be witnessed."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011386/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013705",
              "author": {
                "username": {
                  "text": "kaustavbiswas-73531"
                },
                "userId": "ur136249596"
              },
              "summary": {
                "originalText": "An Immersive Masterpiece - Story, Music, and Acting in Harmony"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "&quot;Dhurandar&quot; is the kind of movie that reminds you why you love cinema. It&#39;s a must-watch for its perfectly balanced elements: a great, well-paced story that never drags, and absolutely superb performances from the entire cast. The film also deserves special praise for its amazing action scenes. They feel raw, realistic, and gritty-a refreshing departure from typical Bollywood sequences where a single hero effortlessly takes on a crowd. Here, every punch has weight and every confrontation feels dangerous and consequential.<br/><br/>To top it all off, the songs are not just great; they are fantastically integrated, elevating key moments and making the film&#39;s world feel alive and immersive. Highly, highly recommended!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013705/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010332",
              "author": {
                "username": {
                  "text": "Lrishith"
                },
                "userId": "ur210663841"
              },
              "summary": {
                "originalText": "Never seen before wow factors there"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It&#39;s a great movie with best motive,along with best communication actor performance and also great message to audience, the best movie I ever seen right now.yhe the best feautures along with great guidance avilable here for all most trusted and message oriented with high quality of visuals are used it&#39;s great."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010332/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006778",
              "author": {
                "username": {
                  "text": "hrajpal-14209"
                },
                "userId": "ur80180095"
              },
              "summary": {
                "originalText": "Simply one of the best Indian spy movies"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is one of the best depictions of spy genre in Bollywood by far and the run time is all worth they hype. People need to sit with an accepting mindset of watching a universe build up, not a reel or some short form content.<br/><br/>Action set pieces are detailed, acting and dialogues are all slick and apt. Akshaye Khanna and Sanjay Dutt steal the show. And the nuances in Ranveer&#39;s depiction, entry and characterization are all very accurate showing how a low key spy would enter and infiltrate."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 2
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006778/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017017",
              "author": {
                "username": {
                  "text": "pushanvatsyayan"
                },
                "userId": "ur122150478"
              },
              "summary": {
                "originalText": "Greatness of Indian Cinema"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Masterpiece by Aditya Dhar and team, absolutely mind blowing performances by Ranveer, Akshay, maadhwan, bedi ji, arjun and entire star cast , must watch for every indian. Absolutely fine story telling as even 3.5 hours seemed less and you want to keep watching more and more. Screen presentation is epic and every scene has a purpose as well none of the scenes seemed dragged."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017017/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11049306",
              "author": {
                "username": {
                  "text": "janasorl"
                },
                "userId": "ur140499835"
              },
              "summary": {
                "originalText": "Dhurandhar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is about some indian guy named Dhurandhar. He lives in someones underbelly. One of the qualities of this movie is that it&#39;s really long. More than three hours of indian people doing whatever indian people are doing.<br/><br/>The movie follows the traditional indian scoring system, where anything above score 9 means the movie rates about 5/10, and anything 8 and below means that its not gonna be worth your time. This is a weakness, because indian people can&#39;t objectively judge what they are watching, they go into binary mode.<br/><br/>All in all, Dhurandhar is a movie. It&#39;s for sure one of the movies of 2025."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 2,
                "downVotes": 39
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11049306/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008351",
              "author": {
                "username": {
                  "text": "ArjunPundir29"
                },
                "userId": "ur211555435"
              },
              "summary": {
                "originalText": "A Gripping Cinematic Experience That Leaves a Lasting Impact"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "DHURANDHAR is a fabulous movie with a gripping storyline and powerful performances. The direction keeps you engaged throughout, and the impact of the film stays with you even after it ends.<br/><br/>Paced narrative and powerful direction. Each scene adds depth to the story, making the experience both intense and memorable. The film leaves a lasting impression, reflecting the effort and brilliance of the entire team behind it. Definitely a must-watch for anyone who appreciates meaningful cinema."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008351/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006825",
              "author": {
                "username": {
                  "text": "mccrvqkk"
                },
                "userId": "ur177078112"
              },
              "summary": {
                "originalText": "High Drama Meets High Impact"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film steadily builds tension, rewarding patient viewers with an intricate web of suspense, action, and moral complexity. Ranveer Singh delivers one of his finest performances, portraying inner conflict with understated power. The supporting cast complements him perfectly, providing depth to the narrative and enhancing the stakes. The director&#39;s meticulous approach ensures that every scene has purpose, whether advancing character arcs or escalating tension. Action sequences are intense yet narratively essential, while cinematography captures the grit and realism of the underworld. The score amplifies every twist, creating a cinematic experience that lingers long after viewing."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006825/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020188",
              "author": {
                "username": {
                  "text": "ecvikaspal"
                },
                "userId": "ur150667764"
              },
              "summary": {
                "originalText": "Outstanding Performances in a Must-Watch Thriller"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Absolutely gripping from start to finish! Dhurandhar is a masterful action-spy thriller that delivers big on performances, intensity, and storytelling. Ranveer Singh is phenomenal in a career-defining role, anchoring the film with raw energy and emotional depth. Akshaye Khanna&#39;s powerful portrayal of the antagonist adds a thrilling edge that elevates every scene. The direction by Aditya Dhar is confident and immersive, weaving a complex narrative that never loses its hold on you. With stellar performances, high-octane action, and a richly constructed world, Dhurandhar is a must-watch cinematic experience - one that stays with you long after the credits roll!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020188/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006800",
              "author": {
                "username": {
                  "text": "fwjrvkkw"
                },
                "userId": "ur177078012"
              },
              "summary": {
                "originalText": "Hard-Hitting Moments with Heavy Emotions"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The antagonist is particularly noteworthy, offering a nuanced foil that raises the stakes dramatically. Every scene is meticulously constructed, allowing actors to shine within high-tension situations as well as quieter, more introspective moments. The coordination between direction, cinematography, and performance makes Dhurandhar a film that stays with you long after the credits roll."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006800/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11035795",
              "author": {
                "username": {
                  "text": "nalindra-ferdinando"
                },
                "userId": "ur28797803"
              },
              "summary": {
                "originalText": "This is how to make action movies"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "High time directors in all India learn how to make action movies. This is perfection driven by insanely great performances by one of the best cast ever seen with brilliant soundtrack. Must watch since this will go down in history as one of the best spy movies ever in the world of movies ever. It&#39;s that epic."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-18",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11035795/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11015357",
              "author": {
                "username": {
                  "text": "dhrub_ryu"
                },
                "userId": "ur147336037"
              },
              "summary": {
                "originalText": "Nation at its peak"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar Sir, love you. What a movie !!!!<br/><br/>This is how movies are to be made.<br/><br/>You nailed URI now, Dhurandhar.<br/><br/>Everyone, go watch this movie, one of the best of all time in Bollywood history, and the best spy movie Bollywood has ever made.<br/><br/>The movie did not feel like 3.5 hours, I was ready to even watch part 2 there itself.<br/><br/>There is nothing more important than our nation, and that&#39;s what the movie is.<br/><br/>Overall, at last, I want to thank the entire Dhurandhar team for making this masterpiece and giving the audience what we have been deserving for a long time. Thank you, Thanks a lot.<br/><br/>Jai Hind."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11015357/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014171",
              "author": {
                "username": {
                  "text": "akhinis"
                },
                "userId": "ur179123739"
              },
              "summary": {
                "originalText": "When the Director knows what he's doing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Well crafted, heavily dense on information, never making it feel like a vomit on screenplay, subtly done and use of craft when supposed to make screen look massive and stylish and also giving utmost space for the scenes to breathe out so that the audience suffocates in the pure audacity of the Director, Aditya Dhar knows his stuff n boy did he gave a layered, top notch performance driven, brutal and a needed power pack punch with this one after URI, also made the sales for Burnol to experience a sudden high."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014171/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11045898",
              "author": {
                "username": {
                  "text": "akashsingh-01598"
                },
                "userId": "ur82916946"
              },
              "summary": {
                "originalText": "God"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar looks like a high-octane action thriller that promises intensity, scale, and a gripping narrative. Directed by Aditya Dhar, the film carries a strong sense of realism blended with stylized action, much like his earlier work. Ranveer Singh appears to be stepping into a darker, more restrained avatar, which adds intrigue and freshness to his screen presence.<br/><br/>The teaser and promotional material suggest a powerful storyline rooted in strategy, patriotism, and psychological depth rather than just surface-level action. The background score and visuals create a tense atmosphere, hinting at a film that focuses on smart execution and layered characters."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11045898/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11049610",
              "author": {
                "username": {
                  "text": "SonamS-9593"
                },
                "userId": "ur211882231"
              },
              "summary": {
                "originalText": "Not needed"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Came out of theatre with headache. Felt like I had watched any Pakistani movie. Was there a need to show Pakistani things or cruelty so deeply, the scene where rival gang boys were about to assault Ranveer, was that necessary to show ? The answer is No.<br/><br/>There was nothing that could be said patriotic other than last 4-5 minutes.<br/><br/>Although having such brilliant actors who gave top notch performances, yet the movie isn&#39;t worth watching. 1 Star only for the acting ."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-23",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 22
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11049610/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11008238",
              "author": {
                "username": {
                  "text": "phbcw"
                },
                "userId": "ur147769799"
              },
              "summary": {
                "originalText": "Akshaye Khanna is awesome!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Akshaye Khanna lifts this movie, has wonderful screen presence. Movie is fast paced. Script is good . Worth watching in a theatre. But the real highlight of this movie is akshaye Khanna. He is really impressive. Superb acting by him( specially his expressions and dialogue delivery). He is in full control. Other actors are also good and justify their part."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11008238/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022963",
              "author": {
                "username": {
                  "text": "ranjansui"
                },
                "userId": "ur167018736"
              },
              "summary": {
                "originalText": "Great movie which actually shows reality."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Good character and world building, direction and dialogues. Shows real incidents which actually builds sense of nationalism.<br/><br/>Dhurandhar is an absolute powerhouse of a film - the kind that reminds you why the big screen experience still matters. Every frame feels meticulously crafted, from the electrifying action sequences to the emotionally loaded character moments. The lead actor delivers a career-defining performance, carrying the film with charisma, intensity, and surprising vulnerability. The direction is sharp, the pacing relentless, and the background score elevates the narrative into something genuinely cinematic.<br/><br/>What truly sets Dhurandhar apart is its ability to balance mass entertainment with smart storytelling. The world feels alive, the conflicts feel personal, and even the supporting characters leave a mark. It&#39;s rare to see a film that fires on all cylinders - writing, performances, music, cinematography - and Dhurandhar does exactly that. A must-watch that sets a new benchmark for the genre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022963/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006746",
              "author": {
                "username": {
                  "text": "PoojaL-29"
                },
                "userId": "ur204918380"
              },
              "summary": {
                "originalText": "A Storm of Stars and Intense Action"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Audiences are immediately drawn into a world of layered conflict and high stakes. The lead embodies the moral complexities of the story with precision and subtlety. Action sequences are inventive, realistic, and carefully structured to maintain narrative tension. Cinematography highlights contrasts between chaos and introspection, creating a dynamic visual language. Secondary characters enhance the story&#39;s authenticity, making every subplot meaningful. The screenplay gradually escalates, weaving political intrigue and personal drama seamlessly. By the finale, tension reaches a peak, delivering both adrenaline-fueled action and emotional resolution. This is a film that challenges, excites, and resonates deeply."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006746/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007158",
              "author": {
                "username": {
                  "text": "NeerajM-869"
                },
                "userId": "ur203911147"
              },
              "summary": {
                "originalText": "Emotion takes flight while action tears through the screen"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watching Dhurandhar was an absolute rollercoaster! Ranveer Singh has truly outdone himself-he is energetic, intense, and fully believable in every scene. Sanjay Dutt brings his usual charm and power, while Akshaye Khanna and R Madhavan add depth to the story with their brilliant acting. Arjun Rampal stands out in action-packed sequences, and young Sara Arjun is adorable yet impactful. Aditya Dhar&#39;s direction keeps the story tight, mixing action, drama, and emotions effortlessly. The movie is long, but every minute feels worth it, with great humor and strong political undercurrents that make it very engaging."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007158/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11022897",
              "author": {
                "username": {
                  "text": "KenA-602"
                },
                "userId": "ur211662853"
              },
              "summary": {
                "originalText": "Greatest movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Aditya Dhar&#39;s spy thriller delivers intense action and stellar ensemble cast. Ranveer Singh shines as undercover agent Hamza, but Akshaye Khanna steals the show as menacing Rehman Dakait. At 3.5 hours, pacing drags despite gripping espionage sequences and authentic Karachi atmosphere. Strong world-building sets up Part 2 nicely. A mixed bag-worth watching for performances."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11022897/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11009281",
              "author": {
                "username": {
                  "text": "dasrumana"
                },
                "userId": "ur185247584"
              },
              "summary": {
                "originalText": "A Realistic Spy Act That Stands Out"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Watched this movie yesterday and didn&#39;t expect this from a mainstream bollywood movie. What impressed me most about Dhurandhar was how Ranveer Singh portrayed the role of a spy with such subtlety and control. Instead of playing it like a typical Bollywood hero who dominates every frame, he truly blended into the story the way a real undercover agent should. His movements, gestures, and expressions were all effective, making his character feel authentic and believable.<br/><br/>Yes, the movie is long, but it felt like binge-watching a series-which I generally love-because the pacing and flow kept me hooked throughout.<br/><br/>However, I didn&#39;t particularly like a few of the controversial statements made by R. Madhavan&#39;s character. The pro-government tone in some dialogues felt unnecessary and slightly out of place in an otherwise gripping spy narrative.<br/><br/>Definitely waiting for the second part. Highly suggest the movie just for the story telling and brilliant acting by Ranveer, Akshay Khanna and everyone."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11009281/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11061966",
              "author": {
                "username": {
                  "text": "KrishR-078"
                },
                "userId": "ur211966551"
              },
              "summary": {
                "originalText": "Dhurandhar a true spy thriller masterpiece."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a true spy thriller movie not like yrf isi universe. No beach, no romance with isi agent only raw and real story. Aditya dhar i salute you for making this movie and I am very excited to see dhurandhar part 2 and a fun fact for negative reviewers it already crossed 1000 cr to fire extinguisher apni ga**nd me dal Lena."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-27",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11061966/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11027149",
              "author": {
                "username": {
                  "text": "parthdeepsinghdhillon"
                },
                "userId": "ur112357254"
              },
              "summary": {
                "originalText": "Aditya Dhurandhar!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is extraordinary. Hard to belive that an Indian movie could present hard hitting facts in such a cinematic fashion... Brilliant acting by everyone - R Madhvan was just too good... Mindblowing background music... All out high octane blockbuster... Aditya Dhar is a magician... Don&#39;t miss it... Watch it on a bigger screen..."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11027149/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11046854",
              "author": {
                "username": {
                  "text": "TARUNU-44"
                },
                "userId": "ur211860499"
              },
              "summary": {
                "originalText": "Worst movie with no head and feet donot reccomend people to watch such voilent and full of abusive language used never go to watch such movies no story baseless start and end"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Worst movie ever seen no head and feet baseless no story full of drama and nautanki.never reccomend people to watch such movies use of voilence and full of drama irrelevent connection of the movie waste of money wastte of time spent it somewhere else will never reccomend to go for such nonsence story."
                }
              },
              "authorRating": 1,
              "submissionDate": "2025-12-22",
              "helpfulness": {
                "upVotes": 1,
                "downVotes": 23
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11046854/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11028380",
              "author": {
                "username": {
                  "text": "AtharvaP-31"
                },
                "userId": "ur211704354"
              },
              "summary": {
                "originalText": "ReView of Film"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film that I watched was very nice in terms of throwing the lights on reality of the Pakistan and how the country creates terrorist organisations and I want to thank the makers to make such film that give us entertainment with action thriller and lights of realism.<br/><br/>And the acting that all the cast has done shows the reality of such Agents living in the undercover with every aspect and life danger."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-15",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11028380/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}