{
  "data": {
    "title": {
      "reviews": {
        "total": 2561,
        "pageInfo": {
          "endCursor": "g4xofdjotazcwzy476thrnzsrhrmycjt34odr6xjate6mqbdf4skydk2oqzvjmryodcjnu73celmmvxcdgrwzxk3rk2q",
          "hasNextPage": true,
          "hasPreviousPage": false
        },
        "edges": [
          {
            "node": {
              "id": "rw11024412",
              "author": {
                "username": {
                  "text": "ankurkrissingh"
                },
                "userId": "ur82682437"
              },
              "summary": {
                "originalText": "One the best spy movies of all times with lots of entertaining moments. Music is awesome and this movie won't allow you to blink during those 3 and half hours. Must watch."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Best Indian movie, which talk with facts with exceptional screenplay. All the actors are really living the characters, you won&#39;t feel that you&#39;re watching acting, it will feel like you&#39;re being a part of exceptional journey of a spy. After watching trailer I thought it&#39;s too violent as Few scenes are violent but when I watched it I realised the need to show such violence."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024412/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11006885",
              "author": {
                "username": {
                  "text": "hqepbock"
                },
                "userId": "ur177078592"
              },
              "summary": {
                "originalText": "Emotion in Every Word, Action in Every Move"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a cinematic powerhouse that combines stellar storytelling with unforgettable performances. The lead actor delivers a career-defining performance, balancing raw intensity with subtle emotional depth. Every nuance of his expression communicates the internal conflicts of a man caught in a web of crime and politics. The supporting cast is equally phenomenal, adding layers and texture to the narrative. The director&#39;s vision is bold and meticulous, weaving together action, political drama, and moments of quiet tension seamlessly. The film&#39;s pacing is near-perfect, with a first half that builds the world and characters masterfully, and a second half that explodes with drama, suspense, and jaw-dropping sequences. Every frame feels deliberate, from the cinematography to the background score, and the use of real-life geopolitical events gives the story a haunting authenticity. Dhurandhar is a cinematic experience that lingers long after the credits roll."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11006885/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007056",
              "author": {
                "username": {
                  "text": "Nisha26151"
                },
                "userId": "ur199123746"
              },
              "summary": {
                "originalText": "A Heart-Pounding Saga of Secrets and Survival"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film&#39;s world-building is exceptional, creating a universe where tension, strategy, and emotion coexist. Ranveer Singh anchors the story with a layered performance, seamlessly navigating moral conflict, action, and emotional depth. Sanjay Dutt&#39;s commanding presence adds authority and tension, while Akshaye Khanna and R Madhavan provide subtle, effective support. Arjun Rampal&#39;s quiet menace keeps viewers on edge, and Sara Arjun&#39;s emotive moments provide the story&#39;s heart. Aditya Dhar directs with precision, blending suspense, plot twists, and meticulously choreographed action. Cinematography captures both the scale of the underworld and intimate emotional beats, while the score enhances suspense. The climax delivers a satisfying combination of adrenaline, drama, and emotional resonance."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007056/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11020106",
              "author": {
                "username": {
                  "text": "soodmohit-80578"
                },
                "userId": "ur102905620"
              },
              "summary": {
                "originalText": "Great spy movie to watch. Ignore the critics"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The movie is so awesome to watch. Every single second is worth watching. The story, songs , acting and action is top notch. Showcasing how spying works. The hero in this movie Ranveer Singh is behind the shadow working for his country.<br/><br/>The pak loving critics is so offended with this movie that I found it more entertaining that movie itself."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-12",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11020106/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11013701",
              "author": {
                "username": {
                  "text": "nishits-167"
                },
                "userId": "ur211591720"
              },
              "summary": {
                "originalText": "Best movie ever"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Bollywood can make more movies like this if they want the audience back. This movie is the reality which every person in India needs to see to take the reality check n boycot the fake narrative making movies. Really liked the movie after so long time from bollywood. Performance is top from all the actors."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11013701/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014369",
              "author": {
                "username": {
                  "text": "nitinsidelhi"
                },
                "userId": "ur119679344"
              },
              "summary": {
                "originalText": "Mind blowing"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "A directors special movie.<br/><br/>Its a big screen movie and overall in 4 hrs.. not even a single scene will give you boredom.<br/><br/>You want even ve able to recognise few actors as they camouflage in their role like madhavan, Rampal, Rakesh Bedi,<br/><br/>No doubt Akshaya Khanna steal the show. A great comeback and prove his quality works."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014369/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016736",
              "author": {
                "username": {
                  "text": "AranyaG-5"
                },
                "userId": "ur211611787"
              },
              "summary": {
                "originalText": "About movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Dhurandhar is a powerful and captivating cinematic experience that delivers excellence in every frame. The film presents an engaging storyline filled with excitement, intensity, and brilliant world-building. The performances are outstanding, with the lead and supporting cast bringing immense depth, energy, and presence to their roles.<br/><br/>The direction is impressive and consistently immersive, supported by stunning cinematography that enhances every scene with rich visuals and a strong atmosphere. The background score elevates the emotions beautifully, while the action sequences are dynamic, gripping, and extremely well-crafted.<br/><br/>The film maintains a strong pace, offering continuous engagement and an enjoyable narrative flow. Every subplot adds colour, emotion, and value to the overall experience. Dhurandhar is a commendable achievement in filmmaking, delivering entertainment, emotion, patriotism, and impactful storytelling.<br/><br/>Ideal for viewers who enjoy thrilling, stylish, and well-performed cinema. Dhurandhar is an impressive, memorable, and highly satisfying watch."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016736/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023920",
              "author": {
                "username": {
                  "text": "priyankgupta-67685"
                },
                "userId": "ur157555297"
              },
              "summary": {
                "originalText": "Movie of the year"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "I haven&#39;t seen something like this before every scene was on point and it was brilliant. Every aspect of this movie justifies hype around it. Cinematography was top notch, background score is heart of the movie, movie is exceptional for its realism and last but not least what a cast! Absolutely brilliant performance from each actor ."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023920/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11066116",
              "author": {
                "username": {
                  "text": "nitinjaiswal06"
                },
                "userId": "ur93035001"
              },
              "summary": {
                "originalText": "Aditya dhar backupd by yami as house wife for mental peace to give masterpiece"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The Verdict: A Masterclass in Espionage\nDhurandhar is a gritty, high-stakes thriller that proves Indian cinema can deliver a world-class spy epic without relying on over-the-top stunts. Director Aditya Dhar swaps flashy heroics for raw realism, focusing on the psychological tension of undercover operations.<br/><br/>* The Cast: Ranveer Singh delivers a career-defining, restrained performance, while Akshaye Khanna is terrifyingly brilliant as the antagonist.<br/><br/>* The Action: Intense, visceral, and grounded. Every sequence feels earned and high-stakes.<br/><br/>* The Vibe: Dark, immersive, and fast-paced. It&#39;s a cerebral cat-and-mouse game that keeps you on the edge of your seat.<br/><br/>Bottom Line: A massive achievement for Bollywood. It&#39;s not just a movie; it&#39;s an experience that sets a new gold standard for the genre."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-28",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11066116/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11023312",
              "author": {
                "username": {
                  "text": "ankityadav-90051"
                },
                "userId": "ur109276234"
              },
              "summary": {
                "originalText": "A Masterpiece of Patriotism and Espionage"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Yet again, Aditya Dhar has delivered an absolute masterpiece. With this film, the director is undeniably on a roll, establishing himself as one of the most daring and purposeful filmmakers in contemporary Indian cinema. While many of his peers continue to churn out frivolous romantic comedies and predictable love stories, Dhar remains committed to telling the untold, brave tales of real heroes-stories that deserve to be on the big screen. And he nails it perfectly.<br/><br/>I&#39;m not typically a huge fan of Ranveer Singh, but credit where it&#39;s due: under Aditya Dhar&#39;s direction, Singh delivers a performance that does full justice to his complex character. One can&#39;t help but wonder if another actor might have brought an equally powerful interpretation to the role, yet Bollywood&#39;s infamous networking game seems to have prevailed once more. That said, Singh rises to the occasion, and the result is compelling.<br/><br/>A massive thank you to Aditya Dhar for finally giving us a sensible, gripping Indian spy thriller that honors its subject with authenticity and intensity. Hats off to the casting team as well-they&#39;ve pulled off a coup by assembling an ensemble of absolute juggernauts, creating on-screen magic that&#39;s rare to witness.<br/><br/>This is the kind of cinema India needs more of. I&#39;m already counting the days until the second part. Highly recommended-don&#39;t miss it !!!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11023312/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11017749",
              "author": {
                "username": {
                  "text": "SonaliS-09"
                },
                "userId": "ur211620404"
              },
              "summary": {
                "originalText": "Best movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This is must to watch. If you are a patriot you will automatic appreciate the work is the director and his haed work in building this movie. The scenes in the movie are what you expect from a class 1 movie the song is fire, massive hit you must have heard it reels or shorts what a feel to it is. So conclusion is a must watch. And do not forget to give review on as many platform as possible. Appreciate the directors and motivate them to make such good content."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11017749/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11026952",
              "author": {
                "username": {
                  "text": "MitabarP"
                },
                "userId": "ur211693744"
              },
              "summary": {
                "originalText": "Very good film."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The best display of the intent. The scenes were raw. That had deep impact. Though the screen time was a bit long, but it&#39;s worth it. The actual conversation of the 9/11 attack added to the intensity of the movie. The love part could have been kept more superficial. Would be eagerly waiting for the second part of the movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-14",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11026952/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007316",
              "author": {
                "username": {
                  "text": "sunilsharma-61369"
                },
                "userId": "ur135721130"
              },
              "summary": {
                "originalText": "A Thrilling Ride with Epic Performances"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The narrative unfolds with intelligence, combining political tension, personal stakes, and explosive action. Ranveer Singh&#39;s portrayal is nuanced, embodying both vulnerability and tactical brilliance. Sanjay Dutt brings authority and intimidation to every scene, while Akshaye Khanna and R Madhavan elevate supporting sequences with subtle performances. Arjun Rampal&#39;s quiet menace permeates multiple pivotal moments, and Sara Arjun&#39;s emotional authenticity provides a humanizing counterpoint. Aditya Dhar&#39;s direction balances layered storytelling with adrenaline-driven sequences. Cinematography captures the scale of the underworld alongside intimate character moments, and the score enhances tension and emotional resonance. By the climax, every narrative thread converges in a finale that is thrilling, shocking, and deeply satisfying."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007316/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11011097",
              "author": {
                "username": {
                  "text": "AtulG-455"
                },
                "userId": "ur204422748"
              },
              "summary": {
                "originalText": "Good movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Enjoyed watching it, one of Ranveer Singh&#39;s greatest movies. It seems the old Ranveer is back.<br/><br/>Akshaye Khanna stole the show with outstanding acting. He made Rehman Dakait an aura-defining character. The scene where he is entering the Baloch welcome event for him is all over the internet for a reason.<br/><br/>Waiting for the next part."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11011097/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11057975",
              "author": {
                "username": {
                  "text": "gopalsr-97178"
                },
                "userId": "ur194147757"
              },
              "summary": {
                "originalText": "Excellent pacing and plot-essential violence!!!"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "The film surprisingly kept my ADHD brain engaged for 3.5hrs. Typically I avoid movies longer than 2hrs, or I wait for ott release and watch in parts, but this was a rare exception.<br/><br/>Writing and direction was brilliant, good job Aditya Dhar! Also kudos to the Mukesh Chhabra for the excellent cast, each actor delivered their part perfectly.<br/><br/>Gritty realistic violence, with each sequence adding meaning to the plot, rather than pure eye-candy action, or exploitative violence.<br/><br/>Easy 10/10 Jai Hind 🇮🇳🇮🇳 !!!"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-26",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11057975/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11095598",
              "author": {
                "username": {
                  "text": "framebyrahul"
                },
                "userId": "ur44434745"
              },
              "summary": {
                "originalText": "A Monument in Indian Cinema - I'm Still Thinking About It"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "It has been weeks since I first saw Dhurandhar and the more I reflect on it the more I realize we have just witnessed a massive shift in storytelling. Aditya Dhar has not just made a thriller. He has built a sprawling eight chapter epic that feels more like a prestige series than a standard movie.<br/><br/>The decision to divide the film into eight distinct movements is a stroke of genius. It forces you to sit with the consequences of every scene. One specific chapter set in the streets of Lyari is a masterclass in world building. We were not just watching a mission. We were breathing the air of that world. It is rare to see a director trust his audience enough to let the plot simmer for over three hours but here every minute is earned.<br/><br/>If there is any justice the cinematography should sweep every award this year. It is sculpted in the truest sense. Instead of the usual bright action movie look it uses a dark shadow heavy style that makes the screen feel alive. The way the camera frames Ranveer&#39;s character often in half shadow perfectly mirrors a man losing his identity to his cover. The red screen moment during the intercepts felt genuinely new for a mainstream film.<br/><br/>The music score is the secret weapon here. It does not just underline the action. It drives it. The synth heavy sound in the climax gave me chills. The way the score transitions from traditional textures into cold mechanical sounds mirrors the lead character&#39;s descent from a man of mission to a machine of war.<br/><br/>While some may complain about the long runtime it is necessary. This film respects patience and craft. It shows the waiting and the mental weight of being undercover. Ranveer&#39;s performance is built on what he does not say and Akshaye Khanna is terrifying because of how human and polite he is.<br/><br/>Dhurandhar is a technical marvel that refuses to simplify itself for the masses. It is gritty long and unapologetically intelligent. This is a film that will be studied for years as the moment Indian cinema finally grew up. Absolute ten out of ten."
                }
              },
              "authorRating": 10,
              "submissionDate": "2026-01-04",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11095598/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11024667",
              "author": {
                "username": {
                  "text": "shah_mishal"
                },
                "userId": "ur24502711"
              },
              "summary": {
                "originalText": "Blown away...."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "What a follow up from Aditya Dhar after URI and Article 370...\nReally goes all out in this film\nMade on a grand scale with excellent performances and BGM and relentless action..\nThis is one of the best movies of the last 5 years..\nAkshaye Khanna and Sanjay Dutt are too good..\nRakesh Bedi is the surprise package...\nMadhavan is unrecognisable as NSA chief\nArjun Rampal has a short but impactful role\nAnd I think the second part will truly belong to Ranveer Singh...\nCan&#39;t wait for 19 Th March 2026."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-13",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11024667/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11007252",
              "author": {
                "username": {
                  "text": "arjundixit-02715"
                },
                "userId": "ur123094537"
              },
              "summary": {
                "originalText": "Fast-Paced Adventure with Star Power"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Every aspect of the film-writing, performance, direction, and technical craft-works in harmony to create a powerful cinematic experience. Ranveer Singh delivers a performance of subtlety and intensity, navigating a character torn between morality and survival. Sanjay Dutt commands the screen with authority, while Akshaye Khanna and R Madhavan offer measured, intelligent performances that enrich the ensemble. Arjun Rampal&#39;s quiet menace sustains tension, and Sara Arjun&#39;s emotional depth provides narrative grounding. Aditya Dhar orchestrates suspenseful sequences, intricate plotting, and explosive action seamlessly. Cinematography captures Karachi&#39;s underworld with visual precision, and the score punctuates tension and emotion effectively. The climax delivers a satisfying, thrilling, and emotionally resonant resolution."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-07",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11007252/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11016169",
              "author": {
                "username": {
                  "text": "gargis-53"
                },
                "userId": "ur200950018"
              },
              "summary": {
                "originalText": "\"Dhurandhar: Quality Cinema, Wrongly Tagged as Propaganda\""
              },
              "text": {
                "originalText": {
                  "plaidHtml": "First let&#39;s give a round of applause to the director and the entire crew of the movie , after so much time they have made us realised what bollywood potential can be.<br/><br/>Now about the story it is a normal story but the way they have executed it was good. It has it&#39;s own way of style , for this I appreciate Aditya Dhar . The way of the direction, cinematography and other technical side was pretty good. In social media there were some people saying about propaganda and all I didn&#39;t find any.<br/><br/>Now about the performance loved Ranveer Singh come back through this movie he has done an exceptional acting and he knows his job very well, then about Akshaye Khanna this man was literally doing Aura farming in the entire movie he was exceptional no words to express. Madhavan also has done good job .<br/><br/>Here I am gonna talk about some flaw&#39;s which I felt the movie had the love angle or the heroine and hero&#39;s love story should have been made better but it has relevance but still the it didn&#39;t had the depth, then also Sanjay Dutt is a good actor but I felt like he is doing the same roles and also sometimes he is just acting for the sake of acting ."
                }
              },
              "authorRating": 8,
              "submissionDate": "2025-12-10",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11016169/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11037256",
              "author": {
                "username": {
                  "text": "AnirdeshP"
                },
                "userId": "ur206983215"
              },
              "summary": {
                "originalText": "Dhurandhar for oscar"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "This movie is packed with good type of violence and twists one of the best movies i watched. Ranveer singh as hamza was 🔥🔥🔥🔥 the story was the script like no other and was very fun to watch. Definetely would go to theatre again to watch this masterpiece. Akshay Khanna acting🔥🔥🔥 this is a peak story🔥🔥"
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-19",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 1
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11037256/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11012960",
              "author": {
                "username": {
                  "text": "Tejasv-17"
                },
                "userId": "ur211586322"
              },
              "summary": {
                "originalText": "Great movie but slightly mess up with devices during that time."
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Great and amazing movie but messes the tech. Touchscreen phones in 2007, ultrafast MMS in 2008 is unreal. Movie is amazing in terms of reality, even suger coated version of violence which happened in reality in liyari is still to violence for many of Indians which is very important to actually understand the enemy we are fighting with ,And it is important to show this to Indian Muslim who believe that they are oppressed by Hindus."
                }
              },
              "authorRating": 9,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": true,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11012960/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018602",
              "author": {
                "username": {
                  "text": "Omjaybhattgmailcom"
                },
                "userId": "ur211628662"
              },
              "summary": {
                "originalText": "Absolute thunderbolt"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Brilliant movie. This is cinema. Shows unfiltered, brutal truth. Great acting, direction, soundtracks and storytelling. Absolute masterpiece from Aditya Dhar. Since it doesn&#39;t fit the narrative of some people, they are rating it 1 star. But genuine viewers know that&#39;s it the best spy thriller ever made in India."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018602/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11010854",
              "author": {
                "username": {
                  "text": "ratnottardhruv"
                },
                "userId": "ur151131670"
              },
              "summary": {
                "originalText": "Must watch movie"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Literally most amazing movie .<br/><br/>Abhi tak jo hame bataya gya he raw and isi sath me milke kam kre wo sab is movie ne khatam kar diya jo really pakistan he wahi bataya he movie me great direction and story line ..<br/><br/>Or 26/11 wala audio boss great one please watch. And don&#39;t compare to yash direction wala spyverse and ranveer singh and all villains."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-08",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11010854/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11018744",
              "author": {
                "username": {
                  "text": "yaahosingh"
                },
                "userId": "ur196890062"
              },
              "summary": {
                "originalText": "Just Wow"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Very good movie,must watch.best bollywood movie of all time,aditya dhar produces a masterpiece wow brilliant acting by specially akshay khaana and other caste are fire too,this movie is gonna break all the records,ranveer looks good aftor 2 flops he is back in from,mind blowing movie,go for this movie."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-11",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11018744/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          },
          {
            "node": {
              "id": "rw11014294",
              "author": {
                "username": {
                  "text": "FXe-7"
                },
                "userId": "ur206080441"
              },
              "summary": {
                "originalText": "Oscar winning performance"
              },
              "text": {
                "originalText": {
                  "plaidHtml": "Both hero and villain are killing it in their acting performance. I love this movie. Public want more like this movie #fact check. Good work by director and crew also. This movie little bit long but it will stick with you and I like it 💞 Khanna sir and Ranbir Kapoor both are great actors and it&#39;s seems with their performance."
                }
              },
              "authorRating": 10,
              "submissionDate": "2025-12-09",
              "helpfulness": {
                "upVotes": 0,
                "downVotes": 0
              },
              "spoiler": false,
              "reportingLink": {
                "url": "https://contribute.imdb.com/review/tt33014583/rw11014294/report?bus=imdb&return_url=https%3A%2F%2Fwww.imdb.com%2Fclose_me&site=web"
              }
            }
          }
        ]
      }
    }
  },
  "extensions": {
    "disclaimer": "Public, commercial, and/or non-private use of the IMDb data provided by this API is not allowed. For limited non-commercial use of IMDb data and the associated requirements see https://help.imdb.com/article/imdb/general-information/can-i-use-imdb-data-in-my-software/G5JTRESSHJBBHTGX#",
    "experimentalFields": {
      "janet": [],
      "userProfile": []
    }
  }
}